{
  "last_updated": "2025-08-21T23:43:40.519897",
  "total_jobs": 294,
  "active_jobs": 294,
  "expired_jobs": 7,
  "jobs": [
    {
      "id": "70cdfc32ffea4d3ef253c798c6b48494",
      "title": "All Government Jobs",
      "url": "https://allgovernmentjobs.in/",
      "source": "allgovernmentjobs.in",
      "description": "Install All Government Jobs Home Latest Govt Jobs Results Qualifications Organizations Contact Us Login India's Best Portal for All Government Jobs Updates search 331 Notifications and 91,185 Jobs All Government Jobs - Sarkari Naukri India's Best Govt Job Site Get Your Latest Government Jobs Explore the world of All Government Jobs, which offer a wide range of career options. Our robust tool enables you to discover the perfect Govt job that aligns with your qualifications and interests. All G...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-07-28T19:02:41.914506",
      "links": []
    },
    {
      "id": "fe0401064c6850ee4a40cd1ad8e34043",
      "title": "Latest Govt Jobs",
      "url": "https://allgovernmentjobs.in/latest-government-jobs",
      "source": "allgovernmentjobs.in",
      "description": "Join on Telegram All Government Jobs Home Latest Govt Jobs Results Qualifications Organizations About Us Contact Us Register Login Home > Latest Government Jobs Government Jobs 2025 | 91,185 Latest Govt Jobs 331 Notifications All Government Jobs 2025: Here, you can apply for the latest job postings and recruitment notifications, we are expert in providing the government jobs that offer many employment opportunities for you. our job portal which provides the best recruitment information relate...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Excel",
        "Data Entry"
      ],
      "scraped_at": "2025-07-28T19:02:41.914549",
      "links": []
    },
    {
      "id": "df51fd822a4feaacdaf996e2d3c50661",
      "title": "Qualifications",
      "url": "https://allgovernmentjobs.in/jobs-by-qualification",
      "source": "allgovernmentjobs.in",
      "description": "Join on Telegram All Government Jobs Home Latest Govt Jobs Results Qualifications Organizations About Us Contact Us Register Login Jobs By Quaifications Education Total Post Notifications Apply Now 8th 456 12 Apply / View Staff Nurse 16,214 38 Apply / View B.Sc 10,620 37 Apply / View GNM 10,919 32 Apply / View Diploma 24,695 90 Apply / View B.Pharm 8,691 25 Apply / View D. Pharma 5,231 19 Apply / View DMLT 6,139 19 Apply / View Intermediate (10+2) 19,229 45 Apply / View B.sc Nursing 14,972 36...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914578",
      "links": []
    },
    {
      "id": "a14bae7bd9ce0589c8be86df885cf2ff",
      "title": "Organizations",
      "url": "https://allgovernmentjobs.in/jobs-by-organization",
      "source": "allgovernmentjobs.in",
      "description": "Join on Telegram All Government Jobs Home Latest Govt Jobs Results Qualifications Organizations About Us Contact Us Register Login Jobs By Organization Organization Total Post Notifications Apply Now DHS 80 6 Apply / View NHM 3,176 26 Apply / View BITS 2 1 Apply / View ESIC 351 4 Apply / View LHMC 123 1 Apply / View IIT 5 4 Apply / View Indian Navy 65 2 Apply / View SVSU 2 1 Apply / View TMC 146 14 Apply / View IIM Visakhapatnam 4 1 Apply / View 1 2 3 Next All Government Jobs AllGovernmentJob...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914607",
      "links": []
    },
    {
      "id": "3aebc6c7ddcf741178ffb334ccd84169",
      "title": "Medical",
      "url": "https://allgovernmentjobs.in/medical-jobs",
      "source": "allgovernmentjobs.in",
      "description": "The Lady Hardinge Medical College (LHMC) has officially released the notification to fill 123 Senior Resident Posts. Int... All India Institute of Medical Sciences (AIIMS) Delhi has announced the official notification for 2025. To fill up the v... National Health Mission (NHM) Chandigarh has published the official notification for 2025. To fill up the vacancies for ... The District and Health Office (DMHO) Nizamabad has published the official notification for 2025. To fill up the vacanci... T...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914632",
      "links": []
    },
    {
      "id": "d7cfa41aa25c524e2ccb0798d6b41c8f",
      "title": "Engineering",
      "url": "https://allgovernmentjobs.in/engineering-jobs",
      "source": "allgovernmentjobs.in",
      "description": "Join on Telegram All Government Jobs Home Latest Govt Jobs Results Qualifications Organizations About Us Contact Us Register Login Home > Engineering Jobs Engineering Govt Jobs 2024- [all vacancies] Posts B.E / B.Tech, M.E / M.Tech Engineering Jobs : For all the students in India who have a dream to become an engineer and work in the government sector, Government Jobs for Engineering is the best match. The Central Government of India has announced Total 8987 vacancies for people who like to g...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914654",
      "links": []
    },
    {
      "id": "40739f76344ff63612b1eab1bd5e8bb6",
      "title": "Finance",
      "url": "https://allgovernmentjobs.in/mba-jobs",
      "source": "allgovernmentjobs.in",
      "description": "The Ladakh Autonomous Hills Development Council (LAHDC) has officially released the notification to fill the vacancies o... The Hindustan Insecticides Limited (HIL) has officially released the notification to fill the vacancies of 13 Managers, ... The Bureau of Indian Standards (BIS) has announced the official notification for 2025. To fill up the vacancies for the&... The National Institute of Agricultural Extension Management (MANAGE) has announced the official notification for 2025. T... T...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914687",
      "links": []
    },
    {
      "id": "55ec3dbde87163e0b1955d0a26c8029e",
      "title": "Nurse",
      "url": "https://allgovernmentjobs.in/staff-nurse-jobs",
      "source": "allgovernmentjobs.in",
      "description": "Join on Telegram All Government Jobs Home Latest Govt Jobs Results Qualifications Organizations About Us Contact Us Register Login Home > Staff Nurse Jobs Staff Nurse Vacancy 2024, 8548 Upcoming Nursing Job alert Staff Nurse Vacancy : Every year, lakhs of students apply for Government jobs as off now Total 12116 Nursing Govt Jobs were available, and try their best to secure a place in the tough government industry. This time, the Central Government of India has announced Staff Nurse Vacancy 2...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "25-07-29"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914709",
      "links": []
    },
    {
      "id": "f8da4d1065d86319bcab0375f7a7ee5f",
      "title": "Pharmacy",
      "url": "https://allgovernmentjobs.in/pharmacy-jobs",
      "source": "allgovernmentjobs.in",
      "description": "District Health Society (DHS) Tirunelveli has announced the official notification for 2025. To fill up the vacancies for... The District Health Society, Erode (DHS Erode) has officially released the notification to fill the vacancies of 120&nbs... The Madhya Pradesh Employee Selection Board (MPESB) has officially released the notification to fill the vacancies of 75... The Ex-Servicemen Contributory Health Scheme (ECHS) has officially released the notification to fill the vacancies of 19... T...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914729",
      "links": []
    },
    {
      "id": "ba7971b0ef03335f68b55c65d003d7a6",
      "title": "Dental",
      "url": "https://allgovernmentjobs.in/bds-jobs",
      "source": "allgovernmentjobs.in",
      "description": "The Lady Hardinge Medical College (LHMC) has officially released the notification to fill 123 Senior Resident Posts. Int... All India Institute of Medical Sciences (AIIMS) Delhi has announced the official notification for 2025. To fill up the v... The University of Lucknow has officially released the notification for 2025. To fill up the vacancies for Research ... The Ex-Servicemen Contributory Health Scheme (ECHS) has officially released the notification to fill the vacancies of 19... The Tr...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914750",
      "links": []
    },
    {
      "id": "2a7aa9e0a17fc238afce7ef7eb24c2ae",
      "title": "Aviation",
      "url": "https://allgovernmentjobs.in/aeronautical-engineering-jobs",
      "source": "allgovernmentjobs.in",
      "description": "SJVN has invited online applications for Apprentice Jobs. There are 300 positions released in Himachal Pradesh Gove... CSIR-National Aerospace Laboratories (NAL) has introduced the latest job notification for the 74 Project Associate, Seni... DRDO-Advanced Centre for Energetic Material (ACEM) has issued a new job notification for the position of Apprentice... Pawan Hans Limited (PHL) has published the latest job notification for the 20 General Manager, Joint General Manage... Central Mechanic...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914777",
      "links": []
    },
    {
      "id": "91f96aa87b17a2f9d92025c6155d4267",
      "title": "Naval",
      "url": "https://allgovernmentjobs.in/indian-navy-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Navy Recruitment has officially released the notiifcation to fill the vacancies of 15 SSC Executive Posts. In .... The Indian Navy has announced the official notification for 2025. To fill up the vacancies for 50 Technician Appren .... The Indian Navy has officially released the notification for the 1097 Fireman, Chargeman, Staff Nurse, Pharmacist, .... The Indian Navy has officially released the notification for 02 Staff Nurse Posts. Interested and eligible candidates ca ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914799",
      "links": []
    },
    {
      "id": "d7c0b557d3d17d5cc3a05ba010391419",
      "title": "Hotel Management",
      "url": "https://allgovernmentjobs.in/hotel-management-jobs",
      "source": "allgovernmentjobs.in",
      "description": "DU Jobs 2023 is now out on its official website. Candidates who are looking for the University of Delhi Jobs 2023 can ap... Institute of Hotel Management, Catering Technology & Applied Nutrition (IHMCTAN), Mumbai invites applicants to fill ... National Institute of Technical Teachers Training and Research (NITTTR) Chennai has announced the Latest Job Notificatio... Jharkhand Staff Selection Commission (JSSC) has announced the Latest Job Notification for the Post of Training Officer w... Natio...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914820",
      "links": []
    },
    {
      "id": "cdf3a911adf444977ac2ed3413ace85c",
      "title": "Sports Quota",
      "url": "https://allgovernmentjobs.in/sports-quota-jobs",
      "source": "allgovernmentjobs.in",
      "description": "Railway Recruitment Cell - East Central Railway has officially declared the notification for the posts of Sportsperson i... Northern Railway has released the notification for the position of Sports Quota. There are 21 vacancies announced on its... North Western Railway If you're passionate about sports and looking for a job opportunity, North Western Railway may hav...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914840",
      "links": []
    },
    {
      "id": "9652317edecb5d653907b3152758d8b1",
      "title": "Architecture",
      "url": "https://allgovernmentjobs.in/architectural-engineering-jobs",
      "source": "allgovernmentjobs.in",
      "description": "National Aluminium Company Limited (NALCO) has issued a new job notification for the positions of Executive Director, Gr... Bharat Earth Movers Limited (BEML) has introduced the latest job notification for the 26 Chief General Manager, Assistan... Rail India Technical and Economic Services Limited (RITES) has published the latest job notification for the 01 &nb... School of Planning and Architecture, Bhopal (SPA) has released the latest job notification for the 01 Junior Research Fe... The Na...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914860",
      "links": []
    },
    {
      "id": "56ea27387e66431c8e7a34e7d791a0ac",
      "title": "ITI / Diploma",
      "url": "https://allgovernmentjobs.in/iti-jobs",
      "source": "allgovernmentjobs.in",
      "description": "Tata Memorial Centre (TMC) has announced the official notification for 2025. To fill up the vacancies for Technicia... The Ladakh Autonomous Hills Development Council (LAHDC) has officially released the notification to fill the vacancies o... The Railway Recruitment Board (RRB) has officially released the notification to fill the vacancies of 6238 Technician Gr... The Hindustan Aeronautics Limited (HAL India) has officially released the notification to fill the vacancies of 03 Gradu... The Pu...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914881",
      "links": []
    },
    {
      "id": "3bac3da83cb5d4a1f4731fce8cf4521d",
      "title": "Agriculture",
      "url": "https://allgovernmentjobs.in/agricultural-engineering-jobs",
      "source": "allgovernmentjobs.in",
      "description": "The Assam Public Service Commission (Assam PSC) has released the official Notification for 2025. To fill up the Vacancie...",
      "pdf_link": null,
      "important_dates": {},
      "category": "General",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.914905",
      "links": []
    },
    {
      "id": "7f7fdbb53a2d9ac367eac10b9d9ffdf2",
      "title": "DHS Tirunelveli Recruitment 2025 - Apply Online for 45 Staff Nurse and Other Posts",
      "url": "https://allgovernmentjobs.in/dhs-tirunelveli-recruitment-2025-apply-online-for-45-staff-nurse-and-other-posts/33708",
      "source": "allgovernmentjobs.in",
      "description": "District Health Society (DHS) Tirunelveli has announced the official notification for 2025. To fill up the vacancies for 45 Staff Nurses, a Pharmacist, Health Inspectors, Lab Technician, and Other Positions. Those candidates who have qualified in the Diploma, GNM, B.Sc, B.Pharm, D.Pharm, 12th, DMLT, and 8th can grab this chance and apply for the DHS Tirunelveli Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "24-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.923656",
      "links": []
    },
    {
      "id": "83b3d4b065746d04e3031c3c0c39fa55",
      "title": "BITS Pilani Recruitment 2025 - Apply for 02 Project Technical Support and Other Post",
      "url": "https://allgovernmentjobs.in/bits-pilani-recruitment-2025-apply-for-02-project-technical-support-and-other-post/33705",
      "source": "allgovernmentjobs.in",
      "description": "Birla Institute of Technology and Science (BITS) Pilani has announced the official notification for 2025. To fill up the vacancies for 02 Project Technical Support and Junior Research Fellow Jobs. Those candidates who have qualified in the Post Graduation, B.Sc can utilize this chance and apply for the BITS Recruitment 2025 . Here we mentioned the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candi...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "18-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-07-28T19:02:41.923726",
      "links": []
    },
    {
      "id": "e3e9a487d6106650c839399c18902cda",
      "title": "IIT Jammu Recruitment 2025 - Apply Online for 02 Junior Research Fellow Post",
      "url": "https://allgovernmentjobs.in/iit-jammu-recruitment-2025-apply-online-for-02-junior-research-fellow-post/33704",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology (IIT) Jammu has published the official notification for 2025. Allotted 02 vacancies for Junior Research Fellow Jobs. Those candidates who have qualified in the B.E/ B.Tech., M.E/ M.Tech in Electrical Engineering, Electronics and Communication Engineering can grab this chance and apply for these posts. Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the IIT Jammu Recruitment 2025 . Inte...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "22-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-07-28T19:02:41.923749",
      "links": []
    },
    {
      "id": "1240c9bcf7efb886c725f0e16a53f433",
      "title": "SVSU Recruitment 2025 - Walk-in-Interview for 02 Junior Engineer Post",
      "url": "https://allgovernmentjobs.in/svsu-recruitment-2025-walk-in-interview-for-02-junior-engineer-post/33702",
      "source": "allgovernmentjobs.in",
      "description": "The Shri Vishwakarma Skill University (SVSU) has published the official notification for 2025. To fill up the vacancies for 02 Junior Engineer Jobs. Those candidates who have qualified in the B.E/ B.Tech. in Civil Engineering, Electrical Engineering can grab this chance and apply for the SVSU Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates fill out th...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "01-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:02:41.923790",
      "links": []
    },
    {
      "id": "8e0b8ccff550a91aa8cd23e2dc7a6dfd",
      "title": "TMC Recruitment 2025 - Walk-in-Interview for Data Entry Operator Post",
      "url": "https://allgovernmentjobs.in/tmc-recruitment-2025-walk-in-interview-for-data-entry-operator-post/33700",
      "source": "allgovernmentjobs.in",
      "description": "The Tata Memorial Centre (TMC) has announced the official notification for 2025. To fill up the vacancies for Data Entry Operator Jobs. Those candidates who have qualified in Any Graduate can grab this chance and apply for these posts. Here, we include the age limit, selection process, salary structure, educational details, application fee, and instructions on how to apply for the TMC Recruitment 2025 . Interested and eligible candidates can attend a walk-in interview at the given venue. For ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "31-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-07-28T19:02:41.923829",
      "links": []
    },
    {
      "id": "9e5173dfc6aa9b7ed3bbd4b929c161e7",
      "title": "IIMV Recruitment 2025 - Apply Offline for 04 Professor and Other Posts",
      "url": "https://allgovernmentjobs.in/iimv-recruitment-2025-apply-offline-for-04-professor-and-other-posts/33699",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Management Vishakapatnam (IIMV) has officially released the notification to fill the vacancies of 04 Professor, Associate Professor, and Assistant Professor Jobs. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Ph.D. and post-graduation can apply for the IIMV Recruitment 2025. The interested applicants can apply in offline mode. Here we have mentioned the educa...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "23-08-2025",
        "found_date": "23-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-07-28T19:02:41.923847",
      "links": []
    },
    {
      "id": "9bb1c83a1fc799a36ed8d17f7a79bb9d",
      "title": "Govt Jobs",
      "url": "https://www.jobriya.in/category/government-jobs/",
      "source": "www.jobriya.com",
      "description": "UPPSC LT Grade Teacher Recruitment 2025 (7466 Posts) Apply Online Madhu Chaudhary / July 28, 2025 UP LT Grade Teacher Recruitment 2025 OUT! Uttar Pradesh Public Service Commission Has Released UPPSC LT Grade Teacher Exam 2025 […] UPPSC LT Grade Teacher Recruitment 2025 (7466 Posts) Apply Online Read Post »  SSC CPO Recruitment 2025 Delhi Police SI ASI Notification Apply Online Madhu Chaudhary / July 28, 2025 SSC CPO Recruitment 2025 SSC CPO 2025 Notification Exam Date SSC CPO exam 2025 Online...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:03:22.320212",
      "links": []
    },
    {
      "id": "fce6026a5c36feda9920b1a95dfbeac5",
      "title": "SSC MTS Notification 2025 Multi Tasking Staff Online Application",
      "url": "https://www.jobriya.in/ssc-mts-2025-notification-multi-tasking-staff-vacancy/",
      "source": "www.jobriya.com",
      "description": "SSC MTS 2025 Application Form SSC MTS 2025 Notification Exam Date SSC MTS 2025 SSC Multi Tasking Staff Exam MTS Online Application 2025 SSC has finally released the notification for SSC Multi Tasking Staff Exam 2025 SSC MTS Eligibility 2025 SSC MTS 2025 SSC MTS Selection Process 2025 SSC MTS 2025 Exam Notification Latest Updates dated 24.06.2025:- SSC will Released MTS (Non-Technical) Staff & Havaldar Notification On 29th June 2025… Download Official Notice Through the Given Link Below… Staff...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "26-06-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-07-28T19:03:22.321497",
      "links": [
        "https://ssc.gov.in"
      ]
    },
    {
      "id": "31812d1043f04b6fe4ebd5829f09704e",
      "title": "UPPSC LT Grade Teacher Recruitment 2025 (7466 Posts) Apply Online",
      "url": "https://www.jobriya.in/uppsc-lt-grade-teacher-recruitment-2025/",
      "source": "www.jobriya.com",
      "description": "UP LT Grade Teacher Recruitment 2025 OUT! Uttar Pradesh Public Service Commission Has Released UPPSC LT Grade Teacher Exam 2025 Notice, Uttar Pradesh LT Grade Teacher Recruitment 2025 Download Notification. UPPSC Assistant Teacher, Trained Graduate Grade (Female Branch) 7466 Vacancy 2025 Notification Check Age limit, Education Qualification and How to Apply ONLINE Below. UP LT Grade Teacher Recruitment 2025 Last Update on 28.07.2025 UPPSC Has Started UP LT Grade Teacher Recruitment Online App...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "English",
        "Hindi",
        "Mathematics"
      ],
      "scraped_at": "2025-07-28T19:03:22.323767",
      "links": [
        "https://uppsc.up.nic.in"
      ]
    },
    {
      "id": "d1d9820828746d99bb370eba46739d12",
      "title": "IB Security Assistant Recruitment 2025 OUT for 4987 Posts (LINK) Apply Online Here",
      "url": "https://www.jobriya.in/ib-security-assistant-recruitment-2025-out-4987-posts-apply-online/",
      "source": "www.jobriya.com",
      "description": "IB Security Assistant Recruitment 2025 OUT! Intelligence Bureau Has Announced Recruitment for 4987 Security Assistant (Executive) Posts. MHA IB Security Assitant Online Application Form 2025, Ministry of Home Affairs Security Assistant Vacancy 2025 Intelligence Bureau IB Security Assistant Notification Apply Online IB Security Assistant Recruitment 2025 Last Updated on 27.07.2025 Intelligence Bureau, Ministry of Home Affairs Has Released IB Secuity Assistant Recruitment 2025 for a Total of 49...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "15/1/76"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:03:22.323793",
      "links": [
        "https://mha.gov.in"
      ]
    },
    {
      "id": "7ce3a6f60f60e6153a2c74cda7741fa5",
      "title": "Gauhati High Court Junior Administrative Assistant Recruitment 2025 Apply for 367 JJA Posts",
      "url": "https://www.jobriya.in/gauhati-high-court-junior-administrative-assistant-recruitment-2025-out-367-posts-apply-online/",
      "source": "www.jobriya.com",
      "description": "Gauhati High Court Junior Administrative Assistant Recruitment 2025 Gauhati High Court Online applications are invited for filling the vacancies of Junior Administrative Assistants in the district courts of Assam Gauhati High Court JJA 367 Vacancy Notification Apply Online Age Qualification Fees Exam Date Gauhati High Court JJA Recruitment 2025 Latest Update Dated 15.07.2025 : Gauhati High Court Has Started the Online Application Process for Junior Administrative Assistants Vacancy. Candidate...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Word",
        "Computer Knowledge"
      ],
      "scraped_at": "2025-07-28T19:03:22.323814",
      "links": [
        "https://ghconline.gov.in"
      ]
    },
    {
      "id": "376d5eae11cab144a82c39efad7451cd",
      "title": "RRB Technician Recruitment 2025 (6238 Posts) Railway Grade III Apply Online",
      "url": "https://www.jobriya.in/rrb-technician-recruitment-recruitment-2025/",
      "source": "www.jobriya.com",
      "description": "RRB Technician Recruitment 2025 Railway Applications are invited from eligible candidates for Technician Grade-I Signal & Technician Grade III Check Notification Last Date RRB CEN 02/2025 Apply Online RRB Technician Recruitment 2025 Online Applications are invited from eligible candidates who are Indian Nationals for Technician Grade-I Signal & Technician Grade III. Applications must be submitted online and no other mode of submission of the same would be entertained. Origination Name Railway...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "28-06-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:03:22.323835",
      "links": [
        "https://www.rrbmumbai.gov.in"
      ]
    },
    {
      "id": "f1ee1358e0099bb104806fbbfbbe8b30",
      "title": "UPSESSB TGT PGT Recruitment 2025 UP TGT PGT (30000 Posts) Online Form Date",
      "url": "https://www.jobriya.in/up-tgt-pgt-teachers-recruitment-2025-upsessb-online-form/",
      "source": "www.jobriya.com",
      "description": "UPSESSB TGT PGT Recruitment 2025 Apply Online for 30000 Posts How to Apply for UP TGT PGT Vacancy 2025 UPSESSB Vacancy 2025 UP Trained Graduate Teacher / Post Graduate Teacher Apply Online Link 2025 UP TGT PGT 30,000 Posts Notification 2025 for TGT / PGT Posts Check Age Limit Eligibility Criteria Apply Online Last Date UPSESSB TGT PGT Recruitment 2025 Latest Update 26.07.2025 : UPSESSB Will Release Recruitment Notification for 30,000 TGT and PGT Teachers. Online Application will Be Start Soon...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "09/06/2022"
      },
      "category": "Banking",
      "skills": [
        "English",
        "Hindi"
      ],
      "scraped_at": "2025-07-28T19:03:22.323853",
      "links": [
        "http://pariksha.up.nic.in/",
        "https://pariksha.up.nic.in",
        "https://www.upsessb.org/"
      ]
    },
    {
      "id": "c97650692601f4a0c6e5301c239e0320",
      "title": "IB ACIO Recruitment 2025 MHA IB ACIO-II/Exe (3717 Posts) Apply Online",
      "url": "https://www.jobriya.in/ib-acio-recruitment-2025-apply-online-for-3717-posts/",
      "source": "www.jobriya.com",
      "description": "Intelligence Bureau ACIO Recruitment 2025 IB ACIO Vacancy 2025 Ministry of Home Affairs has released the Notification of IB Intelligence Officer Vacancy to fill 3717 Assistant Central Intelligence Officer, Grade II/ Executive Posts Ministry of Home Affairs IB ACIO-II Executive Apply Online Link Intelligence Bureau ACIO Posts Official Link MHA IB ACIO Recruitment 2025 Latest Update 25.07.2025: IB has start online application for ACIO/ Executive, Exam 2025. … Candidates Stay Connected with us f...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:03:22.323872",
      "links": [
        "https://www.recruitmentonline.in/mha10/",
        "https://www.mha.gov.in"
      ]
    },
    {
      "id": "1d328c9d991b0564643ba0d5d9933d26",
      "title": "Chandigarh Police Constable Recruitment 2025 (450 Posts) Apply Online",
      "url": "https://www.jobriya.in/chandigarh-police-constable-recruitment-2025/",
      "source": "www.jobriya.com",
      "description": "Chandigarh Police Constable Recruitment 2025 is Started Now You can Apply By Online Link For 450 Posts of Chandigarh Police Male Female Constable Recruitment 2025 So Download Chandigarh Police Constable Notification By Direct Link Given Below Chandigarh Police Constable Recruitment 2025 Latest Updated On 13.07.2025 :- Chandigarh Police Department Will Soon start the recruitment Process for 400 Constable Posts. Candidates can check More details from below notice… About Chandigarh Police Consta...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "7/12/1998"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:03:22.323890",
      "links": [
        "https://chandigarhpolice.nic.in",
        "https://chandigarhpolice.gov.in"
      ]
    },
    {
      "id": "75a360d9722376368bff51333034d25f",
      "title": "Defence Jobs",
      "url": "https://www.rojgarresult.com/category/defence-jobs/",
      "source": "www.rojgarresult.com",
      "description": "Skip to content Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com > Defence Jobs July 21, 2025 Bihar Police Constable Driver Online Form 2025 for 4361 July 12, 2025 Indian Airforce Agniveervayu...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Hindi"
      ],
      "scraped_at": "2025-07-28T19:21:50.358191",
      "links": []
    },
    {
      "id": "6d9519db9d0d547b9eee164f50fe352a",
      "title": "Latest Form 2025",
      "url": "https://www.rojgarresult.com/recruitments/",
      "source": "www.rojgarresult.com",
      "description": "Latest Form Online and Offline Form on Sarkari Naukri Result 2025, RojgarResults is a Latest Form  Recruitment Portal provides details of all Recruitment  , Sarkari Naukri 2025, rojgar result rojgarresult.com | Govt Jobs & Govt Jobs of Railway RRB NTPC,RRB Group D, 10 2 latest job. up police, bihar stet Latest Form Railway RRB Technician Online Form 2025 for 6238 Post UPPSC Assistant Teacher LT Online Form 2025 for 7466 Post RPSC Veterinary Officer Online Form 2025 for 1100 Post MHA IB Securi...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Hindi"
      ],
      "scraped_at": "2025-07-28T19:21:50.368270",
      "links": []
    },
    {
      "id": "7b21ab830535013c9258f22b9ecf3a61",
      "title": "IPA Indian Ports Association Various Post Online Form 2025",
      "url": "https://www.rojgarresult.com/ipa-recruitment/",
      "source": "www.rojgarresult.com",
      "description": "Indian Ports Association IPA Recruitment 2025: Apply for 41 Post Post Update Date: 05-07-2025 Short Description: IPA Recruitment 2025 Apply Online Form : IPA Online Form 2025, Notification has been released on the website @https://www.ipa.nic.in & Application Form now started on 30 June 2025 to 30 July 2025 | Indian Ports Association Jobs 2025. Get the direct link to download notification link available on IPA Vacancy 2025 Official Website and More Other Details Age Limit / Qualification / Va...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "05-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:21:50.368320",
      "links": [
        "https://www.ipa.nic.in"
      ]
    },
    {
      "id": "9391f8160ef90400be9135494ab81603",
      "title": "DMER Recruitment 2025 Apply Online Form for 1107 Post",
      "url": "https://www.rojgarresult.com/dmer-recruitment/",
      "source": "www.rojgarresult.com",
      "description": "DMER Various Post Online Form 2025 Post Date: 26-06-2025 Short Description: DMER Recruitment 2025 Apply Online Form : DMER Recruitment 2025 Online Form, Notification has been released on the website @https://www.med-edu.in/ & Application Form now started on 19 th July’25 for Directorate of Medical Education and Research Mumbai Jobs 2025. Get the direct link to download notification link available on DMER Vacancy 2025 Official Website and More Other Details Age Limit / Qualification / Vacancy ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "26-06-2025"
      },
      "category": "Banking",
      "skills": [
        "Hindi",
        "English"
      ],
      "scraped_at": "2025-07-28T19:21:50.368341",
      "links": [
        "https://www.med-edu.in/"
      ]
    },
    {
      "id": "a98b32f479af9ebfc3b2e764d50b093d",
      "title": "Bihar PRD Technical Assistant Recruitment 2025",
      "url": "https://www.rojgarresult.com/bihar-prd-technical-assistant-recruitment/",
      "source": "www.rojgarresult.com",
      "description": "Bihar PRD Technical Assistant Recruitment 2025 Apply Online for 942 Post Post Update Date: 24 -06-2025 Short Description: Bihar PRD Technical Assistant Online Form 2025: Bihar Panchayati Raj Department has announced recruitment for Technical Assistant Post . Candidates who want to apply online can apply from the link given on Rojgar Result. Bihar PRD Technical Assistant Vacancy 2025 can be filled from 26 May 2025 to 25 June 2025. More Other Recruitment | Jobs Online Form | Vacancy Offline For...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:21:50.368361",
      "links": [
        "https://zp.bihar.gov.in/"
      ]
    },
    {
      "id": "1820d4aa20e3deca5289fbe6db340b20",
      "title": "AAI Pilot Recruitment 2025",
      "url": "https://www.rojgarresult.com/aai-pilot-recruitment/",
      "source": "www.rojgarresult.com",
      "description": "Airport Authority of India Pilot Recruitment 2025 Post Date: 06-06-2025 Short Description: AAI Pilot Recruitment 2025 : AAI Pilot Recruitment 2025 has been issued by Airport Authority of India This Recruitment has been issued on a Total of 02 Post , Candidate apply through offline mode within 04 June 2025 to 27 June 2025 . For more Information visit official website @https://www.aai.aero/. Candidate can download the official notification through the link given below.More Other Recruitment | J...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "06-06-2025"
      },
      "category": "Banking",
      "skills": [
        "Mathematics"
      ],
      "scraped_at": "2025-07-28T19:21:50.368380",
      "links": [
        "https://www.aai.aero/.",
        "https://www.aai.aero/"
      ]
    },
    {
      "id": "0cda15c82fa1fb9ab70e9554e39f4a4f",
      "title": "MP Primary Teacher Apply Online",
      "url": "https://www.rojgarresult.com/mpesb-pstst-primary-school-july25/",
      "source": "www.rojgarresult.com",
      "description": "MP Employees Selection Board MPESB Primary School Teacher Selection Test PSTST 2025 : Apply Online for 10150 Post Post Update Date: 21-07-2025 Short Description: MP Employees Selection Board MP ESB Primary School Teacher Online Form 2025 : MP Employees Selection Board MPESB Primary School Teacher Selection Test PSTST Official Notification is released and Online Form Now Started on 18 July 2025 to 01 August 2025 is Last Date for MPESB PSTST Examination 2025 Full Notification available at the o...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "21-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:21:50.388718",
      "links": []
    },
    {
      "id": "f61089ea0ff452023bd7053636fa3e1a",
      "title": "IBPS PO 2025 Apply Online",
      "url": "https://www.rojgarresult.com/ibps-po/",
      "source": "www.rojgarresult.com",
      "description": "IBPS PO Recruitment 2024: Apply for 4455 Post Post Update Date: 22-08-2024 Short Description: IBPS PO Online Form 2024: Institute of Banking Personal Selection Probationary Officer has announced recruitment for 120 posts of IBPS PO Probationary Officer . Candidates who want to apply online can apply from the link given on Rojgar Result. IBPS Probationary Officer PO Online Form 2024 can be filled from 01 August 2024 to 28 August 2024. . More Other Recruitment / Syllabus / Admit Card / Result V...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "22-08-2024"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:21:50.388783",
      "links": [
        "https://www.ibps.in/"
      ]
    },
    {
      "id": "74a661b6497b9df3133dd86419b68814",
      "title": "Bihar Police Constable Admit Card",
      "url": "https://www.rojgarresult.com/bihar-police-constable-admit-card/",
      "source": "www.rojgarresult.com",
      "description": "CSBC Bihar Police Constable Exam City / Admit Card 2025 Post Update Date: 09-07-2025 Short Details: Bihar Police Constable Admit Card 2025: CSBC Bihar Police Constable Admit Card 2025 has been released on official website @https://csbc.bih.nic.in/ and Bihar Police Constable Exam Date is 16/07/2025 to 03/08/2025 for 19838 Post whose, candidates who applied for the job of Bihar Police Constable Recruitment 2025 can download their admit card. More Other Recruitment | Jobs Online Form | Vacancy O...",
      "pdf_link": null,
      "important_dates": {
        "exam_date": "16/07/2025",
        "found_date": "09-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-07-28T19:21:50.388804",
      "links": [
        "https://csbc.bih.nic.in/"
      ]
    },
    {
      "id": "a5582bd0e206977389a37251f8f1a354",
      "title": "Rajasthan HC Class IV 2025 Apply Online",
      "url": "https://www.rojgarresult.com/rhc-class-iv-peon-june-2025/",
      "source": "www.rojgarresult.com",
      "description": "Rajasthan High Court RHC Joint recruitment of Class IV Employees for RHC RSJA RSLSA District Courts and DLSAs 2025 : Apply Online Form for 5670 Post Post Date: 27-06-2025 Short Description: Rajasthan High Court Class IV Peon Online Form 2025 for 850 Post: Rajasthan HC Joint recruitment of Class IV Employees for RHC RSJA RSLSA District Courts and DLSAs 2025  Official Notification is released and Online Form Now Started on 26 June 2025 to 27 July 2025 is Last Date for  RHC Class IV Peon Examina...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "27-06-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:21:50.388824",
      "links": []
    },
    {
      "id": "c6ca572bf1523958b5f639623940b76b",
      "title": "Railway Technician 2025 Apply Online",
      "url": "https://www.rojgarresult.com/rrb-technician-cen-02-2025/",
      "source": "www.rojgarresult.com",
      "description": "Railway RRB Technician I & Technical Grade III CEN 02/2025: Apply Online Form for 6238 Post Post Date: 28-07-2025 Short Description: Railway RRB Technician Online Form 2025 for 6238 Post: Railway Recruitment Board RRB Technician I and Technician III CEN 02/2025 Official Notification is released and Online Form Now Started on 28 June 2025 to 07 August 2025 is Last Date for Upcoming RRB Technician I Signal & Technician III Examination, Vacancy 2025 Full Notification available at the official we...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "28-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Hindi",
        "English"
      ],
      "scraped_at": "2025-07-28T19:21:50.388861",
      "links": []
    },
    {
      "id": "7f71515d547ae0a50bb44036c3505af9",
      "title": "Sarkari Yojana",
      "url": "https://www.rojgarresult.com/category/sarkari-yojna/",
      "source": "www.rojgarresult.com",
      "description": "Skip to content Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com > Sarkari Yojna May 29, 2025 Pradhan Mantri Awas Yojana Registration 2025 | PMAY Urban 2.0 May 11, 2025 Haryana Mukhyamantri Aw...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "General Knowledge",
        "Hindi"
      ],
      "scraped_at": "2025-07-28T19:21:50.388880",
      "links": []
    },
    {
      "id": "cd60997d3c96177f7c275afa6e376d47",
      "title": "10th & 10+2 Jobs",
      "url": "https://www.rojgarresult.com/category/10th-12th/",
      "source": "www.rojgarresult.com",
      "description": "Skip to content Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com > 10th 12th Jobs July 28, 2025 Railway RRB Technician Online Form 2025 for 6238 Post July 25, 2025 BSF Constable Tradesman Onli...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Hindi"
      ],
      "scraped_at": "2025-07-28T19:21:50.388898",
      "links": []
    },
    {
      "id": "9f785a4bdc0607a77af10f7dba6f9044",
      "title": "B.Tech / MBA Jobs",
      "url": "https://www.rojgarresult.com/category/btech-mba/",
      "source": "www.rojgarresult.com",
      "description": "Skip to content Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com > B.Tech MBA Jobs July 28, 2025 Railway RRB Technician Online Form 2025 for 6238 Post July 23, 2025 MPPGCL Various Post Online ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Hindi"
      ],
      "scraped_at": "2025-07-28T19:21:50.388957",
      "links": []
    },
    {
      "id": "4cc548d055148bdde7d54354c8ee817a",
      "title": "TI / Diploma / Apprentice Jobs",
      "url": "https://www.rojgarresult.com/category/apprentices/",
      "source": "www.rojgarresult.com",
      "description": "Skip to content Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com > Apprentice Jobs July 23, 2025 MPPGCL Various Post Online Form 2025 for 346 Post July 22, 2025 BHEL Artisan Online Form 2025 J...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Hindi"
      ],
      "scraped_at": "2025-07-28T19:21:50.388977",
      "links": []
    },
    {
      "id": "52c35fdefc6b40709edd73ce56716fd5",
      "title": "MPESB Various Paramedical Post Online Form 2025",
      "url": "https://www.rojgarresult.com/mpesb-paramedical-post-july-2025/",
      "source": "www.rojgarresult.com",
      "description": "MP Employees Selection Board MPESB Paramedical Combined Recruitment Test 2025 : Apply Online for 464 Post Post Update Date: 28-07-2025 Short Description: MP Employees Selection Board MP ESB Various Paramedical Post Online Form 2025 : MP Employees Selection Board MPESB Paramedical Combined Recruitment Test 2025 Official Notification is released and Online Form Now Started on 28 July 2025 to 11 August 2025 is Last Date for MPESB Paramedcial Post Examination 2025 Full Notification available at t...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "28-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-28T19:21:50.388999",
      "links": []
    },
    {
      "id": "eddd5100ef271a244deeb33275da4e58",
      "title": "UPPSC Assistant Teacher LT Online Form 2025 for 7466 Post",
      "url": "https://www.rojgarresult.com/uppsc-assistant-teacher-july-2025/",
      "source": "www.rojgarresult.com",
      "description": "UPPSC Assistant Teacher Recruitment 2025: Apply Online for 7466 Post, OTR Registration Post Update : 28-07-2025 Short Description: UPPSC Assistant Teacher Trained Graduate Category Online Form 2025 for 7466 Post : Uttar Pradesh Public Service Commission UPPSC Advt No A-5/E-1/2025 Official Notification is released and Online Form Now Started on 28 July 2025 to 28 August 2025 is Last Date for  UPPSC Assistant Teacher Vacancy 2025 Full Notification available at the official website. All the cand...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "28/08/2025",
        "found_date": "28-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Hindi",
        "English"
      ],
      "scraped_at": "2025-07-28T19:21:50.389029",
      "links": []
    },
    {
      "id": "701103259bc074b2be76ed19b15e344e",
      "title": "RPSC Veterinary Officer Online Form 2025 for 1100 Post",
      "url": "https://www.rojgarresult.com/rpsc-veterinary-officer-2025/",
      "source": "www.rojgarresult.com",
      "description": "RPSC Veterinary Officer Recruitment 2025: Apply for 1100 Post Post Date: 26-07-2025 Short Description: RPSC Veterinary Officer Recruitment 2025 Apply Online Form : Rajasthan Public Service Commission RPSC Veterinary Officer Online Form 2025, Notification has been released on the website @https://rpsc.rajasthan.gov.in/ & Application Form now started on 05 August 2025 to 03 September 2025 for Total 1100 Post Rajasthan Public Service Commission Jobs 2025. Get the direct link to download notifica...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "26-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Hindi"
      ],
      "scraped_at": "2025-07-28T19:21:50.389047",
      "links": [
        "https://rpsc.rajasthan.gov.in/"
      ]
    },
    {
      "id": "a3d1eb644cdefbb8db37ae01dee75983",
      "title": "CMO Sonbhadra Recruitment 2025 - Apply Offline for 23 Medical Officer and Other Posts",
      "url": "https://allgovernmentjobs.in/cmo-sonbhadra-recruitment-2025-apply-offline-for-23-medical-officer-and-other-posts/33741",
      "source": "allgovernmentjobs.in",
      "description": "The Chief Medical Officer (CMO) of Sonbhadra has announced the official notification for 2025. To fill up the vacancies for 23 Medical Officers and General Physician Positions. Those candidates who have completed their MBBS can grab this chance and apply for the CMO Sonbhadra Recruitment 2025 . Here we include the age limit, selection process, salary structure, and education details, application fee, and how to apply for these posts are mentioned below. Interested and eligible aspirants can f...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "14-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-07-29T23:45:02.847272",
      "links": []
    },
    {
      "id": "9b6a9780246bba115e97aedfa1e05e91",
      "title": "AIIMS Bhubaneswar Recruitment 2025 - Walk-in-Interview for 02 Senior Resident and Other Posts",
      "url": "https://allgovernmentjobs.in/aiims-bhubaneswar-recruitment-2025-walk-in-interview-for-02-senior-resident-and-other-posts/33739",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences (AIIMS) Bhubaneswar has published the official notification for 2025. To fill up the vacancies for 02 Junior Administrative Officers and Senior Resident Jobs. Those candidates who have qualified in the MD/ MS, Any Degree can grab this chance and apply for these posts. Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the AIIMS Bhubaneswar Recruitment 2025 . Interested and eligib...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "04-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-29T23:45:02.847321",
      "links": []
    },
    {
      "id": "176da66cde9fa7cf851fe651b89c33e6",
      "title": "NIT Calicut Recruitment 2025 - Apply Online for 15 Apprentice Trainee Posts",
      "url": "https://allgovernmentjobs.in/nit-calicut-recruitment-2025-apply-online-for-15-apprentice-trainee-posts/33738",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technology (NIT) Calicut has announced the official notification for 2025. To fill up the 15 Apprentice Positions. Those candidates who have qualified in Any Degree or diploma. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the NIT Calicut Recruitment 2025 . Interested and eligible candidates can apply online through the website on or before the last date of application. For more details, v...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "25-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-07-29T23:45:02.847341",
      "links": []
    },
    {
      "id": "82fb5a858a6522ceb4cac21c5234875b",
      "title": "UPPSC Recruitment 2025 - Apply Online for 7466 Assistant Teacher Post",
      "url": "https://allgovernmentjobs.in/uppsc-recruitment-2025-apply-online-for-7466-assistant-teacher-post/33736",
      "source": "allgovernmentjobs.in",
      "description": "The Uttar Pradesh Public Service Commission (UPPSC) has announced the official notification for 2025. To fill up the vacancies for 7466 Assistant Teacher Jobs. Those candidates who have qualified in the B.E/ B.Tech, B.Ed, MCA, or Any Degree can grab this chance and apply for the UPPSC Recruitment 2025 . Hee we mentioned the age limit, selection process, salary structure, education details, application fee, and how to apply for these Posts. Interested and eligible candidates can apply online t...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "28-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-07-29T23:45:02.847381",
      "links": []
    },
    {
      "id": "bd7c21aeb8cae793856f294e31e43e2f",
      "title": "RVNL Recruitment 2025 - Apply Offline for 29 Manager and Other Posts",
      "url": "https://allgovernmentjobs.in/rvnl-recruitment-2025-apply-offline-for-29-manager-and-other-posts/33734",
      "source": "allgovernmentjobs.in",
      "description": "The Rail Vikas Nigam Limited (RVNL) has officially released the notification to fill the vacancies of 29 Manager, Senior Deputy General Manager, Deputy Manager, and Assistant Manager Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, Diploma in Electrical, Electronics Engineering can apply for the RVNL Recruitment 2025 . The interested applicants can apply in offline...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "27-08-2025",
        "found_date": "28-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-29T23:45:02.847417",
      "links": []
    },
    {
      "id": "827209098fe2b4984a097926b9086367",
      "title": "NHAI Recruitment 2025 - Apply Online for 15 General Manager Posts",
      "url": "https://allgovernmentjobs.in/nhai-recruitment-2025-apply-online-for-15-general-manager-posts/33733",
      "source": "allgovernmentjobs.in",
      "description": "The National Highways Authority of India (NHAI) has announced the official notification for 2025. To fill up the 15 vacancies for General Manager Jobs. Those candidates who have qualified in the B.E/ B.Tech in Civil Engineering can grab this chance and apply for the NHAI Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply online through the webs...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "29-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-07-29T23:45:02.847435",
      "links": []
    },
    {
      "id": "8d116a193686928b3100e15a0ebebab8",
      "title": "RPCAU",
      "url": "https://allgovernmentjobs.in/rpcau-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Rajendra Prasad Central Agricultural University (RPCAU) has officially released the notification to fill the vacanci ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2025-07-29T23:45:02.847459",
      "links": []
    },
    {
      "id": "afa2b2b0c97e3bbf1404ad5493e443ef",
      "title": "AIIMS Bhubaneswar",
      "url": "https://allgovernmentjobs.in/aiims-bhubaneswar-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences (AIIMS) Bhubaneswar has published the official notification for 2025. To fill up .... The All India Institute of Medical Sciences (AIIMS), Bhubaneswar has released the official Notification for 2025. To fil ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-07-29T23:45:02.847484",
      "links": []
    },
    {
      "id": "21a9160ba8c847080e3d3930c2e1bc95",
      "title": "NIT Calicut",
      "url": "https://allgovernmentjobs.in/nit-calicut-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technology (NIT) Calicut has announced the official notification for 2025. To fill up the 15 A .... The National Institute of Technology Calicut (NIT Calicut) has officially released the notification to fill up the vacan .... The National Institute of Technology Calicut (NIT Calicut) has officially released the notification to fill up the 01 Pr .... The National Institute of Technology (NIT) Calicut has officially released the notification for the Project Assistant. ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2025-07-29T23:45:02.847504",
      "links": []
    },
    {
      "id": "020a63a046010dd609db47bf71d839e2",
      "title": "UPPSC",
      "url": "https://allgovernmentjobs.in/uppsc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Uttar Pradesh Public Service Commission (UPPSC) has announced the official notification for 2025. To fill up the vac .... The Uttar Pradesh State Bridge Corporation Limited (UPSBCL) has officially released the notification for the 57 Assistan .... Uttar Pradesh Public Service Commission (UPPSC) has officially released the notification for 03 Staff Nurse Posts. Inter .... Uttar Pradesh Public Service Commission (UPPSC) has published the latest job notification for the 36 Lecturer and Other...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-29T23:45:02.847523",
      "links": []
    },
    {
      "id": "b4fb5530ab8677c9729c90df458a7f0c",
      "title": "UPSC EPFO Online Form 2025 for 230 Post",
      "url": "https://www.rojgarresult.com/upsc-epfo-2025/",
      "source": "www.rojgarresult.com",
      "description": "UPSC EPFO EO / AO / APFC Recruitment 2025: Apply Online for 230 Post Post Date: 29-07-2025 Short Description: UPSC EPFO Recruitment 2025 Apply Online Form : UPSC EPFO Online Form 2025, Notification has been released on the website @https://upsc.gov.in/ & Application Form now started on 29 July 2025 to 18 August 2025 Union Public Service Commission Jobs 2025. Get the direct link to download notification link available on UPSC EPFO Vacancy 2025 Official Website and More Other Details Age Limit ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "29-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-29T23:45:23.053171",
      "links": [
        "https://upsc.gov.in/"
      ]
    },
    {
      "id": "ab31a63f4bce4f9c3edabb321f0aa380",
      "title": "BSF Constable Tradesmen Recruitment 2025 Out !Apply Online for 3588 Posts",
      "url": "https://www.jobriya.in/bsf-constable-tradesman-recruitment-2025-pdf-notification/",
      "source": "www.jobriya.com",
      "description": "BSF Constable Tradesmen Recruitment 2025 Notification for 3588 Posts of Constable How to Apply 2025 BSF Constable Tradesman Vacancy 2025 BSF Tradesman BSF Constable Tradesman Recruitment 2025 Check Application Form, Eligibility, Selection Process, Age Limit, Salary & Other Details From Below; BSF Tradesman Recruitment 2025 Latest Updates 25.07.2025 : BSF Has Started the Online Application Process for 3588 Posts of Constable (Tradesmen) Recruitment 2025. Candidates Apply Online & Check More De...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-29T23:45:34.347899",
      "links": [
        "https://rectt.bsf.gov.in",
        "http://rectt.bsf.gov.in"
      ]
    },
    {
      "id": "2e18e5e2e9cc2300035a545b871a606b",
      "title": "PSSSB Jail Warder Recruitment 2025 (500 Posts) Matron Notification Apply Online",
      "url": "https://www.jobriya.in/psssb-jail-warder-recruitment-2025-500-posts-notification-apply-online/",
      "source": "www.jobriya.com",
      "description": "Punjab Police Jail Warder Recruitment 2025 PSSSB recently released notification for Jail Warder Male & Matron for 500 posts Punjab Police Recruitment 2025 for Jail Warder Posts candidates with 12th class can apply online Punjab Jail Warder Vacancy 2025 Online application Punjab SSSB Jail Warder Marton Recruitment 2025 Apply from 30 July 2025 PSSSB Jail Warder Recruitment 2025 Advt No. 07 of 2025 Latest Updated 29.07.2025: Punjab SSSB Has started the Online Application Process for 500 Jail War...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "01-01-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-29T23:45:34.347926",
      "links": [
        "https://sssb.punjab.gov.in",
        "https://www.jobriya.in/punjab-police-jail-warder-syllabus-2021/",
        "https://sssb.punjab.gov.in/"
      ]
    },
    {
      "id": "3f2e6b3b91d06c7d1a1a3a2a823c0e8a",
      "title": "DSWO Recruitment 2025 - Apply Offline for 04 Gender Specialist and It Assistant Posts",
      "url": "https://allgovernmentjobs.in/dswo-recruitment-2025-apply-offline-for-04-gender-specialist-and-it-assistant-posts/33774",
      "source": "allgovernmentjobs.in",
      "description": "The District Social Welfare Office (DSWO) has announced the official notification for 2025. To fill up the vacancies for 04 Gender Specialists and IT Assistant Jobs. Those candidates who have qualified in Any Degree, post-graduation, can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the DSWO Recruitment 2025 . Interested and eligible candidates can apply n or before the l...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "26-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-30T23:45:46.208934",
      "links": []
    },
    {
      "id": "125da8b82de6e027a218085ef6a0ffc3",
      "title": "NIPGR Recruitment 2025 - Apply for Senior Research Fellow Post",
      "url": "https://allgovernmentjobs.in/nipgr-recruitment-2025-apply-for-senior-research-fellow-post/33766",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Plant Genome Research (NIPGR) has announced the official notification for 2025. To fill up the vacancies for Senior Research Fellow Jobs. Those candidates who have qualified in the M.E/ M.Tech, M.Sc, and Post Graduation can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the NIGPR Recruitment 2025 . Interested and eligible candidates can fill out t...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "28-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-30T23:45:46.208987",
      "links": []
    },
    {
      "id": "2a900210015c7096243c787bfacda85d",
      "title": "TMC Recruitment 2025 - Walk-in-Interview for Project Technical Post",
      "url": "https://allgovernmentjobs.in/tmc-recruitment-2025-walk-in-interview-for-project-technical-post/33772",
      "source": "allgovernmentjobs.in",
      "description": "The Tata Memorial Centre (TMC) has announced the official notification for 2025. To fill up the vacancies for Project Technical Jobs. Those candidates who have qualified in the 12th, DMLT can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the TMC Recruitment 2025 . Interested and eligible aspirants can attend the walk-in interview at the given venue. For more details, visi...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "11-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-07-30T23:45:46.209007",
      "links": []
    },
    {
      "id": "b1086d441c4615772bbf7f62cedf034a",
      "title": "CSL Recruitment 2025 - Apply Offline for 20 Operator Posts",
      "url": "https://allgovernmentjobs.in/csl-recruitment-2025-apply-offline-for-20-operator-posts/33770",
      "source": "allgovernmentjobs.in",
      "description": "Cochin Shipyard Limited (CSL) has announced the official notification for 2025. To fill up the vacancies for the 20 Operator Positions. Those candidates who have qualified in the 8th, 10th Pass can grab this chance and apply for the CSL Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply on or before the last date of application. For more detail...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "29-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-30T23:45:46.209049",
      "links": []
    },
    {
      "id": "aae5e35c10e5be29b19e41af3556783c",
      "title": "BEML Recruitment 2025 - Apply Online for 07 Manager and Other Posts",
      "url": "https://allgovernmentjobs.in/beml-recruitment-2025-apply-online-for-07-manager-and-other-posts/33768",
      "source": "allgovernmentjobs.in",
      "description": "The Bharat Earth Movers Limited (BEML) has introduced the latest Job notification for 2025. Allotted 07 Vacancies for Deputy General Manager, Manager, and Assistant Manager Jobs. Those candidates who have qualified in the B.E/ B.Tech, M.E/ M.Tech, Post Graduation, MBBS, DNB, MD/ MS can grab this chance and apply for these posts. Here we include the age limit, selection Process, salary structure, education details, application fee, and how to apply for the BEML Recruitment 2025 . Interested an...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "21-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-30T23:45:46.209086",
      "links": []
    },
    {
      "id": "818522cb4bc2c252d5b6a9f389355e7c",
      "title": "Mumbai Port Trust",
      "url": "https://allgovernmentjobs.in/mumbai-port-trust-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Mumbai Port Trust has officially released the notification to fill the vacancies of 04 Medical Officer Posts. Intere .... Mumbai Port Trust (MPT)has recently declared the Notification for 2025. Allotted 20 Vacancies for the Junior Professiona ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-30T23:45:46.209150",
      "links": []
    },
    {
      "id": "5a97b6ed38f56b92a79447b514d4f815",
      "title": "NIPGR",
      "url": "https://allgovernmentjobs.in/nipgr-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Plant Genome Research (NIPGR) has announced the official notification for 2025. To fill up the .... The National Institute of Plant Genomics Research (NIPGR) has declared the official notification for 2025. Allotted vaca .... The National Institute of Plant Genome Research (NIPGR) has officially released the 01 Project Associate I Post. Interes ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-30T23:45:46.209172",
      "links": []
    },
    {
      "id": "2ca72338a158ca88c6e6689e477ce83e",
      "title": "NIT Trichy",
      "url": "https://allgovernmentjobs.in/nit-trichy-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technology (NIT) Trichy has announced the official notification for 2025. To fill up 02 S .... The National Institute of Technology (NIT) Trichy has announced the official notification for 2025. To fill up the vacan .... The National Institute of Technology Tiruchirappalli (NIT Trichy) has officially released the notification for 01 Consul .... The National Institute of Technology (NIT) Trichy has officially released the Notification for 2025. To fill up the vaca ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-07-30T23:45:46.209198",
      "links": []
    },
    {
      "id": "31c4c5cf61d57e999b740fc282130f00",
      "title": "HPSC ADO Recruitment 2025 Out (785 Posts) Haryana PSC Apply Online",
      "url": "https://www.jobriya.in/hpsc-ado-recruitment-2025-notification-apply-online-for-785-posts/",
      "source": "www.jobriya.com",
      "description": "HPSC ADO Recruitment 2025 Haryana PSC has released the Detailed Notification for 785 Posts of Agricultural Development Officer Vacancy Candidates Can Check HPSC Agricultural Development Officer Job Vacancy Details & Haryana PSC कृषि विकास अधिकारी Bharti Apply Online HPSC ADO Recruitment 2025 Advertisement No. 17/2025 Latest Updated 25.8.2022 – HPSC Has Start Online Application for Advt. No. 17 of 2025 – Agricultural Development Officer (Administrative Cadre) (Group-B) in Agriculture and Farme...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Word",
        "Hindi"
      ],
      "scraped_at": "2025-07-30T23:46:25.023614",
      "links": [
        "http://hpsc.gov.in/en-us/"
      ]
    },
    {
      "id": "6dc9bbb51ac23798b85aa5f866305c14",
      "title": "RSMSSB Agriculture Supervisor Recruitment 2025 (1100 Posts) कृषि पर्यवेक्षक",
      "url": "https://www.jobriya.in/rajasthan-rsmssb-agriculture-supervisor-recruitment-2025/",
      "source": "www.jobriya.com",
      "description": "RSMSSB Agriculture Supervisor Recruitment 2025 Rajasthan Staff Selection Board Vacancy 2025 for 1100 Posts of कृषि पर्यवेक्षक RSMSSB Krshi Paryavekshak Exam 2025 Rajasthan Agriculture Supervisor RSMSSB Agriculture Supervisor Apply Online RSMSSB कृषि पर्यवेक्षक (Agricultural supervisor) Recruitment 2025 Check Details Of Vacancies RSSB Agriculture Supervisor Recruitment 2025 Latest Updated On 17.07.2025- Rajasthan Staff Selection Board Has Released Online Application for Agriculture Supervisor…...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "17-7-1996"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-30T23:46:25.025924",
      "links": [
        "https://www.rsmssb.rajasthan.gov.in/Static/files/Adv_Agri_Sup_2021_05022021.pdf",
        "https://rssb.rajasthan.gov.in"
      ]
    },
    {
      "id": "42d1bfee452bc598de242c539e18aa29",
      "title": "RSMSSB Forest Guard Recruitment 2025 RSSB Forester (785 Vacancy) Apply Online",
      "url": "https://www.jobriya.in/rsmssb-forest-guard-recruitment-2025-rssb-forester-apply-online/",
      "source": "www.jobriya.com",
      "description": "Rajasthan Forest Guard Recruitment 2025 RSMSSB Forest Guard Recruitment 2022 RSMSSB Rajasthan वन रक्षक Recruitment 2025 for 785 Posts of Forester & Forest Guard RSMSSB Forester Apply Online 2025 How to Apply for RSMSSB Forester & Forest Guard Recruitment Notification 2025 RSMSSB वन रक्षक वनपाल Online Application Form Check Selection Process Eligibility RSSB Forest Guard Recruitment 2025 Latest Updated On 17-July-2025 : Rajasthan Staff Selection Board Released Short Notification for Forest Gua...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "1-1-2021"
      },
      "category": "Banking",
      "skills": [
        "Word",
        "Cloud",
        "Hindi"
      ],
      "scraped_at": "2025-07-30T23:46:25.025943",
      "links": [
        "https://wordpress-206774-624424.cloudwaysapps.com/rajasthan-forest-guard-syllabus-2015-vanrakshak-exam/",
        "https://rssb.rajasthan.gov.in",
        "https://rsmssb.rajasthan.gov.in/Static/files/Full_Adv_of_Forester&ForestGaurd2020.pdf"
      ]
    },
    {
      "id": "7562590bc68ce6605b8c32787bb560ff",
      "title": "RSSB Recruitment 2025 - Apply Online for 1050 Support Engineer and Other Posts",
      "url": "https://allgovernmentjobs.in/rssb-recruitment-2025-apply-online-for-1050-support-engineer-and-other-posts/33804",
      "source": "allgovernmentjobs.in",
      "description": "The Rajasthan Staff Selection Board (RSSB) has officially released the notification to fill the vacancies of 1050 Support Engineers and Support Chemist Jobs. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, Diploma in Civil, Mechanical, Electrical Engineering, MCA, M.Sc, B.Sc can apply for the RSSB Recruitment 2025 . The interested applicants can apply in online mode. Her...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "25-08-2025",
        "found_date": "31-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-31T23:44:41.631908",
      "links": []
    },
    {
      "id": "a0641964fd39c9b42e39d92e9ed5544e",
      "title": "GRSE Recruitment 2025 - Apply Online for Specialist Posts",
      "url": "https://allgovernmentjobs.in/grse-recruitment-2025-apply-online-for-specialist-posts/33803",
      "source": "allgovernmentjobs.in",
      "description": "Garden Reach Shipbuilders and Engineers Limited (GRSE) has declared the official notification to fill up the vacancies for Specialist Posts. Those candidates who have qualified in the B.E/ B.Tech in Civil Engineering can grab this chance and apply for the GRSE Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply online through the website on or b...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "30-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-31T23:44:41.631934",
      "links": []
    },
    {
      "id": "ffeae8913838b1dcd7254651e7577633",
      "title": "BOB Recruitment 2025 - Apply Offline for FLC Counsellor Posts",
      "url": "https://allgovernmentjobs.in/bob-recruitment-2025-apply-offline-for-flc-counsellor-posts/33802",
      "source": "allgovernmentjobs.in",
      "description": "Bank of Baroda (BOB) has announced he official notification for 2025. Allotted vacancies for the FLC Counsellor Jobs. Those candidates who have qualified in Any Degree can apply for the BOB Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply on or before the last date of application. For more details, visit the official website. If you are looki...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "30-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-31T23:44:41.631963",
      "links": []
    },
    {
      "id": "e9350f1b7a3f9a61bbd53b1ef393244e",
      "title": "NABARD Recruitment 2025 - Apply for Bank's Medical Officer Post",
      "url": "https://allgovernmentjobs.in/nabard-recruitment-2025-apply-for-bank-s-medical-officer-post/33799",
      "source": "allgovernmentjobs.in",
      "description": "The National Bank for Agriculture and Rural Development( NABARD) has officially released the Notification for 2025. To fill up the Vacancies for the Bank's Medical Officer Jobs. Those candidates who have qualified in the MBBS can grab this chance and apply for the NABARD Recruitment 2025 . Here we include the age limit, selection process, salary structure, educational details, application fee, and how to apply for these posts is mentioned below. Interested and eligible candidates can apply on...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "31-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-31T23:44:41.632021",
      "links": []
    },
    {
      "id": "bf0f541c14a085c76ba4757e6ac0c4a4",
      "title": "Punjab and Sind Bank Recruitment 2025 - Apply Offline for Bank Medical Consultant Post",
      "url": "https://allgovernmentjobs.in/punjab-and-sind-bank-recruitment-2025-apply-offline-for-bank-medical-consultant-post/33798",
      "source": "allgovernmentjobs.in",
      "description": "Punjab and Sind Bank has announced the official notification for 2025. to fill up the vacancies for the Bank's Medical Consultant Jobs. Those candidates who have qualified in the MBBS, BHMS, and MD/ MS can grab this chance and apply for the Punjab and Sind Bank Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can fill out the application form on or bef...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "23-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-31T23:44:41.632039",
      "links": []
    },
    {
      "id": "236316fab9f1a35bb7af48d6ca2da1be",
      "title": "CPT Recruitment 2025 - Apply Online for 10 Apprentice Posts",
      "url": "https://allgovernmentjobs.in/cpt-recruitment-2025-apply-online-for-10-apprentice-posts/33795",
      "source": "allgovernmentjobs.in",
      "description": "Cochin Port Trust (CPT) has launched the official notification for 2025 for the position of Apprentice jobs for the 10 vacancies. Cochin Port Trust Recruitment 2025 is looking for candidates who have qualified in the B.Com, BBA, and B.Sc can apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply. Interested and eligible candidates can apply online through the website on or before the last date of applicat...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "30-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-07-31T23:44:41.632100",
      "links": []
    },
    {
      "id": "07ccbb4efb82909cc29027b4175962cc",
      "title": "RSMSSB",
      "url": "https://allgovernmentjobs.in/rsmssb-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Rajasthan Staff Selection Board (RSSB) has officially released the notification to fill the vacancies of 1050 Suppor .... The Rajasthan Staff Selection Board (RSSB) has announced the official notification for 2025. To fill up the vacancies fo .... The Rajasthan Staff Selection Board (RSSB) has announced the official notification to fill up the vacancies of 54  ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-31T23:44:41.632121",
      "links": []
    },
    {
      "id": "8cc161575403f8f25413ab402be67e1d",
      "title": "NABARD",
      "url": "https://allgovernmentjobs.in/nabard-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Bank for Agriculture and Rural Development( NABARD) has officially released the Notification for 2025. To f .... The National Bank for Agriculture and Rural Development( NABARD) has officially released the Notification for 2025. To f .... Are you looking for job opprtunities in NABARD, here is a golden opportunity for you all to apply for the position of Sp ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-31T23:44:41.632147",
      "links": []
    },
    {
      "id": "339d7c88ae6728574c02222aca0c4225",
      "title": "CMD Kerala",
      "url": "https://allgovernmentjobs.in/cmd-kerala-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Center of Management Development (CMD Kerala) has officially released the notification to fill the vacancies of 17&n .... The Centre for Management Development (CMD) Kerala has declared the official notification for 2025. To fill up the vacan .... The Centre for Management Development (CMD) Kerala has released the official Notification for 2025. To fill up the Vacan ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "General",
      "skills": [],
      "scraped_at": "2025-07-31T23:44:41.632169",
      "links": []
    },
    {
      "id": "ac8056695ac9c7f71e3d48ddbcd7bcc2",
      "title": "Bank Jobs",
      "url": "https://allgovernmentjobs.in/bank-jobs-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Bank of Baroda (BOB) has announced he official notification for 2025. Allotted vacancies for the FLC Counsellor Job .... Punjab and Sind Bank has announced the official notification for 2025. to fill up the vacancies for the Bank's Medical C .... The Central Bank of India has officially released the notification to fill the vacancies of 04 BC Supervisor Posts. Inte .... The Indian Bank has officially released the notification to fill the vacancies of 01 Authorized Doctor Posts. Interested ......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-07-31T23:44:41.632186",
      "links": []
    },
    {
      "id": "e4bdf6f05c5981043b68bd63613f7899",
      "title": "HSSC Group D Recruitment 2025 Apply Online Haryana CET Group D Notification",
      "url": "https://www.jobriya.in/hssc-group-d-recruitment-2025-cet-group-d-apply-online/",
      "source": "www.jobriya.com",
      "description": "Haryana SSC Group D Recruitment 2025 will be Release soon @ www.hssc.gov.in Apply Online Haryana Staff Selection Commission (HSSC) Group D posts in various departments HSSC Group D Recruitment 205 Notification has been released Haryana SSC Peon, Beldar, Helper, Mali, Animal Attendant, Cook, mate, 2025 Qualifications for HSSC CET Group D 2025 Last Date to Apply for HSSC Group D 2025 HSSC Group D Recruitment 2025 Latest Updated 31.07.2025 – HSSC Will Start CET Group D Recruitment 2025 In Upcomi...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Hindi"
      ],
      "scraped_at": "2025-07-31T23:45:18.922178",
      "links": [
        "https://www.hssc.gov.in"
      ]
    },
    {
      "id": "abfc62842a7392fb935bfee0220a02a4",
      "title": "TMC Recruitment 2025 - Walk-in-Interview for 04 Senior Resident and Other Posts",
      "url": "https://allgovernmentjobs.in/tmc-recruitment-2025-walk-in-interview-for-04-senior-resident-and-other-posts/33810",
      "source": "allgovernmentjobs.in",
      "description": "The Tata Memorial Centre (TMC) has recently released the official notification for 2025. To fill up the vacancies for 04 Senior Resident and Fellowship Jobs. Those candidates who have completed their MD, DNB can apply for the TMC Recruitment 2025 .  Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts are mentioned below. Interested and eligible candidates can attend the interview at the given venue. For more ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "06-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-01T23:44:41.679159",
      "links": []
    },
    {
      "id": "84d3d946ea95fc6cb5d65dc831901582",
      "title": "NITTTR Bhopal Recruitment 2025 - Apply Online for Technical Resource Post",
      "url": "https://allgovernmentjobs.in/nitttr-bhopal-recruitment-2025-apply-online-for-technical-resource-post/33829",
      "source": "allgovernmentjobs.in",
      "description": "National Institute of Technical Teachers Training and Research, Bhopal (NITTTR) has announced the official notification for 2025. To fill up the vacancies for Technical Resource Jobs. Those candidates who have qualified in the B.E/ B.Tech, MCA, and M.Sc can grab this chance and apply for the NITTTR Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, and application fee. and how to apply for the posts is mentioned below. The application pro...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "28-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-01T23:44:41.679188",
      "links": []
    },
    {
      "id": "87d6f030769f8b287cc59c4840032b46",
      "title": "AIIMS Kalyani Recruitment 2025 - Apply for Junior Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/aiims-kalyani-recruitment-2025-apply-for-junior-research-fellow-posts/33835",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Science Kalyani (AIIMS Kalyani) has declared the official notification for 2025. To fill up the vacancies for Junior Research Fellow Jobs. Those candidates who have qualified in the M.Sc. can grab this chance and apply for the AIIMS Kalyani Recruitment 2025 . Here, we mentioned the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible aspirants can send the application form t...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "26-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-01T23:44:41.679214",
      "links": []
    },
    {
      "id": "48fe735484f68b01f5504dd120067cd9",
      "title": "Air India Limited Recruitment 2025 - Apply Offline for Officer Finance and Accounts Post",
      "url": "https://allgovernmentjobs.in/air-india-limited-recruitment-2025-apply-offline-for-officer-finance-and-accounts-post/33833",
      "source": "allgovernmentjobs.in",
      "description": "Air Insia Limited has declared the official notification for 2025. To fill up the vacancies for Officer Finance and Accounts Jobs. Those candidates who have qualified for the CA can utilize this chance and apply for these Posts. Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the Air India Limited Recruitment 2025 . Interested and eligible candidates can apply on or before the last date of application. Fr more detai...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "30-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Analyst"
      ],
      "scraped_at": "2025-08-01T23:44:41.679253",
      "links": []
    },
    {
      "id": "323552c2aece8f7a18f0d409b6df3e3d",
      "title": "TMC Recruitment 2025 - Apply Offline for Consultant Post",
      "url": "https://allgovernmentjobs.in/tmc-recruitment-2025-apply-offline-for-consultant-post/33831",
      "source": "allgovernmentjobs.in",
      "description": "The Tata Memorial Centre (TMC) has announced the official notification for 2025. Allotted vacancies for Consultant Jobs. Those candidates who have qualified in MD, DNB can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the TMC Recruitment 2025. Interested and eligible candidates can apply on or before the last date of application. For more details, visit the official websi...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "31-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-01T23:44:41.679291",
      "links": []
    },
    {
      "id": "332566ea898696b0f30e36d020a8d486",
      "title": "RITES Recruitment 2025 - Apply Online for 58 Resident Engineer and Other Posts",
      "url": "https://allgovernmentjobs.in/rites-recruitment-2025-apply-online-for-58-resident-engineer-and-other-posts/33830",
      "source": "allgovernmentjobs.in",
      "description": "The Rail India Technical and Economic Services (RITES) has officially released the notification to fill the vacancies of 58 Senior Technical Assistant, Resident Engineer, and Technical Assistant Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Diploma in Mechanical, Civil, and Electrical Engineering can apply for the RITES Recruitment 2025 . The interested applicants can apply i...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "23-08-2025",
        "found_date": "01-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-01T23:44:41.679309",
      "links": []
    },
    {
      "id": "31be7fb31325f8b68cda4101a32e644d",
      "title": "ITPO Recruitment 2025 - Apply Online for 31 Deputy Manager Posts",
      "url": "https://allgovernmentjobs.in/itpo-recruitment-2025-apply-online-for-31-deputy-manager-posts/33828",
      "source": "allgovernmentjobs.in",
      "description": "The India Trade Promotion Organisation (ITPO) has officially released the notification to fill the vacancies of 31 Deputy Manager Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Civil Engineering, Diploma, Any Degree, LLB, MBA, can apply for ITPO Recruitment 2025 . The interested applicants can apply in online mode. Here we have mentioned the education details, ...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "29-08-2025",
        "found_date": "31-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-01T23:44:41.679326",
      "links": []
    },
    {
      "id": "b0c0daa93a38176e2e9a2513e4a08fc4",
      "title": "NRRI Recruitment 2025 - Walk-in-Interview for 03 Laboratory Assistant and Other Posts",
      "url": "https://allgovernmentjobs.in/nrri-recruitment-2025-walk-in-interview-for-03-laboratory-assistant-and-other-posts/33827",
      "source": "allgovernmentjobs.in",
      "description": "The National Rice Research Institute (NRRI) has released the latest job notification for 2025. To fill up the vacancies for 03 Research Associates, Project Associates, and  Laboratory Assistants. Those candidates who have qualified in the M.Tech, M.Sc, Post Graduation, B.Sc, and Ph.D can grab this chance and apply for the NRRI Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, and application fee, and how to apply for these posts is menti...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-01T23:44:41.679345",
      "links": []
    },
    {
      "id": "c41cd0658ea9fa5b985b36c9caa92da0",
      "title": "NITTTR",
      "url": "https://allgovernmentjobs.in/nitttr-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "National Institute of Technical Teachers Training and Research, Bhopal (NITTTR) has announced the official notification .... The National Institute of Technical Teachers Training and Research (NITTTR) Bhopal has recently released the Notificatio ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Teaching",
      "skills": [],
      "scraped_at": "2025-08-01T23:44:41.679368",
      "links": []
    },
    {
      "id": "169d5b434aa76b09e9409f8be8600f52",
      "title": "AIIMS",
      "url": "https://allgovernmentjobs.in/aiims-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Science Kalyani (AIIMS Kalyani) has declared the official notification for 2025. To .... All India Institute of Medical Sciences (AIIMS) Delhi has announced the official notification for 2025. To fill up the v .... All India Institute of Medical Sciences (AIIMS) Bhubaneswar has published the official notification for 2025. To fill up .... All India Institute of Medical Sciences (AIIMS) Delhi has announced the official notification for 2025. To fill up the v .......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-08-01T23:44:41.679388",
      "links": []
    },
    {
      "id": "a6c8430a8f78fea3c328892fb29c5350",
      "title": "MPPSC",
      "url": "https://allgovernmentjobs.in/mppsc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Madhya Pradesh Employees Selection Board (MPESB) has officially released the notification to fill the vacancies of 4 .... The Madhya Pradesh Building Development Corporation Limited (MPBDC) has officially released the notification to fill the .... The Madhya Pradesh Employee Selection Board (MPESB) has officially released the notification to fill the vacancies of 75 .... Madhya Pradesh Power Transmission Company Limited (MPTRANSCO) has officially released the Notification for 2025. To fil...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-01T23:44:41.679406",
      "links": []
    },
    {
      "id": "9330361edd541cb01ad8e8028ab14bd3",
      "title": "Air India",
      "url": "https://allgovernmentjobs.in/air-india-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Air Insia Limited has declared the official notification for 2025. To fill up the vacancies for Officer Finance and .... Air India Limited has officially released the notification to fill the vacancies of 01 Manager Posts. Interested and eli .... Air India Limited (Air India) has officially released the notification to fill the vacancies of 01 Senior Associate - Qu ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-01T23:44:41.679429",
      "links": []
    },
    {
      "id": "fbe8a2bf1996d3ab2b43bd4eafe20ce2",
      "title": "RITES",
      "url": "https://allgovernmentjobs.in/rites-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Rail India Technical and Economic Services (RITES) has officially released the notification to fill the vacancies of .... The Rail India Technical and Economic Services (RITES) has announced the official notification for 2025. To fill up the .... The Rail India Technical and Economic Service (RITES) has declared the official notification for 2025. To fill up the va .... The Rites Limited has officially released the Notification for 2025. To fill up the Vacancies for the 04 Individual .......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2025-08-01T23:44:41.679454",
      "links": []
    },
    {
      "id": "30b75895b4c9b316c1998897e673911a",
      "title": "RVUNL Recruitment 2025 (2163 Posts) Technician III Apply Online",
      "url": "https://www.jobriya.in/rvunl-recruitment-2025-notification-jvvnl-2163-posts/",
      "source": "www.jobriya.com",
      "description": "RVUNL Recruitment 2025 RVUNL has released Common Recruitment of Technician-III (ITI)/ Operator-III (ITI Plant Attendant-IlI (ITI) in State Power Companies of Rajasthan RVUNL Plant Attendant-III (ITI) Recruitment 2025 Check eligibility Criteria, Apply Online & Download Notification RVUNL Vacancy 2025 RVUNL Technician Recruitment 2025 Latest Updated 01.08.2025 : RVNUL has re-start online application for Recruitment for the Posts Technician-III (ITI)/ Operator-III (ITI)/ Plant Attendant-III (ITI...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-01T23:45:21.561234",
      "links": [
        "https://energy.rajasthan.gov.in"
      ]
    },
    {
      "id": "86b7eb960386bd86b0543755279ed631",
      "title": "CCRAS MTS Recruitment 2025 Steno LDC UDC (389 Posts) Online Application",
      "url": "https://www.jobriya.in/ccras-mts-recruitment-2025-steno-ldc-udc-389-posts-online-application/",
      "source": "www.jobriya.com",
      "description": "CCRAS MTS Recruitment 2025 How to Apply for Central Council for Research in Ayurvedic Sciences Vacancy 2025 CCRAS MTS Notification 2025 for 389 LDC Stenographer Posts CCRAS Vacancy 2025 Apply Online 2025 Check Eligibility Criteria Apply Online Last Date CCRAS MTS Recruitment 2025 Latest Update 31.07.2025 : CCRAS has released Recruitment Notification for Multi Tasking Staff (LDC UDC) Vacancies…… Check More Details from Below….. Central Council for Research in Ayurvedic Sciences (CCRAS) Applica...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Hindi",
        "English"
      ],
      "scraped_at": "2025-08-01T23:45:21.563375",
      "links": [
        "https://ccras.nic.in"
      ]
    },
    {
      "id": "21a37eac5e0f7ba5b97d6bba46b30f46",
      "title": "PGIMER Recruitment 2025 - Apply Offline for Multitask Worker Post",
      "url": "https://allgovernmentjobs.in/pgimer-recruitment-2025-apply-offline-for-multitask-worker-post/33868",
      "source": "allgovernmentjobs.in",
      "description": "Post Graduate Institute of Medical Education and Research (PGIMER) has declared the latest job notification for 2025. To fill up the vacancies for the Multitask Worker Position. Those candidates who have qualified in the 10th Pass can grab this chance and apply for the PGIMER Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts is mentioned below. Interested and eligible candidates can fill ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "26-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-02T23:46:45.667532",
      "links": []
    },
    {
      "id": "fdca5d711b913995e951e52ff049275d",
      "title": "AIIMS Bathinda Recruitment 2025 - Walk-in-Interview for Clinical Research Coordinator Post",
      "url": "https://allgovernmentjobs.in/aiims-bathinda-recruitment-2025-walk-in-interview-for-clinical-research-coordinator-post/33865",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences (AIIMS) Bathinda has announced the official notification for 2025. To fill up the vacancies for Clinical Research Coordinator Jobs. Those candidates who have qualified in the Diploma, Post Graduation, B.E/ B.Tech., or Any Degree can grab this chance and apply for these posts. Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the AIIMS Bathinda Recruitment 2025 . Interested candi...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "29-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-02T23:46:45.667607",
      "links": []
    },
    {
      "id": "9a6591edf7719bcb7c2dcc6a8e4109e4",
      "title": "DSCI Recruitment 2025 - Walk-in-Interview for 39 Senior Resident Posts",
      "url": "https://allgovernmentjobs.in/dsci-recruitment-2025-walk-in-interview-for-39-senior-resident-posts/33864",
      "source": "allgovernmentjobs.in",
      "description": "Delhi State Cancer Institute (DSCI) has declared the latest job notification for 2025. To fill up the vacancies for 39 Senior Resident Posts. Those candidates who have qualified in the MBBS, MD/ MS, DNB, and Post-Graduation can grab this chance and apply for the DSCI Recruitment 2025 . Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can attend the interview at the give...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "07-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-02T23:46:45.667626",
      "links": []
    },
    {
      "id": "40bc5b084a4f3845be4af34ee03c7183",
      "title": "WRD Maharashtra Recruitment 2025 - Apply for Legal Officer Post",
      "url": "https://allgovernmentjobs.in/wrd-maharashtra-recruitment-2025-apply-for-legal-officer-post/33862",
      "source": "allgovernmentjobs.in",
      "description": "Maharashtra Water Resource Department (WRD) has announced the official notification for 2025. To fill up the vacancies for Legal Officer Jobs. Those candidates who have qualified in Any Degree, LLB, can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and hw to apply for the WRD Maharashtra  Recruitment 2025 . Interested and eligible candidates can apply on or before the last date of application...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "30-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-02T23:46:45.667666",
      "links": []
    },
    {
      "id": "1705aa72fcb23f3663b0682147152b93",
      "title": "Thanjavur RDM Recruitment 2025 - Apply Offline for 305 Village Assistant Posts",
      "url": "https://allgovernmentjobs.in/thanjavur-rdm-recruitment-2025-apply-offline-for-305-village-assistant-posts/33861",
      "source": "allgovernmentjobs.in",
      "description": "The Thanjavur Revenue and Disaster Management Department (Thanjavur RDM) has officially released the notification to fill the vacancies of 305 Village Assistant Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their 10th pass can apply for the Thanjavur RDM Recruitment 2025. The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, s...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "30-08-2025",
        "found_date": "01-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-02T23:46:45.667685",
      "links": []
    },
    {
      "id": "949ac19ee21c4b1f410ee916794cde08",
      "title": "Sainik School Tilaiya Recruitment 2025 - Apply Offline for 02 Lower Division Clerk and Ward Boy Posts",
      "url": "https://allgovernmentjobs.in/sainik-school-tilaiya-recruitment-2025-apply-offline-for-02-lower-division-clerk-and-ward-boy-posts/33860",
      "source": "allgovernmentjobs.in",
      "description": "The Sainik School Tilaiya has announced the official notification for 2025. To fill up the vacancies for Lower Division Clerk and Ward Boy Jobs. Those candidates who have qualified in the 10th Pass can grab this chance and apply for these posts. Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the Sainik School Tilaiya Recruitment 2025 . Interested and eligible candidates can apply on or before the last date of appli...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "01-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-02T23:46:45.667703",
      "links": []
    },
    {
      "id": "4e1948b8c387c773f12d6a21f19f8392",
      "title": "NTPC Recruitment 2025 - Apply Online for 25 Manager Posts",
      "url": "https://allgovernmentjobs.in/ntpc-recruitment-2025-apply-online-for-25-manager-posts/33859",
      "source": "allgovernmentjobs.in",
      "description": "The National Thermal Power Corporation Limited (NTPC) has officially released the notification to fill the vacancies of 25 General Manager, Additional General Manager, Senior Manager, and Manager Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Civil, Mechanical, and Electrical Engineering can apply for the NTPC Recruitment 2025. The interested applicants can app...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "21-08-2025",
        "found_date": "07-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-02T23:46:45.667721",
      "links": []
    },
    {
      "id": "ea6c3e62931d3d5b20697fddeab94337",
      "title": "PGIMER",
      "url": "https://allgovernmentjobs.in/pgimer-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Post Graduate Institute of Medical Education and Research (PGIMER) has declared the latest job notification for 2025. To .... The Post-Graduation of Medical Education and Research (PGIMER) has announced the official notification for 2025. To fill .... The Post Graduate Institute of Medical Education and Research (PGIMER) has announced the official notification for 2025. .... Post Graduate Institute of Medical Education and Research (PGIMER) Chandigarh has declared the official notification fo...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-02T23:46:45.667744",
      "links": []
    },
    {
      "id": "01d9cf5f866e9cd395bd5547f92360f6",
      "title": "Sainik School",
      "url": "https://allgovernmentjobs.in/sainik-school-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Sainik School Tilaiya has announced the official notification for 2025. To fill up the vacancies for Lower Divi .... Sainik School Balachadi has published the official notification for 2025. To fill up the vacancies for 07 TGT and L .... Sainik School Satara has announced the official notification for 2025. Allotted 02 TGT Positions. Those candidates who h .... Sainik School Punglwa has officially released the Notification for 2025. To fill up the Vacancies for Nursing Assistant .... The ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-02T23:46:45.667794",
      "links": []
    },
    {
      "id": "1c752d43ca85b7ebfb6e752fc1a6136e",
      "title": "CCRAS Group A B C Online Form 2025 for 389 Post",
      "url": "https://www.rojgarresult.com/ccras-group-a-b-c-2025/",
      "source": "www.rojgarresult.com",
      "description": "CCRAS Recruitment 2025: Apply for Various 389 Post Post Date: 01-08-2025 Short Description: CCRAS Group A B C Recruitment 2025 Apply Online Form : CCRAS Various Post Online Form 2025, Notification has been released on the website @https://ccras.nic.in/ & Application Form now started on 01 August 2025 to 31 August 2025. Central Council for Research in Ayurvedic Sciences Jobs 2025. Get the direct link to download notification link available on CCRAS Vacancy 2025 Official Website and More Other ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "01-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Typing",
        "English",
        "Mathematics",
        "Hindi"
      ],
      "scraped_at": "2025-08-02T23:47:12.086470",
      "links": [
        "https://ccras.nic.in/"
      ]
    },
    {
      "id": "e14d78ab607afa490dd6414c216a1c3b",
      "title": "Railway RRC ER Apprentice Online Form 2025 for 3115 Post",
      "url": "https://www.rojgarresult.com/railway-rrc-er-apprentice-2025/",
      "source": "www.rojgarresult.com",
      "description": "RRC Railway Eastern Railway Apprentice Recruitment 2025: Apply for 3115 Post Post Date: 31-07-2025 Short Description: Railway RRC ER Apprentice Recruitment 2025 Apply Online Form : Railway Recruitment Cell Railway RRC ER Apprentice Online Form 2025, Notification has been released on the website @https://er.indianrailways.gov.in/ & Application Form now started on 14 August 2025 to 13 September 2025 for Total 3115 Post Railway Recruitment Cell Jobs 2025. Get the direct link to download notifica...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "31-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-02T23:47:12.086492",
      "links": [
        "https://er.indianrailways.gov.in/"
      ]
    },
    {
      "id": "97f948abf7033273c205f5e0aff6b1b2",
      "title": "Latest Jobs",
      "url": "https://www.jobriya.in/category/latest-jobs/",
      "source": "www.jobriya.com",
      "description": "UP Police OTR Registration 2025 One Time Registration Online Form Madhu Chaudhary / August 2, 2025 UP Police OTR Registration 2025 UPSSSC OTR Online Registration 2025 How to Apply for Uttar Pradesh Police One Time Registration […] UP Police OTR Registration 2025 One Time Registration Online Form Read Post »  PSSSB Punjab Jail Warder Recruitment 2025 (500 Posts) Online Application Form Madhu Chaudhary / August 2, 2025 Punjab Police Jail Warder Recruitment 2025: PSSSB Has Released Official Recr...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-02T23:47:21.386705",
      "links": []
    },
    {
      "id": "a4caa3404623ad6ce67ce9e3898ea405",
      "title": "IB SA Executive 2025 Application Form 4987 Posts Notification",
      "url": "https://www.jobriya.in/ib-sa-executive-recruitment-2025/",
      "source": "www.jobriya.com",
      "description": "IB Security Assistant Recruitment 2025 OUT! Intelligence Bureau Has Announced Recruitment for 4987 Security Assistant (Executive) Posts. MHA IB Security Assitant Online Application Form 2025, Ministry of Home Affairs Security Assistant Vacancy 2025 Intelligence Bureau IB Security Assistant Notification Apply Online IB Security Assistant Recruitment 2025 Last Updated on 27.07.2025 Intelligence Bureau, Ministry of Home Affairs Has Released IB Secuity Assistant Recruitment 2025 for a Total of 49...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "15/1/76"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-03T23:45:33.987708",
      "links": [
        "https://mha.gov.in"
      ]
    },
    {
      "id": "8aba778f8c99adb0e8c224f6216a3210",
      "title": "TMC Recruitment 2025 - Walk-in-Interview for Medical Officer Post",
      "url": "https://allgovernmentjobs.in/tmc-recruitment-2025-walk-in-interview-for-medical-officer-post/33875",
      "source": "allgovernmentjobs.in",
      "description": "The Tata Memorial Centre (TMC) has declared the official notification for 2025. To fill up the vacancies for Medical Officer Jobs. Those candidates who have qualified in the MBBS, BDS, BAMS, BHMS, BUMS, Pharm.D can grab this chance and apply for the TMC Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these Posts. Interested and eligible candidates can attend the interview at the given venue. For mo...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "22-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-04T23:45:31.618141",
      "links": []
    },
    {
      "id": "0e2cfe7e56995259c0474d0f3dcb7ad1",
      "title": "NHM Gujarat Recruitment 2025 - Apply Online for 03 Pharmacist and Other Posts",
      "url": "https://allgovernmentjobs.in/nhm-gujarat-recruitment-2025-apply-online-for-03-pharmacist-and-other-posts/33873",
      "source": "allgovernmentjobs.in",
      "description": "The National Health Mission (NHM) Gujarat has announced the official notification for 2025. To fill up the vacancies for 03 Finance Assistant, Pharmacist, and Data Manager Jobs. Those candidates who have qualified in Any Degree, D.Pharma, Post post-graduation can grab this chance and apply for the NHM Gujarat Recruitment 2025 . Here we include the age limit, selection Process, salary structure, education details, application fee, and how to apply for these posts is mentioned below. For more d...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "02-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-04T23:45:31.618184",
      "links": []
    },
    {
      "id": "87dcd8cd5fbb76093b262f384b0b792a",
      "title": "NII Recruitment 2025 - Apply for Senior Research Fellow Post",
      "url": "https://allgovernmentjobs.in/nii-recruitment-2025-apply-for-senior-research-fellow-post/33871",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Immunology (NII) has announced the official notification for 2025. To fill up the vacancies for Senior Research Fellow Jobs. Those candidates who have qualified in the M.Sc, M.Tech. can apply for the NII Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can fill out the application form on or before the last date of application...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "01-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-04T23:45:31.618230",
      "links": []
    },
    {
      "id": "5e03cf50ea08ddec5dff297dad98e170",
      "title": "IITM Pune Recruitment 2025 - Apply Online for Junior Research Fellow.Post",
      "url": "https://allgovernmentjobs.in/iitm-pune-recruitment-2025-apply-online-for-junior-research-fellow-post/33870",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Tropical Meteorology (IITM) Pune has declared the latest job notification for 2025. To fill up the vacancies for the Junior Research Fellow Jobs. Those candidates who have qualified in the M.Sc., M.Tech., and Post Graduation can apply for the IITM Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply on or before the last d...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "28-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-04T23:45:31.618250",
      "links": []
    },
    {
      "id": "a24181347b61dbb7aab1d115cdc0bf3e",
      "title": "RITES Recruitment 2025 - Apply Online for 30 Senior Technical Assistant Posts",
      "url": "https://allgovernmentjobs.in/rites-recruitment-2025-apply-online-for-30-senior-technical-assistant-posts/33869",
      "source": "allgovernmentjobs.in",
      "description": "The Rail India Technical and Economic Services Limited (RITES) has officially released the notification to fill 30 Senior Technical Assistant posts. The interested applicants can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Diploma in Civil Engineering can apply for the RITES Recruitment 2025 . The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process,...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "23-08-2025",
        "found_date": "01-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-04T23:45:31.618268",
      "links": []
    },
    {
      "id": "de9c6b513ef9ccb126c739a5e2773728",
      "title": "UP Police SI Vacancy New Recruitment 2025 यूपी पुलिस 4543 SI Vacancy Apply Online",
      "url": "https://www.jobriya.in/up-police-si-vacancy-2025-up-sub-inspector-notification/",
      "source": "www.jobriya.com",
      "description": "UP Police SI Recruitment 2025 Uttar Pradesh Police Sub Inspector Notification Release Date 2025 यूपी पुलिस सब इंस्पेक्टर के 4543 पदों पर भर्ती जल्द UP SI New Vacancy 2025 यूपी पुलिस भर्ती 2025 की कब निकलेगी UP Police SI Recruitment 2025 Latest Updated : UP Police will soon Release the Official Notification For Sub-Inspector Post… Candidates Stay Connected with us For All Latest Official Updates.. उत्तर प्रदेश पुलिस में जल्दी ही (Sub Inspector) सहायक निरीक्षक दरोगा के 4543 पदों पर भर्ती होने ज...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "01-07-2021"
      },
      "category": "Banking",
      "skills": [
        "Cloud",
        "Word",
        "Hindi"
      ],
      "scraped_at": "2025-08-04T23:46:09.583224",
      "links": [
        "https://prpb.gov.in",
        "https://wordpress-206774-624424.cloudwaysapps.com/up-police-si-mains-exam-pattern-syllabus-2015/",
        "http://uppbpb.gov.in"
      ]
    },
    {
      "id": "0ad7da34e4cc0fd48427a5587aaa55a6",
      "title": "BSSC Office Attendant Recruitment 2025 कार्यालय परिचारी (3727 Posts) Apply Online",
      "url": "https://www.jobriya.in/bssc-office-attendant-vacancy-2025-apply-online-for-3727-posts/",
      "source": "www.jobriya.com",
      "description": "BSSC Office Attendant Recruitment 2025 Apply Online for BSSC कार्यालय परिचारी (3727 Posts) Apply Online BSSC Adv No. 06/25, Post- Office Attendant/Attendant(Special) Combined Competitive Exam Education Qualification/ Selection Process 2025 BSSC Office Attendant Vacancy 2025 Age Limit Application Fees BSSC Office Attendant Recruitment 2025 Latest Update 04.08.2025 : Bihar SSC has started the Online Submission of Application Process for Adv No. 06/25, Post- Office Attendant/Attendant(Special) C...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "25/08/2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-04T23:46:09.584386",
      "links": [
        "https://bssc.bihar.gov.in/NoticeBoard.htm"
      ]
    },
    {
      "id": "acde2bf9e3c565166a6930b10d97a5f1",
      "title": "BSSC 4th Graduate Level Exam Recruitment 2025 (1481 Posts) Apply Online",
      "url": "https://www.jobriya.in/bssc-4th-graduate-level-exam-recruitment-2025-1481-posts-apply-online/",
      "source": "www.jobriya.com",
      "description": "BSSC 4th Graduate Level Exam 2025 Is Released Now Bihar 4th Graduate Level Combined Online Exam Form 2025 is Mentioned Below Bihar SSC Has Started CGL Recruitment 2025 for 1481 Posts of Secretariat Assistant, Auditor & Planning Assistant BSSC Third Graduate Level Combined Competitive Exam Apply Online 2025 Link Is Given Below Bihar SSC 4th Graduate Level Exam 2025 Latest Update 04.08.2025: Bihar SSC Has start 4th Graduate Level exam online application Apply Online …Check Details From the link...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Mathematics",
        "Data Entry"
      ],
      "scraped_at": "2025-08-04T23:46:09.585522",
      "links": [
        "https://bssc.bihar.gov.in"
      ]
    },
    {
      "id": "fecf0e9595f429b902cada03ab990cb7",
      "title": "UP Police Constable Recruitment 2025 (19220 Posts) Apply Online Date Latest News",
      "url": "https://www.jobriya.in/up-police-constable-recruitment-2025-apply-online-date/",
      "source": "www.jobriya.com",
      "description": "UP Police Constable Recruitment 2025 UP Police Constable Vacancy 2025 for 19220 Online Application UP Police Bharti 2025 Uttar Pradesh Police Constable Recruitment 2025 उत्तर प्रदेश पुलिस भर्ती UP Police Constable New Vacancy 2025 UP Police Constable Recruitment 2025 Latest Update 04.08.2025 : UP Police will Release New notification to fill 19220 Constable Posts….. Online Application will start soon…. stay connected with us for more updates.. उत्तर प्रदेश पुलिस आरक्षी नागरिक पुलिस एवं आरक्षी ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "19/02/1996"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-04T23:46:09.585547",
      "links": [
        "http://uppbpb.gov.in"
      ]
    },
    {
      "id": "a1009f06a710b96f6eb9af2fd8bdfcf1",
      "title": "DSSSB Warder Recruitment 2025 (2119 Posts) Advt. 01/2025 Apply Online",
      "url": "https://www.jobriya.in/dsssb-warder-recruitment-2025/",
      "source": "www.jobriya.com",
      "description": "DSSSB Warder Recruitment 2025 Delhi Subordinate Services Selection Board Has Started Online Application to fill 2119 Various Posts Of Warder & Assistant Check Details Apply Online DSSSB Warder Recruitment 2025 Latest Updated On 22.07.2025 :- DSSSB has started the online application process for submitting various posts for Advertisement No. 01/2025….. check details from below… Online Applications are invited for recruitment to the following posts under different Departments/Local/Autonomous Bo...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "07/08/2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-04T23:46:09.585635",
      "links": [
        "https://dsssb.delhi.gov.in",
        "https://dsssbonline.nic.in"
      ]
    },
    {
      "id": "952e2bf3ec974f377b014a8ea5ee1101",
      "title": "PAU Recruitment 2025 - Apply Offline for Senior Lab and Field Helper Post",
      "url": "https://allgovernmentjobs.in/pau-recruitment-2025-apply-offline-for-senior-lab-and-field-helper-post/33898",
      "source": "allgovernmentjobs.in",
      "description": "Punjab Agricultural University (PAU) has announced the official notification for 2025. To fill up the vacancies for Senior Lab and Field Helper Jobs. Those candidates who have qualified in the 10th Pass, 12th can grab this chance and apply for these posts. Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the PAU Recruitment 2025 . Interested and eligible candidates can fill out the application form on or before the l...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "03-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-05T23:45:50.440012",
      "links": []
    },
    {
      "id": "815ab555d3ad6799480dbc3004d0584c",
      "title": "IIT Dhanbad Recruitment 2025 - Apply for Junior Research Fellow Post",
      "url": "https://allgovernmentjobs.in/iit-dhanbad-recruitment-2025-apply-for-junior-research-fellow-post/33895",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology (IIT) Dhanbad has declared the latest job notification for 2025. TO fill up the vacancies for Junior Research Fellow Jobs. Those candidates who have completed their B.E/ B.Tech, M.E/ M.Tech in Mechanical Engineering, and M.Sc can grab this chance and apply for the IIT Dhanbad Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidat...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "16-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-05T23:45:50.440078",
      "links": []
    },
    {
      "id": "32ba6029737bf02367027cf4c3f6e49a",
      "title": "University of Hyderabad Recruitment 2025 - Apply for Senior Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/university-of-hyderabad-recruitment-2025-apply-for-senior-research-fellow-posts/33894",
      "source": "allgovernmentjobs.in",
      "description": "University of Hyderabad has declared the latest job notification for 2025. To fill up the vacancies for Senior Research Fellow Jobs. Those candidates who have qualified in the B.E/ B.Tech in Mechanical Engineering can apply for the University of Hyderabad Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply on or before the last date of applicati...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "05-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-05T23:45:50.440102",
      "links": []
    },
    {
      "id": "38745206f4d276523ded790e243bf158",
      "title": "TMC Recruitment 2025 - Walk-in-Interview for Staff Nurse Post",
      "url": "https://allgovernmentjobs.in/tmc-recruitment-2025-walk-in-interview-for-staff-nurse-post/33892",
      "source": "allgovernmentjobs.in",
      "description": "The Tata Memorial Centre (TMC) has declared the latest job notification for 2025. To fill up the vacancies for Staff Nurse Jobs. Those candidates who have qualified in the B.Sc Nursing can apply for the TMC Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the TMC Recruitment 2025. Interested and eligible candidates can attend the interview at the given venue. For more details, visit the official web...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-05T23:45:50.440144",
      "links": []
    },
    {
      "id": "d2112a64bddf0d9552998e728171ae81",
      "title": "AIIMS Nagpur Recruitment 2025 - Apply Online for 108 Senior Resident Posts",
      "url": "https://allgovernmentjobs.in/aiims-nagpur-recruitment-2025-apply-online-for-108-senior-resident-posts/33890",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences (AIIMS) Nagpur has announced the official notification for 2025. To fill up the vacancies for 108 Senior Resident Jobs. Those candidates who have qualified in the MS/ MD, DNB can apply for the AIIMS Nagpur Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the posts. Interested and eligible candidates can apply on or before the deadline. For more details, visit ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "05-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-05T23:45:50.440181",
      "links": []
    },
    {
      "id": "6ad02791a4ad18b4ff235e6409063321",
      "title": "NIT Warangal",
      "url": "https://allgovernmentjobs.in/nit-warangal-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technology, Warangal (NIT Warangal) has officially released the notification to fill the vacan .... The National Institute of Technology Warangal (NIT Warangal) has officially released the notification to fill the vacanc .... The National Institute of Technology (NIT) has announced the official notification for 2025. To fill up the vacancies fo .... The National Institute of Warangal (NIT Warangal) has officially released the notification to fill 01 Technical Assista...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2025-08-05T23:45:50.440223",
      "links": []
    },
    {
      "id": "d58ad18cb0952c0914d73fcd521209f1",
      "title": "IIT Dhanbad",
      "url": "https://allgovernmentjobs.in/iit-dhanbad-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology (IIT) Dhanbad has declared the latest job notification for 2025. TO fill up the vacancies .... The Indian Institute of Technology Dhanbad (IIT Dhanbad) has officially released the notification for 01 Resea .... Indian Institute of Technology (IIT) Dhanbad has announced the official Notification for 2025. To fill up the Vacancies ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-05T23:45:50.440243",
      "links": []
    },
    {
      "id": "89926a50c4b2eca4a09ba3d31e8c1fe7",
      "title": "University of Hyderabad",
      "url": "https://allgovernmentjobs.in/university-of-hyderabad-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "University of Hyderabad has declared the latest job notification for 2025. To fill up the vacancies for Senior Rese .... University of Hyderabad has officially released the notification for 2025. To fill up the vacancies for Senior Rese ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-05T23:45:50.440267",
      "links": []
    },
    {
      "id": "7e12fc3734e53e30bf825e9038058f26",
      "title": "HARTRON",
      "url": "https://allgovernmentjobs.in/hartron-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Haryana State Electronics Development Corporation Limited (HARTRON) has officially released the notification to fill ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-05T23:45:50.440289",
      "links": []
    },
    {
      "id": "81be29a4882497905acc3cf0038cdf01",
      "title": "IIT Tirupati",
      "url": "https://allgovernmentjobs.in/iit-tirupati-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology Tirupati (IIT Tirupati) has officially released the notification to fill the vacancie .... The Indian Institution of Technology Tirupati (IIT Tirupati) has officially released the notification for 02 Project Ass .... The Indian Institute of Technology, Tirupati (IIT Tirupati) has officially released the notification to fill up 42 Techn ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2025-08-05T23:45:50.440315",
      "links": []
    },
    {
      "id": "e59bf68ed06238db8bb3c589d41136ba",
      "title": "AIIMS Nagpur",
      "url": "https://allgovernmentjobs.in/aiims-nagpur-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences (AIIMS) Nagpur has announced the official notification for 2025. To fill up the .... The All India Institute of Medical Sciences (AIIMS), Nagpur, has announced the official notification for 2025. To fill u .... The All India Institute of Medical Sciences (AIIMS) Nagpur has recently released the Notification for 2025. To fill up t ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-08-05T23:45:50.440334",
      "links": []
    },
    {
      "id": "5cfe476850b46334136db74800e40d3d",
      "title": "IBPS Clerk 15th 2025 Apply Online Form",
      "url": "https://www.rojgarresult.com/ibps-clerk-15th-online-form-2025/",
      "source": "www.rojgarresult.com",
      "description": "IBPS Institute Of Banking Personal Selection (IBPS) Customer Service Associates CSA / Clerk XV 2025: Apply Online Post Update Date: 31-07-2025 Short Description: IBPS Clerk 15th Online Form 2025 : Institute Of Banking Personal Selection (IBPS) Official Notification is released and Online Form Now Started on 01 August 2025 to 21 August 2025 is Last Date for IBPS Common Recruitment Process for Recruitment of Customer Service Associates (CSA) Recruitment Clerk 2025  Examination, Vacancy 2025 Ful...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "21/08/2025",
        "found_date": "31-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-05T23:46:11.364580",
      "links": []
    },
    {
      "id": "feee4c5069a09e587b86524e5030e292",
      "title": "Bihar BSSC Office Attendant Online Form 2025 for 3727 Post",
      "url": "https://www.rojgarresult.com/bihar-bssc-office-attendant-2025/",
      "source": "www.rojgarresult.com",
      "description": "Bihar SSC Office Attendant Recruitment 2025: Apply for 3727 Post Post Date: 05-08-2025 Short Description: Bihar BSSC Office Attendant Recruitment 2025 Apply Online Form : Bihar Staff Selection Commission Bihar BSSC Office Attendant Online Form 2025, Notification has been released on the website @https://bssc.bihar.gov.in/ & Application Form now started on 25 August 2025 to 24 September 2025 for Total 3727 Post Bihar Staff Selection Commission Jobs 2025. Get the direct link to download notific...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "05-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-05T23:46:11.364758",
      "links": [
        "https://bssc.bihar.gov.in/"
      ]
    },
    {
      "id": "85ad74d2b04a6bc182a411914fbb55d7",
      "title": "SBI Junior Associates Clerk Online Form 2025 for 5180 Post",
      "url": "https://www.rojgarresult.com/sbi-junior-associate-clerk-august-2025/",
      "source": "www.rojgarresult.com",
      "description": "SBI Junior Associates (Customer Support & Sales) Clerk Recruitment 2025 for 5180 Post Post Update Date: 05-08-2025 Short Description: State Bank of India SBI Clerk Online Form 2025 for 5180 Post: State Bank of India SBI Junior Associates (Customer Support & Sales) Clerk Official Notification is released and Online Form Now Started on 06 August 2025 to 26 August 2025 is Last Date for SBI Clerk Examination, Vacancy 2025 Full Notification available at the official website. All the candidates can...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "26/08/2025",
        "found_date": "05-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-05T23:46:11.364776",
      "links": []
    },
    {
      "id": "0de7dbe71f2f380fc040e89f696f7a90",
      "title": "DSSSB Various Post Online Form 2025 | Advt No 02/2025",
      "url": "https://www.rojgarresult.com/dsssb-various-post-advt-no-02-2025/",
      "source": "www.rojgarresult.com",
      "description": "DSSSB Advt No 02/2025 Various Post Recruitment 2025: Apply Online for 615 Post Post Update Date: 04-08-2025 Short Description: DSSSB Various Post Online Form 2025 | Advt No 02/2025 : Delhi Subordinate Service Selection Board (DSSSB) Official Notification is released and Online Form Now Started on 18 August 2025 to 16 September 2025 is Last Date for Upcoming DSSSB Advt No 02/2025 Examination, Vacancy 2025 Full Notification available at the official website. All the candidates can now check the...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "16/09/2025",
        "found_date": "04-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Mathematics",
        "Hindi",
        "Typing",
        "Ms Office",
        "English"
      ],
      "scraped_at": "2025-08-05T23:46:11.364797",
      "links": []
    },
    {
      "id": "bd6dcd5c083d6c5d62d333b609f59023",
      "title": "Bihar BSSC 4th Graduate Level Online Form 2025 for 1481 Post",
      "url": "https://www.rojgarresult.com/bihar-bssc-4th-graduate-level-2025/",
      "source": "www.rojgarresult.com",
      "description": "Bihar SSC Combined Graduate Level Recruitment 2025: Apply for 1481 Post Post Date: 04-08-2025 Short Description: Bihar BSSC 4th Graduate Level Recruitment 2025 Apply Online Form : Bihar Staff Selection Commission Bihar BSSC 4th Graduate Level Online Form 2025, Notification has been released on the website @https://bssc.bihar.gov.in/ & Application Form now started on 18 August 2025 to 17 September 2025 for Total 1481 Post Bihar Staff Selection Commission Jobs 2025. Get the direct link to downl...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "04-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry",
        "Mathematics"
      ],
      "scraped_at": "2025-08-05T23:46:11.364817",
      "links": [
        "https://bssc.bihar.gov.in/"
      ]
    },
    {
      "id": "6e1241092f42ab9efded80d499e5a774",
      "title": "Bihar BRLPS Jeevika Online Form 2025 for 2747 Post",
      "url": "https://www.rojgarresult.com/bihar-brlps-jeevika-2025/",
      "source": "www.rojgarresult.com",
      "description": "Bihar Jeevika Recruitment 2025: Apply for 2747 Post Post Date: 12-07-2025 Short Description: Bihar BRLPS Jeevika Recruitment 2025 Apply Online Form : Bihar Rural Livelihoods Promotion Society Bihar BRLPS Jeevika Development Professional Online Form 2025, Notification has been released on the website @https://brlps.in/ & Application Form now started on 30 July 2025 to 18 August 2025 for Total 2747 Post Bihar Rural Livelihoods Promotion Society Bihar Development Professional Jobs 2025. Get the ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Hindi",
        "English",
        "Typing"
      ],
      "scraped_at": "2025-08-05T23:46:11.364839",
      "links": [
        "https://brlps.in/"
      ]
    },
    {
      "id": "04e407602cfab154a0781bbe5a7586e4",
      "title": "Subharti University DDE Exam Result 2025 OUT Check SVSU DDE BA B.Sc B.Com MA Results",
      "url": "https://www.jobriya.in/subharti-university-dde-exam-result-2025/",
      "source": "www.jobriya.com",
      "description": "Subharti University DDE Exam Result 2025 Swami Vivekanand Subharti University DDE B.A B.Com B.Sc M.A M.Sc M.Com 1st/ 2nd/ 3rd/ 4th/ 5th/ 6th Semester Exam Results link Available Now at University Portal i.e. (https://www.subhartidde.com) Download Here Latest Back/ Reappear Exam Results under SVSU DDE Results Link 2025 Subharti DDE Odd-Even Semester Exam Results Announced under wwwsubhartidde.com Candidates Check Now Regular and Private Online Result Link of Subharti University Examination Ses...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "English"
      ],
      "scraped_at": "2025-08-05T23:46:18.510453",
      "links": [
        "https://www.subhartidde.com)",
        "https://www.jobriya.in",
        "https://www.subhartidde.com"
      ]
    },
    {
      "id": "bb2bd882456840ca1e688dbed0d18202",
      "title": "HCSL Recruitment 2025 - Apply Online for Assistant General Manager Post",
      "url": "https://allgovernmentjobs.in/hcsl-recruitment-2025-apply-online-for-assistant-general-manager-post/33932",
      "source": "allgovernmentjobs.in",
      "description": "The Hooghly Cochin Shipyard Limited (HCSL) has announced the latest job notification for 2025. To fill up the vacancies for the Assistant General Manager Position. Those candidates who have qualified in the B.E/ B.Tech. in Mechanical Engineering, Electrical Engineering can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the HCSL Recruitment 2025 . Interested and eligible ap...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "06-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-06T23:45:16.494298",
      "links": []
    },
    {
      "id": "16c9bc58f0658a9415dfd284f65a7eac",
      "title": "Zilla Parishad Wardha Recruitment 2025 - Apply Offline for 04 Yoga Teacher Posts",
      "url": "https://allgovernmentjobs.in/zilla-parishad-wardha-recruitment-2025-apply-offline-for-04-yoga-teacher-posts/33930",
      "source": "allgovernmentjobs.in",
      "description": "The Zilla Parishad Wardha has declared the official notification for 2025. To fill up the vacancies for 04 Yoga Teacher Jobs. Those candidates who have qualified in the Diploma, Any Degree, Post Graduation can apply for the Zilla Parishad Wardha Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these Posts. Interested and eligible candidates can apply on or before the last date of application. For mo...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "04-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-06T23:45:16.494345",
      "links": []
    },
    {
      "id": "2d5f11be3fe68fab734367d1fabfddd8",
      "title": "DSSSB Recruitment 2025 - Apply Online for 615 Caretaker, Assistant, Pharmacist and Other Posts",
      "url": "https://allgovernmentjobs.in/dsssb-recruitment-2025-apply-online-for-615-caretaker-assistant-pharmacist-and-other-posts/33928",
      "source": "allgovernmentjobs.in",
      "description": "The Delhi Subordinate Service Selection Board (DSSSB) has announced the official notification for 2025. To fill up the vacancies for 615 Statistical Clerk, Surveyor, Stenographer, Assistant Librarian, Caretaker, Forest Guard, Account, Work Assistant, Music Teacher, Assistant Security Officer, and Other Posts. Those candidates who have qualified in the 10th Pass, 12th, Diploma, Any Degree, CA, MBA, Post Graduation, B.Ed. can apply for the DSSSB Recruitment 2025 . Here we include the age limit,...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "18-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-06T23:45:16.494383",
      "links": []
    },
    {
      "id": "e309b7ee81a8677ece1efa514b0f407a",
      "title": "ACTREC Recruitment 2025 - Walk-in-Interview for Engineer Post",
      "url": "https://allgovernmentjobs.in/actrec-recruitment-2025-walk-in-interview-for-engineer-post/33926",
      "source": "allgovernmentjobs.in",
      "description": "The Advanced Centre for Treatment Research and Education in Cancer (ACTREC) has declared the official notification for 2025. To fill up the vacancies for Engineer Jobs. Those candidates who have qualified in the B.E/ B.Tech. in Electrical Engineering can grab this chance and apply for these posts. Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the ACTREC Recruitment 2025 . Interested and eligible candidates can att...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "08-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-06T23:45:16.494429",
      "links": []
    },
    {
      "id": "92d1115f370f5e3c29c4baed78b2b477",
      "title": "SVBPH Delhi Recruitment 2025 - Walk-in-Interview for Senior Resident Post",
      "url": "https://allgovernmentjobs.in/svbph-delhi-recruitment-2025-walk-in-interview-for-senior-resident-post/33924",
      "source": "allgovernmentjobs.in",
      "description": "The Sardar Vallabh Bhai Patel Hospital (SVBPH) has announced the official notification for 2025. To fill up the vacancies for Senior Resident Jobs. Those candidates who have qualified for the MBBS, DNB, or Diploma can grab this chance and apply for the SVBPH Delhi Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply on or before the last date of ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-06T23:45:16.494448",
      "links": []
    },
    {
      "id": "58e57742d029d910155bb1b8ba576b8a",
      "title": "CPCB Recruitment 2025 - Apply Offline for 03 Senior Research Fellow, Junior Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/cpcb-recruitment-2025-apply-offline-for-03-senior-research-fellow-junior-research-fellow-posts/33923",
      "source": "allgovernmentjobs.in",
      "description": "The Central Pollution Control Board (CPCB) has officially released the notification to fill the vacancies of 03 Senior Research Fellow, Junior Research Fellow Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, M.E./M. Tech in Civil Engineering, Post-graduation, can apply for the CPCB Recruitment 2025. The interested applicants can apply in offline mode. Here we have ...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "25-08-2025",
        "found_date": "05-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-06T23:45:16.494485",
      "links": []
    },
    {
      "id": "4f07d719068908f7f104279519f2fb3e",
      "title": "WAPCOS",
      "url": "https://allgovernmentjobs.in/wapcos-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Water and Power Consultancy Services Limited (WAPCOS) has officially released the notification to fill the vacancies .... The Water and Power Consultancy Services Limited (WAPCOS) has officially released the notification to fill the vacancies .... The Water and Power Consultancy Services Limited (WAPCOS) has officially released the notification for 10 Audit Managers .... The Water Resources Power and Infrastructure Sectors (WAPCOS) has officially released the notification to fill up the 3...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-06T23:45:16.494508",
      "links": []
    },
    {
      "id": "7136eb261b4d968896d14c0ada10566a",
      "title": "CFTRI",
      "url": "https://allgovernmentjobs.in/cftri-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Central Food Technological Research Institute (CFTRI) has officially released the notification to fill the vacancies .... Central Food Technological Research Institute (CFTRI) has introduced the latest job notification for the Project As ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2025-08-06T23:45:16.494535",
      "links": []
    },
    {
      "id": "f8c4fdaf3325404871dd1a13257e4318",
      "title": "DSSSB",
      "url": "https://allgovernmentjobs.in/dsssb-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Delhi Subordinate Service Selection Board (DSSSB) has announced the official notification for 2025. To fill up the v .... The Delhi Subordinate Service Selection Board (DSSSB)  has officially released the notification for the 2119&n ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "General",
      "skills": [],
      "scraped_at": "2025-08-06T23:45:16.494555",
      "links": []
    },
    {
      "id": "9f9bf58aa79ac7b8139b36046762069b",
      "title": "ACTREC",
      "url": "https://allgovernmentjobs.in/actrec-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Advanced Centre for Treatment Research and Education in Cancer (ACTREC) has declared the official notification for 2 .... The Advanced Centre for Treatment Research and Education in Cancer (ACTREC) has published the official notification for .... The Advanced Centre for Treatment Research and Education in Cancer (ACTREC) has published the official notification for .... The Advanced Centre for Treatment Research and Education (ACTREC) has officially released the notification to .... The Ad...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Teaching",
      "skills": [],
      "scraped_at": "2025-08-06T23:45:16.494577",
      "links": []
    },
    {
      "id": "24adc874035b34655ddf714e8e96d995",
      "title": "NHSRC",
      "url": "https://allgovernmentjobs.in/nhsrc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Health Systems Resource Centre (NHSRC) has officially released the notification to fill the vacancies of 01 .... The National Health Systems Resource Centre (NHSRC) has officially released the notification to fill the vacancies of 01 .... The National Health Systems Resource Centre (NHSRC) has announced the official notification for 2025. To fill up the vac .... The National Health System Resource Centre (NHSRC) has officially released the notification to fill the vacancies of 02...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-08-06T23:45:16.494595",
      "links": []
    },
    {
      "id": "b983d9047a2b410acbae200c7b3ea837",
      "title": "SVBPH",
      "url": "https://allgovernmentjobs.in/svbph-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Sardar Vallabh Bhai Patel Hospital (SVBPH) has announced the official notification for 2025. To fill up the vacancie ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-08-06T23:45:16.494613",
      "links": []
    },
    {
      "id": "b0e881697cdd06d484fc9c3757e6bb51",
      "title": "SBI Junior Associate Recruitment 2025 (6589 Posts) Clerk Notification",
      "url": "https://www.jobriya.in/sbi-junior-associate-recruitment-2025-6589-posts-clerk-notification/",
      "source": "www.jobriya.com",
      "description": "SBI Junior Associate Recruitment 2025 Apply Online for SBI Clerk 2025 How to Apply for SBI Clerk 2025 Last Date to Apply for SBI JA 2025 No. of Vacancies for SBI Junior Associate 2022 SBI Clerk Education Qualification/ Selection Process 2025 SBI Clerk Application Fees Age Limit 2025 SBI Clerk Recruitment 2025 (Advertisement No. CRPD/CR/2025-26/06) Latest Updated 06.08.2025 :- SBI Has Started the Online Application Process for Clerk Recruitment (Junior Associates). Candidates Can Apply Now & C...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "25-26/06"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-06T23:45:51.222815",
      "links": [
        "https://www.sbi.co.in"
      ]
    },
    {
      "id": "bdd750fec93d91a9742fb1dbb68b598b",
      "title": "RSSB Recruitment 2025 - Apply Online for 1535 Ayush Medical Officer Posts",
      "url": "https://allgovernmentjobs.in/rssb-recruitment-2025-apply-online-for-1535-ayush-medical-officer-posts/33964",
      "source": "allgovernmentjobs.in",
      "description": "The Rajasthan Staff Selection Board (RSSB) has declared the official notification for 2025. To fill up the vacancies for 1535 Ayush Medical Office Jobs. Those candidates who have qualified in the BAMS, BHMS, and BUMS can grab this chance and apply for the RSSB Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible aspirants can apply online through the website on or be...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "07-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry",
        "Word"
      ],
      "scraped_at": "2025-08-07T23:45:40.741828",
      "links": []
    },
    {
      "id": "ecce1d3aace6e2de6a9d84e5cf381915",
      "title": "SSC Recruitment 2025 - Apply Online for 05 Young Professional Posts",
      "url": "https://allgovernmentjobs.in/ssc-recruitment-2025-apply-online-for-05-young-professional-posts/33963",
      "source": "allgovernmentjobs.in",
      "description": "The Staff Selection Commission(SSC) has officially released the notification to fill the vacancies of 05 Young Professional Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Any Degree and Diploma can apply for the SSC Recruitment 2025 . The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process, application fee,...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "21-08-2025",
        "found_date": "07-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-07T23:45:40.741855",
      "links": []
    },
    {
      "id": "9a33f2430a3ae2470de7f02781a54cec",
      "title": "BJRMH Recruitment 2025 - Walk-in-Interview for 14 Senior Resident Posts",
      "url": "https://allgovernmentjobs.in/bjrmh-recruitment-2025-walk-in-interview-for-14-senior-resident-posts/33962",
      "source": "allgovernmentjobs.in",
      "description": "Babu Jagjivan Ram Memorial Hospital (BJMRH) has declared the latest job notification for 2025. To fill up the 14 vacancies for Senior Resident Positions. Those candidates who have qualified in the MD/ MS, DNB, and MBBS can grab this chance and apply for the BJRMH Recruitment 2025 . If you are looking for more information, like the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts are see below. Interested and eligible candidat...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-07T23:45:40.741898",
      "links": []
    },
    {
      "id": "0a43f9976b1fba0aa98b13682f245f6c",
      "title": "WBHRB Recruitment 2025 - Apply Online for 5018 Staff Nurse Posts",
      "url": "https://allgovernmentjobs.in/wbhrb-recruitment-2025-apply-online-for-5018-staff-nurse-posts/33961",
      "source": "allgovernmentjobs.in",
      "description": "The West Bengal Health Recruitment Board (WBHRB) has officially released the notification to fill the vacancies of 5018 Staff Nurse Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.Sc Nursing, GNM can apply for the WBHRB Recruitment 2025 . The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process, application...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "03-09-2025",
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-07T23:45:40.741926",
      "links": []
    },
    {
      "id": "1b1c9cdbdb60815cc367b93e58ffc6b4",
      "title": "BMH Delhi Recruitment 2025 - Walk-in-Interview for Junior Resident Post",
      "url": "https://allgovernmentjobs.in/bmh-delhi-recruitment-2025-walk-in-interview-for-junior-resident-post/33960",
      "source": "allgovernmentjobs.in",
      "description": "Bhagawan Mahavir Hospital Delhi ( BHH ) has announced the official notification for 2025. To fill up the vacancies for Junior Resident Jobs. Those candidates who have qualified in the MBBS can grab this chance and apply for the BMH Delhi Recruitment 2025 . For more details, like the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts, check below If you are looking for more, here is a list of Government Jobs in 2025 that you can...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "18-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-07T23:45:40.741947",
      "links": []
    },
    {
      "id": "dcf297d4242ddd9d6d2a72de7025df4f",
      "title": "HAL Recruitment 2025 - Apply Offline for 05 Technician Posts",
      "url": "https://allgovernmentjobs.in/hal-recruitment-2025-apply-offline-for-05-technician-posts/33959",
      "source": "allgovernmentjobs.in",
      "description": "The Hindustan Aeronautics Limited (HAL) has officially released the notification to fill the vacancies of 05 Technician Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Diploma in Mechanical Engineering can apply for the HAL Recruitment 2025 . The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, selection process, applicat...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "25-08-2025",
        "found_date": "06-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-07T23:45:40.741966",
      "links": []
    },
    {
      "id": "ef4477756a78423217211a1d86832fa8",
      "title": "CCRAS Recruitment 2025 - Walk-in-Interview for Senior Research Fellow Post",
      "url": "https://allgovernmentjobs.in/ccras-recruitment-2025-walk-in-interview-for-senior-research-fellow-post/33958",
      "source": "allgovernmentjobs.in",
      "description": "The Central Council for Research in Ayurvedic Sciences (CCRAS) has announced the official notification for 2025. To fill up the vacancies for Senior Research Fellow Jobs. Those candidates who have qualified in the BAMS can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the CCRAS Recruitment 2025 . Interested and eligible candidates can apply and attend the walk-in at the g...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "11-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-07T23:45:40.741985",
      "links": []
    },
    {
      "id": "25693f6b27cdded228ac2a7f5b8f6c88",
      "title": "PGIMER Recruitment 2025 - Walk-in-Interview for Project Technical Support Post",
      "url": "https://allgovernmentjobs.in/pgimer-recruitment-2025-walk-in-interview-for-project-technical-support-post/33956",
      "source": "allgovernmentjobs.in",
      "description": "The Postgraduate Institute of Medical Education and Research (PGIMER) has announced the official notification for 2025. To fill up the vacancies for Project Technical Support Jobs. Those candidates who have qualified in the 10th Pass, Diploma can apply for the PGIMER Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can attend the interview at the given...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "19-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-07T23:45:40.742022",
      "links": []
    },
    {
      "id": "14b043d0624d1a13f8cc132245bfb8f1",
      "title": "WBHRB",
      "url": "https://allgovernmentjobs.in/wbhrb-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The West Bengal Health Recruitment Board (WBHRB) has officially released the notification to fill the vacancies of 5018 ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-08-07T23:45:40.742083",
      "links": []
    },
    {
      "id": "325a058cef7332f2c7249d62db8bb583",
      "title": "BJRMH",
      "url": "https://allgovernmentjobs.in/bjrmh-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Babu Jagjivan Ram Memorial Hospital (BJMRH) has declared the latest job notification for 2025. To fill up the 14 vacanci ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-08-07T23:45:40.742102",
      "links": []
    },
    {
      "id": "c409ba57a5c5da6ab33f2e974d5d1b1c",
      "title": "NIMHANS",
      "url": "https://allgovernmentjobs.in/nimhans-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Mental Health and Neurosciences (NIMHANS) has officially released the notification to fill the .... The National Institute of Mental Health and Neurosciences (NIMHANS) has announced the official notification for 2025. To .... The National Institute of Mental Health and Neurosciences (NIMHANS) has officially released the notification to fill up .... The National Institute of Mental Health and Neurosciences (NIMHANS) has declared the official notification for 2025. To ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-08-07T23:45:40.742125",
      "links": []
    },
    {
      "id": "e9490cce7fbdb4e501ff290d5c37510e",
      "title": "CCRAS",
      "url": "https://allgovernmentjobs.in/ccras-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Central Council for Research in Ayurvedic Sciences (CCRAS) has announced the official notification for 2025. To fill .... The Central Council for Research in Ayurvedic Sciences (CCRAS) has declared the official notification for 2025. To fill .... The Central Council for Research in Ayurvedic Sciences (CCRAS) has officially released the Notification for 2025. Allott .... The Central Council for Research in Ayurvedic Sciences (CCRAS) has officially released the notification for 394 Res .......",
      "pdf_link": null,
      "important_dates": {},
      "category": "General",
      "skills": [],
      "scraped_at": "2025-08-07T23:45:40.742143",
      "links": []
    },
    {
      "id": "9a952e651580bf9cd357c3cba3aaec6e",
      "title": "SCTIMST Recruitment 2025 - Walk-in-Interview for Staff Physician Post",
      "url": "https://allgovernmentjobs.in/sctimst-recruitment-2025-walk-in-interview-for-staff-physician-post/33997",
      "source": "allgovernmentjobs.in",
      "description": "The Sree Chitra Tirunal Institute for Medical Sciences and Technology (SCTIMST) has announced the official notification for 2025. To fill up the vacancies for Staff Physician Jobs. Those candidates who have qualified for the MD can grab this chance and apply for the SCTIMST Recruitment 2025 . Here we include the ge limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can attend the interview at the...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "18-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Analyst",
        "Data Entry"
      ],
      "scraped_at": "2025-08-08T23:43:42.829066",
      "links": []
    },
    {
      "id": "566619d61f688119e1f0ffd38b60ef76",
      "title": "Unakoti District Recruitment 2025 - Walk-in-Interview for 04 Medical Officer and Other Posts",
      "url": "https://allgovernmentjobs.in/unakoti-district-recruitment-2025-walk-in-interview-for-04-medical-officer-and-other-posts/33995",
      "source": "allgovernmentjobs.in",
      "description": "Unakoti District has announced the official notification for 2025. To fill up the vacancies for 04 Medical Officers, Nurse, Counsellor, and Data Manager Jobs. Those candidates who have qualified in the MBBS, ANM, or Any Degree can grab this chance and apply for the Unakoti District Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can attend the intervi...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "18-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Analyst"
      ],
      "scraped_at": "2025-08-08T23:43:42.829125",
      "links": []
    },
    {
      "id": "75cc94444dd6fd639ace00ff200f2375",
      "title": "BFUHS Recruitment 2025 - Apply Online for 406 Staff Nurse Posts",
      "url": "https://allgovernmentjobs.in/bfuhs-recruitment-2025-apply-online-for-406-staff-nurse-posts/33994",
      "source": "allgovernmentjobs.in",
      "description": "The Baba Farid University of Health Sciences (BFUHS) has officially released the notification to fill the vacancies of 406 Staff Nurse Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their 10th pass, B.Sc Nursing, or GNM can apply for the BFUHS Recruitment 2025 . The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection pro...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "27-08-2025",
        "found_date": "07-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-08T23:43:42.829146",
      "links": []
    },
    {
      "id": "11c89834478cb887455291140c967462",
      "title": "TMC Recruitment 2025 - Walk-in-Interview for Medical Officer Post",
      "url": "https://allgovernmentjobs.in/tmc-recruitment-2025-walk-in-interview-for-medical-officer-post/33993",
      "source": "allgovernmentjobs.in",
      "description": "The Tata Memorial Centre (TMC) has published the official notification for 2025. To fill up the vacancies for Medical Officer Jobs. Those candidates who have qualified in the MBBS can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the TMC Recruitment 2025 . Interested and eligible candidates can attend the interview at the given venue. For more details, visit the official ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "19-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Analyst"
      ],
      "scraped_at": "2025-08-08T23:43:42.829165",
      "links": []
    },
    {
      "id": "adebc033f9ae43c5de5a3c3c79e8d5f6",
      "title": "TN MRB Recruitment 2025 - Apply Online for 02 Assistant Medical Officer Posts",
      "url": "https://allgovernmentjobs.in/tn-mrb-recruitment-2025-apply-online-for-02-assistant-medical-officer-posts/33992",
      "source": "allgovernmentjobs.in",
      "description": "The Tamil Nadu Medical Services Recruitment Board (TN MRB) has officially released the notification to fill the vacancies of 02 Assistant Medical Officer Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Any Degree, BHMS, Diploma, and Post-graduation can apply for the TN MRB Recruitment 2025. The interested applicants can apply in online mode.  Here we have mentioned the educatio...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "28-08-2025",
        "found_date": "08-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-08T23:43:42.829186",
      "links": []
    },
    {
      "id": "f4c11b0a946c869dbf4409b68d310353",
      "title": "HPRCA Recruitment 2025 - Apply Online for 600 Junior Basic Teacher Posts",
      "url": "https://allgovernmentjobs.in/hprca-recruitment-2025-apply-online-for-600-junior-basic-teacher-posts/33991",
      "source": "allgovernmentjobs.in",
      "description": "Himachal Pradesh Rajya Chayan Aayog (HPRCA) has published the official notification for 2025. To fill up the vacancies for 600 Junior Basic Teacher Jobs. Those candidates who have qualified in the 10th Pass, 12th, B.Ed., and Post Graduation can grab this chance and apply for the HPRCA Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply online th...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-08T23:43:42.829204",
      "links": []
    },
    {
      "id": "f8c70b06e0b80d594fcaddfda077c9a3",
      "title": "NMC Recruitment 2025 - Walk-in-Interview for 20 Secondary Teacher Posts",
      "url": "https://allgovernmentjobs.in/nmc-recruitment-2025-walk-in-interview-for-20-secondary-teacher-posts/33989",
      "source": "allgovernmentjobs.in",
      "description": "The Nagpur Municipal Corporation (NMC) has announced the official notification for 2025. To fill up the vacancies for 20 Teacher Jobs. Those candidates who have qualified in Any Degree, B.Ed, or B.Sc can apply for the NMC Recruitment 2025 . Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can attend the walk-in interview along with the documents required to the address ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Analyst"
      ],
      "scraped_at": "2025-08-08T23:43:42.829240",
      "links": []
    },
    {
      "id": "764fa36097580134e84e266964c2f02b",
      "title": "SHS Bihar Recruitment 2025 - Apply Online for 220 Ophthalmic Assistant Posts",
      "url": "https://allgovernmentjobs.in/shs-bihar-recruitment-2025-apply-online-for-220-ophthalmic-assistant-posts/33987",
      "source": "allgovernmentjobs.in",
      "description": "The State Health Society (SHS), Bihar, has announced the official notification for 2025. To fill up the vacancies for 220 Ophthalmic Assistant Jobs. Those candidates who have qualified in the 12th, Diploma can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the SHS Bihar Recruitment 2025 . Interested and eligible candidates can apply on or before the last date of applicatio...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-08T23:43:42.829260",
      "links": []
    },
    {
      "id": "c0e52afa9a539814985b791e7c01c420",
      "title": "SCTIMST",
      "url": "https://allgovernmentjobs.in/sctimst-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Sree Chitra Tirunal Institute for Medical Sciences and Technology (SCTIMST) has announced the official notifica .... Sree Chitra Tirunal Institute for Medical Sciences and Technology (SCTIMST) has declared the official notification for 2 .... Sree Chitra Tirunal Institute for Medical Sciences and Technology (SCTIMST) has declared the official notification for 2 .... The Sree Chitra Tirunal Institute of Medical Sciences and Technology (SCTIMST) has officially released the notification .......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-08-08T23:43:42.829282",
      "links": []
    },
    {
      "id": "5c02b918c600a09609d8fc58a8ef9905",
      "title": "TANUVAS",
      "url": "https://allgovernmentjobs.in/tanuvas-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Tamil Nadu Veterinary and Animal Sciences University (TANUVAS) has officially released the notification to fill the .... The Tamil Nadu Veterinary and Animal Sciences University (TANUVAS) has officially released the notification to fill the .... The Tamil Nadu Veterinary and Animal Sciences University (TANUVAS) has officially released the notification for 01 Skill .... The Tamil Nadu Veterinary and Animal Sciences University (TANUVAS) has officially released the notification for 01 Proje ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2025-08-08T23:43:42.829301",
      "links": []
    },
    {
      "id": "52a3042918bfd391b48ac6f5328f4dbc",
      "title": "BFUHS",
      "url": "https://allgovernmentjobs.in/bfuhs-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Baba Farid University of Health Sciences (BFUHS) has officially released the notification to fill the vacancies of 4 .... The Baba Farid University of Health Science (BFUHS) has declared the latest job notification for 2025. To fill up the va .... The Baba Farid University of Health Sciences (BFUHS) has released the official notification for 2025. To fill up the vac ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-08-08T23:43:42.829322",
      "links": []
    },
    {
      "id": "5aeb398d726f36e33a9abfcb99316f5e",
      "title": "TNMRB",
      "url": "https://allgovernmentjobs.in/tnmrb-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Tamil Nadu Medical Services Recruitment Board (TN MRB) has officially released the notification to fill the vacancie .... The Tamil Nadu Medical Services Board has officially released the Notification for 2025. To fill up the vacancies for Sk ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-08-08T23:43:42.829343",
      "links": []
    },
    {
      "id": "a693b3fc15cdb09df60bc676e035ebe0",
      "title": "HPPSC",
      "url": "https://allgovernmentjobs.in/hppsc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Himachal Pradesh Rajya Chayan Aayog (HPRCA) has published the official notification for 2025. To fill up the vacanc .... The Chaudhary Sarwan Kumar Himachal Pradesh Krishi Vishvavidyalaya (CSKHPKV) has officially released the notification to .... Himachal Pradesh Public Service Commission (HPPSC) is inviting Online applicants for 04 Medical Officers (Dental) Posts. .... Himachal Pradesh Public Service Commission (HPPSC) has recently announced the notification for 2025. To fill up the 04 v ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-08T23:43:42.829361",
      "links": []
    },
    {
      "id": "fd5e9cc8e7ccf293b09431dd364f9fd8",
      "title": "Kalakshetra Foundation",
      "url": "https://allgovernmentjobs.in/kalakshetra-foundation-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Kalakshetra Foundation has officially released the notification to fill the vacancies of 01 Consultant Posts. Intere ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-08T23:43:42.829382",
      "links": []
    },
    {
      "id": "c6a12c1a44b073be21517102a95851dd",
      "title": "Chandigarh JBT Teacher Online Form 2025 for 218 Post",
      "url": "https://www.rojgarresult.com/chandigarh-jbt-teacher-2025/",
      "source": "www.rojgarresult.com",
      "description": "Chandigarh Samagra Shiksha JBT Teacher Recruitment 2025: Apply for 218 Post Post Date: 09-08-2025 Short Description: Chandigarh JBT Teacher Recruitment 2025 Apply Online Form : Samagra Shiksha Chandigarh JBT Primary Teacher Online Form 2025, Notification has been released on the website @https://ssachd.nic.in/ & Application Form now started on 07 August 2025 to 28 August 2025. Samagra Shiksha Chandigarh Jobs 2025. Get the direct link to download notification link available on Chandigarh JBT T...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "09-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-09T23:43:23.020159",
      "links": [
        "https://ssachd.nic.in/"
      ]
    },
    {
      "id": "18c6d43a479c577f758fc627186c2270",
      "title": "Punjab University Recruitment 2025 - Apply Offline for Multi Task Worker Post",
      "url": "https://allgovernmentjobs.in/punjab-university-recruitment-2025-apply-offline-for-multi-task-worker-post/34031",
      "source": "allgovernmentjobs.in",
      "description": "Punjab University has declared the latest job notification for 2025. To fill up the vacancies for Multitask Worker Jobs. Those candidates who have qualified in the 10th Pass can grab this chance and apply for the Punjab University Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can send their resume along with the relevant documents to the address giv...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "08-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-11T23:42:07.367937",
      "links": []
    },
    {
      "id": "ca59da199ff7e0ef8e7aea374a507f9d",
      "title": "AIIMS Bhopal Recruitment 2025 - Walk-in-Interview for 02 Project Research Scientist and Other Posts",
      "url": "https://allgovernmentjobs.in/aiims-bhopal-recruitment-2025-walk-in-interview-for-02-project-research-scientist-and-other-posts/34029",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences (AIIMS) Bhopal has announced the official notification for 2025. To fill up the vacancies for 02 Project Research Scientists and Data Entry Operators. Those candidates who have qualified in the MBBS, BDS, BVSc, and 12th can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for AIIMS Bhopal Recruitment 2025 . Interested and eligible candidat...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "25-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-11T23:42:07.367989",
      "links": []
    },
    {
      "id": "8ea286feb57694d31abc56b094e8cd12",
      "title": "Madras High Court Recruitment 2025 - Apply Online for 41 Assistant Programmer Posts",
      "url": "https://allgovernmentjobs.in/madras-high-court-recruitment-2025-apply-online-for-41-assistant-programmer-posts/34026",
      "source": "allgovernmentjobs.in",
      "description": "The Madras High Court has declared the latest job notification for 2025. To fill up the vacancies for 41 Assistant Programmer Jobs. Those candidates who have qualified in the B.Sc, M.Sc, MCA, B.E/ B.Tech, M.E/ M.Tech can grab this chance and apply for the Madras High Court Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Eligible candidates can apply online through the website on or bef...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "10-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-11T23:42:07.368048",
      "links": []
    },
    {
      "id": "442c8d132e47747b970cecc6ca2fcc9e",
      "title": "AIIMS Bhubaneswar Recruitment 2025 - Walk-in interview for Project Associate Posts",
      "url": "https://allgovernmentjobs.in/aiims-bhubaneswar-recruitment-2025-walk-in-interview-for-project-associate-posts/34025",
      "source": "allgovernmentjobs.in",
      "description": "The All India Institute of Medical Sciences Bhubaneswar (AIIMS Bhubaneswar) has officially released the notification to fill the vacancies of 01 Project Associate Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, M.E./M. Tech, M.Sc., can apply for the AIIMS Bhubaneswar Recruitment 2025 . The interested applicants can attend the walk-in interview. Here we have mentio...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "21-08-2025",
        "found_date": "21-07-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-11T23:42:07.368081",
      "links": []
    },
    {
      "id": "774379bb1eff1bf9bc3d9aae20bbb9df",
      "title": "SRFTI Recruitment 2025 - Apply Offline for 02 Medical Officer Posts",
      "url": "https://allgovernmentjobs.in/srfti-recruitment-2025-apply-offline-for-02-medical-officer-posts/34024",
      "source": "allgovernmentjobs.in",
      "description": "The Satyajit Ray Film & Television Institute (SRFTI) has announced the latest job notification for 2025. To fill up the 02 vacancies for Medical Officer Posts. Those candidates who have qualified in the MBBS can apply for the SRFTI Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible aspirants can fill out the application form on or before the last date of applicatio...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "03-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-11T23:42:07.368107",
      "links": []
    },
    {
      "id": "1e30935ec7b41d916faba2b9500946e1",
      "title": "IIT Gandhinagar Recruitment 2025 - Apply Online for Junior Research Fellow Post",
      "url": "https://allgovernmentjobs.in/iit-gandhinagar-recruitment-2025-apply-online-for-junior-research-fellow-post/34023",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology (IIT) Gandhinagar has announced the official notification for 2025. To fill up the vacancies for the Junior Research Fellow Position. Those candidates who have qualified in the B.E/ B.Tech, M.E/ M.Tech in Mechanical Engineering, Electrical Engineering can grab this chance and apply for the IIT Gandhinagar Recruitment 2025 . Here we include the age limit, selection process, salary structure, Education details, application fee, and how to apply for these posts...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "10-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-11T23:42:07.368127",
      "links": []
    },
    {
      "id": "0aad0072a012843037b9eb8b874d4891",
      "title": "Mormugao Port Trust Recruitment 2025 - Apply Online for 84 Apprentice Posts",
      "url": "https://allgovernmentjobs.in/mormugao-port-trust-recruitment-2025-apply-online-for-84-apprentice-posts/34022",
      "source": "allgovernmentjobs.in",
      "description": "The Morumugao Port Trust has officially released the notification to fill the vacancies of 84 Trade Apprentice, Graduate Apprentice, and Technician Apprentice Posts. The interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their 10th pass, ITI, 12th, Diploma, B.E./B. Tech in Civil, Mechanical, and Electrical Engineering can apply for the Murmugao Port Trust Recruitment 2025. The interested appli...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "29-08-2025",
        "found_date": "08-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-11T23:42:07.368145",
      "links": []
    },
    {
      "id": "cf300bca6952796cc0fd92f0a907351e",
      "title": "Punjab PSC",
      "url": "https://allgovernmentjobs.in/punjab-psc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Punjab University has declared the latest job notification for 2025. To fill up the vacancies for Multitask Worker .... The Punjab State Legal Services Authority (SLSA Punjab) has officially released the online notification for 22 Process S .... The Punjab State Federation of Cooperative Sugar Mills Limited (Sugarfed Punjab) has officially released the notificatio ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-11T23:42:07.368167",
      "links": []
    },
    {
      "id": "54f79a7d2f61414148080f7178110c7c",
      "title": "AIIMS Bhopal",
      "url": "https://allgovernmentjobs.in/aiims-bhopal-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences (AIIMS) Bhopal has announced the official notification for 2025. To fill up the .... All India Institute of Medical Sciences (AIIMS) Bhopal has recently released the official Notification for 2025. Allotte .... All India Institute of Medical Sciences (AIIMS) Bhopal has recently released the official Notification for 2025. Allotte .... All India Institute of Medical Sciences (AIIMS) Bhopal has recently released the official Notification for 2025. Allotte...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-08-11T23:42:07.368191",
      "links": []
    },
    {
      "id": "485f4fe8d68e0abc6622c76707406f53",
      "title": "E-courts",
      "url": "https://allgovernmentjobs.in/e-courts-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Madras High Court has declared the latest job notification for 2025. To fill up the vacancies for 41 Assistant .... The Nuh District Court has announced the latest job notification for 2025. To fill up the vacancies for 10 Clerk Jo .... The Himachal Pradesh High Court has declared the official notification for Junior Scale Stenographer Jobs. Candidat .... The District Legal Services Authority Karimnagar (DLSA Karimnagar) has officially released the notification to fill the .... The Warang...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-11T23:42:07.368210",
      "links": []
    },
    {
      "id": "ff6ff34cb87c2c4a0c8a1b7584008bbe",
      "title": "Ministry of Information and Broadcasting",
      "url": "https://allgovernmentjobs.in/ministry-of-information-and-broadcasting-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Satyajit Ray Film & Television Institute (SRFTI) has announced the latest job notification for 2025. To fill up ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-11T23:42:07.368259",
      "links": []
    },
    {
      "id": "9a436dd673b54ad0f187549769f70728",
      "title": "Rajasthan Police SI Recruitment 2025 RPSC SI भर्ती (1015 Posts) Apply Online",
      "url": "https://www.jobriya.in/rajasthan-police-si-recruitment-2025-rpsc-si-bharti/",
      "source": "www.jobriya.com",
      "description": "Rajasthan Police Sub Inspector Recruitment 2025 राजस्थान पुलिस SI भर्ती ऑनलाइन फॉर्म Rajasthan PSC Announced Recruitment Notice for Platoon Commander SI Posts Rajasthan PSC SI 2025 Rajasthan PSC 1015 Posts Sub Inspector Recruitment 2025 राजस्थान पुलिस SI भर्ती ऑनलाइन फॉर्म RPSC SI Recruitment 2025 Rajasthan Police SI Recruitment 2025 Latest Updates 11.08.2025 :- Rajasthan PSC Has Released Notification to fill 1015 Sub Inspector SI Vacancy In Rajasthan Police……Online Application will Accept fr...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "01-01-26"
      },
      "category": "Banking",
      "skills": [
        "Hindi",
        "Word"
      ],
      "scraped_at": "2025-08-11T23:42:42.614077",
      "links": [
        "https://rpsc.rajasthan.gov.in",
        "https://swcs.rajasthan.gov.in/ApplicationTracker.aspx"
      ]
    },
    {
      "id": "1ceb9f63d8b37758dca5436f2aa2cde4",
      "title": "UCO Bank Recruitment 2025 - Apply Online for Chief Risk Officer Post",
      "url": "https://allgovernmentjobs.in/uco-bank-recruitment-2025-apply-online-for-chief-risk-officer-post/34066",
      "source": "allgovernmentjobs.in",
      "description": "The  United Commercial Bank (UCO) has announced the latest job notification for 2025. To fill up the vacancies for Chief Risk Officer Jobs. Those candidates who have qualified in Any Degree can grab this chance and apply for the UCO Bank Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply online through the website on or before the last date of ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-12T23:42:31.091736",
      "links": []
    },
    {
      "id": "6018c99ffe812de43ad3f76e56975668",
      "title": "Hindustan Copper Limited Recruitment 2025 - Apply Online for 27 Graduate Engineer Trainee Posts",
      "url": "https://allgovernmentjobs.in/hindustan-copper-limited-recruitment-2025-apply-online-for-27-graduate-engineer-trainee-posts/34065",
      "source": "allgovernmentjobs.in",
      "description": "Hindustan Copper Limited has declared the latest job notification for 2025. To fill up the vacancies for 27 Graduate Engineer Trainee Jobs. Those candidates who are qualified in the B.E/ B.Tech in Mechanical Engineering, Electrical Engineering, MBA, and Post Graduation can grab this chance and apply for the Hindustan Copper Limited Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Intere...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-12T23:42:31.091766",
      "links": []
    },
    {
      "id": "a82da465de6cae2ab510755144d8e8f7",
      "title": "IISWC Recruitment 2025 - Walk - in for 02 Young Professional- II Posts",
      "url": "https://allgovernmentjobs.in/iiswc-recruitment-2025-walk-in-for-02-young-professional-ii-posts/34064",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Soil and Water Conservation (IISWC) has officially released the notification to fill the vacancies of 02 Young Professional - II Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, M.E./M. Tech, M.Sc, PGDM, and Post-graduation can apply for the IISWC Recruitment 2025 . The interested applicants can attend the walk-in interview. Here we have men...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "25-08-2025",
        "found_date": "05-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-12T23:42:31.091786",
      "links": []
    },
    {
      "id": "f739ace1c85f9cd836d7854b27d68aa3",
      "title": "BSA Recruitment 2025 - Walk-in-Interview for 38 Junior Resident Posts",
      "url": "https://allgovernmentjobs.in/bsa-recruitment-2025-walk-in-interview-for-38-junior-resident-posts/34063",
      "source": "allgovernmentjobs.in",
      "description": "Dr Babasaheb Ambedkar Hospital has declared the latest job notification 2025. To fill up the vacancies for 38 Junior Resident Jobs. Those candidates who have qualified in the MBBS can apply for the BSA Recruitment 2025. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the BSA Recruitment 2025 . Interested and eligible candidates can apply on or before the last date of application. For more details, visit the official ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "19-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry",
        "Word"
      ],
      "scraped_at": "2025-08-12T23:42:31.091806",
      "links": []
    },
    {
      "id": "63b90074f29a0508aa5821e4999b77af",
      "title": "CSKHPKV Recruitment 2025 - Apply Offline for 14 Field Assistant and Other Posts",
      "url": "https://allgovernmentjobs.in/cskhpkv-recruitment-2025-apply-offline-for-14-field-assistant-and-other-posts/34062",
      "source": "allgovernmentjobs.in",
      "description": "The Chaudhary Sarwan Kumar Himachal Pradesh Krishi Vishvavidyalaya (CSKHPKV) has officially released the notification to fill the vacancies of 14 Field Assistant, Technical Assistant, Clerk, Pharmacist, and Lab Attendant Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their 10th pass, 12th, B.Sc, and D. Pharm can apply for the CSKHPKV Recruitment 2025 . The interested applicants can ...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "28-08-2025",
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-12T23:42:31.091824",
      "links": []
    },
    {
      "id": "6ca4e5abf6c353bdf057732c4102483d",
      "title": "TMC Recruitment 2025 - Walk-in-Interview for Assistant Medical Superintendent Post",
      "url": "https://allgovernmentjobs.in/tmc-recruitment-2025-walk-in-interview-for-assistant-medical-superintendent-post/34061",
      "source": "allgovernmentjobs.in",
      "description": "The Tata Memorial Centre (TMC) has announced the latest job notification for 2025. To fill up the vacancies for Assistant Medical Superintendent Jobs. Those candidates who have qualified in the MBBS, BDS, MD/ MS, DNB, and Post Graduation can grab this chance and apply for these posts. Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the T MC Recruitment 2025 . Interested and eligible candidates can attend the intervi...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "26-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-12T23:42:31.091847",
      "links": []
    },
    {
      "id": "f4000c661d24394052d8f1f0fc4b6540",
      "title": "SJVN Recruitment 2025 - Apply Offline for 13 Assistant and Other Posts",
      "url": "https://allgovernmentjobs.in/sjvn-recruitment-2025-apply-offline-for-13-assistant-and-other-posts/34060",
      "source": "allgovernmentjobs.in",
      "description": "The Satluj Jal Vidyut Nigam Limited (SJVN) has officially released the notification to fill the vacancies of 13 Assistant, Workmen Trainee Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Any Degree, and 08th can apply for the SJVN Recruitment 2025 . The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, selection process, a...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "30-09-2025",
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-12T23:42:31.091866",
      "links": []
    },
    {
      "id": "45f7252a85f95ecfdc6d097345f5b5c6",
      "title": "IIT Bhilai Recruitment 2025 - Apply for 02 Junior Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/iit-bhilai-recruitment-2025-apply-for-02-junior-research-fellow-posts/34059",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology (IIT) Bhilai has declared the latest job notification for 2025. To fill up the vacancies for Junior Research Fellow Jobs. Those candidates who have qualified in the B.E/ B.Tech, M.E/ M.Tech, and M.Sc can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the IIT Bhilai Recruitment 2025 . Interested and eligible candidates can fill out the app...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "11-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-12T23:42:31.091885",
      "links": []
    },
    {
      "id": "8663169f3172b9695ff56c5673db56a2",
      "title": "Ministry of Commerce",
      "url": "https://allgovernmentjobs.in/ministry-of-commerce-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Marine Products Exports Development Authority (MPEDA) has officially released the notification to fill the vacancies .... The Directorate General of Foreign Trade (DGFT) has declared the official notification for 2025. Allotted Vacancies for .... The Coffe Board of India has declared the job notification for the position of Subject Matter Specialist and Other ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-12T23:42:31.091929",
      "links": []
    },
    {
      "id": "41a378f087343fc36dc64edffc4304dd",
      "title": "Hindustan Copper Ltd",
      "url": "https://allgovernmentjobs.in/hindustan-copper-ltd-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Hindustan Copper Limited has declared the latest job notification for 2025. To fill up the vacancies for 27 Graduate Eng .... The Hindustan Copper Limited (HCL) has declared the official notification for 2025. To fill up the vacancies for 167 Tra .... The Hindustan Copper Limited (HCL) has recently announced the Notification for 2025. To fill up the 209 Trade Apprentice ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-12T23:42:31.091952",
      "links": []
    },
    {
      "id": "19e10a4892df852dc6a84935fc7b0f46",
      "title": "BSAMCH",
      "url": "https://allgovernmentjobs.in/bsamch-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Dr Babasaheb Ambedkar Hospital has declared the latest job notification 2025. To fill up the vacancies for 38 Junio ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-08-12T23:42:31.091981",
      "links": []
    },
    {
      "id": "cc4655510961d201e00415d0b51206c9",
      "title": "SJVN Limited",
      "url": "https://allgovernmentjobs.in/sjvn-limited-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Satluj Jal Vidyut Nigam Limited (SJVN) has officially released the notification to fill the vacancies of 13 Assistan ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-12T23:42:31.092024",
      "links": []
    },
    {
      "id": "dea2a76bc38cc1355d82d92d3bc6be81",
      "title": "IIT Bhilai",
      "url": "https://allgovernmentjobs.in/iit-bhilai-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology (IIT) Bhilai has declared the latest job notification for 2025. To fill up the vacanc .... The Indian Institute of Technology (IIT) Bhilai has officially released the notification for 2025. To fill up the vacanc .... The Indian Institute of Technology Bhilai (IIT Bhilai) has officially released the notification for 02 Project Engineer ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2025-08-12T23:42:31.092044",
      "links": []
    },
    {
      "id": "f32b68e48ff382504ba165fa5f13c166",
      "title": "NAM Kerala Recruitment 2025 - Apply Offline for 02 Pharmacist and Multipurpose Health Worker Posts",
      "url": "https://allgovernmentjobs.in/nam-kerala-recruitment-2025-apply-offline-for-02-pharmacist-and-multipurpose-health-worker-posts/34101",
      "source": "allgovernmentjobs.in",
      "description": "National Ayush Mission Kerala (NAM) has announced the official notification care 2025. To fill up the vacancies for 02 Pharmacist and Multipurpose Health Worker Jobs. Those candidates who have qualified in the B.Pharm, ANM can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the NAM Kerala Recruitment 2025 . Interested and eligible candidates can apply on or before the last ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "11-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-13T23:42:27.522218",
      "links": []
    },
    {
      "id": "3c4f154f1fa2bc2884bdba875738156d",
      "title": "ESIC Karnataka Recruitment 2025 - Walk-in-Interview for 14 Professor and Other Posts",
      "url": "https://allgovernmentjobs.in/esic-karnataka-recruitment-2025-walk-in-interview-for-14-professor-and-other-posts/34017",
      "source": "allgovernmentjobs.in",
      "description": "The Employees’ State Insurance Corporation ( ESIC) Karnataka has announced the official notification for 2025. To fill up the vacancies for 14 Professor, Associate Professor, and Assistant Professor Jobs. Those candidates who have qualified in the BDS, Post Graduation, Any Degree, MBBS, MD, Ph.D can grab this chance and apply for the ESIC Karnataka Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for th...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-13T23:42:27.522244",
      "links": []
    },
    {
      "id": "d6bd0bd678c57281dd6b1ba160fbd783",
      "title": "DHS Dahod Recruitment 2025 - Apply Online for 27 Community Health Officer Posts",
      "url": "https://allgovernmentjobs.in/dhs-dahod-recruitment-2025-apply-online-for-27-community-health-officer-posts/34100",
      "source": "allgovernmentjobs.in",
      "description": "The District Health Society Dahod (DHS Dahod) has officially released the notification to fill the vacancies of 27 Community Health Officers, Medical Officers, and Audiologist Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their GNM, B.Sc Nursing, MBBS, BAMS, B.Sc, and Any Degree can apply for the DHS Dahod Recruitment 2025. The interested applicants can apply in online mode. Here w...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "23-08-2025",
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-13T23:42:27.522268",
      "links": []
    },
    {
      "id": "5bb23a3cc9ec975f9cd3a1e9c71d9495",
      "title": "ESIC Recruitment 2025 - Walk-in-Interview for 35 Specialist and Other Posts",
      "url": "https://allgovernmentjobs.in/esic-recruitment-2025-walk-in-interview-for-35-specialist-and-other-posts/34099",
      "source": "allgovernmentjobs.in",
      "description": "Employees' State Insurance Corporation (ESIC), Uttar Pradesh, has declared the official notification for 2025. To fill up vacancies for 35 Specialist Specialist and Senior Resident Jobs. Those candidates who have qualified in the MBBS, MD/ MS, Post-Graduation, and Diploma can grab this chance and apply for the ESIC Recruitment 2025 . Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligibl...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "28-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-13T23:42:27.522288",
      "links": []
    },
    {
      "id": "9a57e5d55d1938b3bbbe567cad893686",
      "title": "IRCTC Recruitment 2025 - Apply Offline for Senior Vigilance Officer Posts",
      "url": "https://allgovernmentjobs.in/irctc-recruitment-2025-apply-offline-for-senior-vigilance-officer-posts/34098",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Railway Catering and Tourism Corporation (IRCTC) has officially released the notification to fill the vacancies of 01 Senior Vigilance Officer Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, Diploma, can apply for the IRCTC Recruitment 2025. The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, sel...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "10-09-2025",
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-13T23:42:27.522308",
      "links": []
    },
    {
      "id": "b50e0f385b667c33d17bf8bf977f61d9",
      "title": "University of Kalyani Recruitment 2025 - Apply for Junior Research Fellow Post",
      "url": "https://allgovernmentjobs.in/university-of-kalyani-recruitment-2025-apply-for-junior-research-fellow-post/34097",
      "source": "allgovernmentjobs.in",
      "description": "The University of Kalyani has declared the official notification for 2025. To fill up vacancies for Junior Research Fellow Jobs. Those candidates who have qualified in the B.E/B.Tech, M.Sc., and B.Pharm can grab this chance and apply for these posts. Here, we include the age limit, selection process, and salary structure, education details, application fee, and how to apply for the University of Kalyani Recruitment 2025 . Interested and eligible candidates can apply on or before the last date...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-13T23:42:27.522334",
      "links": []
    },
    {
      "id": "143d2178f07be151eb179e55ff74d5f9",
      "title": "PMC Recruitment 2025 - Apply Online for 169 Junior Engineer Posts",
      "url": "https://allgovernmentjobs.in/pmc-recruitment-2025-apply-online-for-169-junior-engineer-posts/34096",
      "source": "allgovernmentjobs.in",
      "description": "The Pune Municipal Corporation (PMC) has officially released the notification to fill the vacancies of 169 Junior Engineer Posts. Interested and eligible candidates can also apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, Diploma in Civil Engineering, can apply for the PMC Recruitment 2025. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process, application fee,...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "30-08-2025",
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-13T23:42:27.522359",
      "links": []
    },
    {
      "id": "69541ade7de37d0bf8742637c294a9e0",
      "title": "AAI Recruitment 2025 - Apply Online for 19 Apprentice Posts",
      "url": "https://allgovernmentjobs.in/aai-recruitment-2025-apply-online-for-19-apprentice-posts/34095",
      "source": "allgovernmentjobs.in",
      "description": "The Airport Authority of India (AAI) has officially released the notification to fill the vacancies of 19 Graduate Apprentice, Diploma Apprentice Posts. Interested and eligible candidates can also use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, Diploma in Mechanical, Civil, and Electrical  Engineering, can apply for the AAI Recruitment 2025. The interested applicants can apply in online mode. Here we have men...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "24-08-2025",
        "found_date": "08-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-13T23:42:27.522378",
      "links": []
    },
    {
      "id": "baec2f193070ed5fb25faf7f85e23a39",
      "title": "SCCL Recruitment 2025 - Apply Online for 33 General Medical Consultant Posts",
      "url": "https://allgovernmentjobs.in/sccl-recruitment-2025-apply-online-for-33-general-medical-consultant-posts/34094",
      "source": "allgovernmentjobs.in",
      "description": "The Singareni Collieries Company (SCCL) has released an official notification for 2025. To fill up the vacancies for 33 General Medical Consultant Jobs. Those candidates who have qualified in the MBBS, BDS, and MDS can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the SCCL Recruitment 2025 . Interested and eligible candidates can apply online through the website on or bef...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-13T23:42:27.522397",
      "links": []
    },
    {
      "id": "3f99175db81f2d4bf8294da0b26f46bf",
      "title": "Ministry of AYUSH",
      "url": "https://allgovernmentjobs.in/ministry-of-ayush-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "National Ayush Mission Kerala (NAM) has announced the official notification care 2025. To fill up the vacancies for 02&n .... The National Ayush Mission (NAM) Kerala has announced the official notification for 2025. To fill up the vacancies for&n .... The National Ayush Mission Kerala (NAM Kerala) has officially released the notification to fill 01 Multipurpose Health W .... The Ministry of Ayush has announced the official notification for 2025. To fill up the vacancies for 03 Data Entry .......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-13T23:42:27.522446",
      "links": []
    },
    {
      "id": "4264983919f246ed85dd920d7fa30704",
      "title": "IRCTC",
      "url": "https://allgovernmentjobs.in/irctc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Railway Catering and Tourism Corporation (IRCTC) has officially released the notification to fill the vacanci .... The Indian Railway Catering and Tourism Corporation (IRCTC) has officially released the notification to fill the vacanci .... The Indian Railway Catering and Tourism Corporation (IRCTC) has officially released the notification for 01 Consultant p ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-13T23:42:27.522475",
      "links": []
    },
    {
      "id": "95b20f829c0bbf63bab2937f685000d2",
      "title": "UP Police SI Sub Inspector 2025 Apply Online Form",
      "url": "https://www.rojgarresult.com/up-police-sub-inspector-si-03-2025/",
      "source": "www.rojgarresult.com",
      "description": "Uttar Pradesh Police Recruitment & Promotion Board UPPRPB Sub Inspector SI Recruitment 2025 Post Update Date: 12-08-2025 Short Description: Uttar Pradesh Police Recruitment & Promotion Board Sub Inspector SI Daroga Online Form 2025 : Uttar Pradesh Police Recruitment & Promotion Board UPPRPB Applications for Inspector / Sub Inspector Recruitment in Uttar Pradesh Police have started, male and female candidates can apply till 11 September 2025, candidates must read the notification for complete ...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "13/09/2025",
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-13T23:42:54.016081",
      "links": []
    },
    {
      "id": "b8093302a040d2b9531ad16db4a5be03",
      "title": "SSC GD Constable PET / PST Admit Card 2025",
      "url": "https://www.rojgarresult.com/ssc-constable-gd-admit-card/",
      "source": "www.rojgarresult.com",
      "description": "SSC Constable GD 2025 Admit Card for PET PST Exam Post Update Date: 12-08-2025 Short Details: SSC Constable GD Admit Card 2025: SSC Constable GD PET PST Admit Card 2025 will be released on the official website @https://ssc.gov.in/ and Exam Date is Schedule from 20/08/2025 onwards for SSC Constable GD Admit Card whose, candidates who applied for the job of SSC Constable GD Recruitment can download their admit card . More Other Vacancy / Jobs / Syllabus / Admit Card / Result / Answer Key / Sark...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-13T23:42:54.016109",
      "links": [
        "https://ssc.gov.in/"
      ]
    },
    {
      "id": "faeb70e6dda94fe124a20d8c5a843e8a",
      "title": "UPPSC GIC Lecturer 2025 Apply Online Form",
      "url": "https://www.rojgarresult.com/uppsc-lecturer-government-inter-college-2025/",
      "source": "www.rojgarresult.com",
      "description": "UPPSC Pravakta Govt Inter College GIC Lecturer Recruitment 2025: Apply for 1516 Post Post Date: 12-08-2025 Short Description: UPPSC Lecturer Government Inter College Recruitment 2025 Apply Online Form : UPPSC Pravakta Govt Inter College Online Form 2025, Notification has been released on the website @https://uppsc.up.nic.in/ & Application Form now started on 12 August 2025 to 12 September 2025. Uttar Pradesh Public Service Commission Jobs 2025. Get the direct link to download notification lin...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Hindi",
        "Mathematics",
        "English"
      ],
      "scraped_at": "2025-08-13T23:42:54.016175",
      "links": [
        "https://uppsc.up.nic.in/"
      ]
    },
    {
      "id": "f33797495cc2debbbae651b16aa797f4",
      "title": "Railway NTPC 10+2 Graduate Level Admit Card",
      "url": "https://www.rojgarresult.com/rrb-ntpc-inter-level-admit-card/",
      "source": "www.rojgarresult.com",
      "description": "Railway NTPC 10+2 Inter Level 2025 Check Exam City / Admit Card Post Update Date: 05-08-2025 Short Details: RRB NTPC Inter Level Exam Admit Card / Exam CIty 2025 : Railway Recruitment Board Recruitment 2025 had invited online applications for the RRB NTPC Inter Level 2025 exam for 3445 Post, in which many candidates had applied online till the last date and now soon Railway RRB NTPC Inter Level Admit Card 2025 will also be issued on Official Website @https://indianrailways.gov.in/, whose noti...",
      "pdf_link": null,
      "important_dates": {
        "exam_date": "07-08-2025",
        "found_date": "05-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-13T23:42:54.016233",
      "links": [
        "https://indianrailways.gov.in/,",
        "https://indianrailways.gov.in/"
      ]
    },
    {
      "id": "0bd3fb8c252dd8670955ad8815267bce",
      "title": "Army School AWES TGT PGT PRT Online Form 2025",
      "url": "https://www.rojgarresult.com/army-school-awes-tgt-pgt-prt/",
      "source": "www.rojgarresult.com",
      "description": "Army School AWES Recruitment 2025: Apply Online Form Post Update Date: 13-08-2025 Short Description: Army School AWES TGT PGT PRT Online Form 2025: Army Welfare Education Society has announced recruitment of Army School AWES TGT PGT PRT OST. Candidates who want to apply online can apply from the link given on Rojgar Result. Army School AWES TGT PGT PRT Online Form 2025 can be filled from 05 June 2025 to 16 August 2025. More Other Recruitment | Jobs Online Form | Vacancy Offline Form | Admissi...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-13T23:42:54.016361",
      "links": []
    },
    {
      "id": "00a52a8acaaadd5d76a6e43faac6a73c",
      "title": "Jharkhand SSC JSSC ANM JANMCE Online Form 2025",
      "url": "https://www.rojgarresult.com/jssc-anm-janmce-2025/",
      "source": "www.rojgarresult.com",
      "description": "JSSC Jharkhand Auxiliary Nurse Midwife Competitive Examination (JANMCE) Recruitment 2025 Apply Online for 3181 Post Post Date: 13-08-2025 Short Description: JSSC Jharkhand Auxiliary Nurse Midwife Competitive Examination (JANMCE) – 2025 Online Form  for 1373 Post: Jharkhand Staff Selection Commission JSSC Jharkhand Auxiliary Nurse Midwife Competitive Examination (JANMCE) – 2025 Official Notification is released and Online Form Now Started on 11 August 2025 to 10 September 2025 is Last Date for...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-13T23:42:54.016382",
      "links": []
    },
    {
      "id": "8b6c2960827cf55ecd7352f8806bb353",
      "title": "Bank of Maharashtra BOM Generalist Officer Online Form 2025",
      "url": "https://www.rojgarresult.com/bom-generalist-officer-aug2025/",
      "source": "www.rojgarresult.com",
      "description": "Bank of Maharashtra Generalist Officer Grade II Recruitment 2025 : Apply Online Form for 500 Post Post Update Date: 13-08-2025 Short Description: Bank of Maharashtra BOM Generalist Officer Grade 2 Online Form 2025 for 500 Post: Bank of Maharashtra Generalist Officer GO Official Notification is released and Online Form Now Started on 13 August 2025 to 30 August 2025 is Last Date for BOM Generalist Officer II Examination, Vacancy 2025 Full Notification available at the official website. All the...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "30/08/2025",
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-13T23:42:54.016401",
      "links": []
    },
    {
      "id": "06e907981d3e0692622cb42d207fa7c0",
      "title": "RPSC Various Post Recruitment 2025 for 12121 SI, TGT, PGT, Engineer Post",
      "url": "https://www.rojgarresult.com/rpsc-various-post-all-2025/",
      "source": "www.rojgarresult.com",
      "description": "Rajasthan Public Service Commission (RPSC) Recruitment 2025 Apply Online for 12121 Post Post Update Date: 13-08-2025 Short Description: RPSC Various Post Recruitment 2025 for 12121 Post: A massive recruitment drive has been announced in Rajasthan, with 12,121 different posts available across various departments. This includes 1,015 positions for Rajasthan Police Sub Inspector SI / Platoon Commander 2025 , 3,225 posts for School Lecturer (School Education) PGT Teacher , and a significant 6,500...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-13T23:42:54.016418",
      "links": []
    },
    {
      "id": "3a30b1b36d3e2583435f920e3aa040ed",
      "title": "RPSC Rajasthan Police SI, Platoon Commander Online Form 2025 for 1015 Post",
      "url": "https://www.rojgarresult.com/rpsc-rajasthan-police-si-platoon-commander-2025/",
      "source": "www.rojgarresult.com",
      "description": "RPSC SI Sub Inspector / Platoon Commander Recruitment 2025: Apply for 1015 Post Post Date: 13-08-2025 Short Description: RPSC SI, Platoon Commander Recruitment 2025 Apply Online Form : Rajasthan Public Service Commission RPSC SI / Platoon Commander Online Form 2025, Notification has been released on the website @https://rpsc.rajasthan.gov.in/ & Application Form now started on 10 August 2025 to 08 September 2025 for Total 1015 Post Rajasthan Public Service Commission Jobs 2025. Get the direct ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Hindi"
      ],
      "scraped_at": "2025-08-13T23:42:54.016443",
      "links": [
        "https://rpsc.rajasthan.gov.in/"
      ]
    },
    {
      "id": "e65787146fceae6f570ea3c810992207",
      "title": "MGU Kerala Recruitment 2025 - Apply Offline for Security Staff Post",
      "url": "https://allgovernmentjobs.in/mgu-kerala-recruitment-2025-apply-offline-for-security-staff-post/34137",
      "source": "allgovernmentjobs.in",
      "description": "Mahatma Gandhi University, Kerala (MGU Kerala) has declared the official notification for 2025. To fill up the vacancies for Security Staff Jobs. Those candidates who have qualified in the 10th Pass can grab this chance and apply for the MGU Kerala Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply on or before the last date of application. For...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-14T23:42:24.309326",
      "links": []
    },
    {
      "id": "6dd48c42b03ebc8581f0dd61f72dc6bf",
      "title": "Puducherry Police Recruitment 2025 - Apply Online for 218 Sub Inspector and Other Posts",
      "url": "https://allgovernmentjobs.in/puducherry-police-recruitment-2025-apply-online-for-218-sub-inspector-and-other-posts/34136",
      "source": "allgovernmentjobs.in",
      "description": "The Puducherry Police Department (Puducherry Police) has officially released the notification to fill the vacancies of 218 Sub Inspector, Police Constable Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Any Degree, and 12th can apply for the Puducherry Police Recruitment 2025 . The interested applicants can apply in online mode. Here we have mentioned the education details, age...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "12-09-2025",
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Analyst"
      ],
      "scraped_at": "2025-08-14T23:42:24.309353",
      "links": []
    },
    {
      "id": "13ad13e1fca87bfccf0078daf42d260d",
      "title": "RRB Recruitment 2025 - Apply Online for 272 Nursing Superintendent Posts",
      "url": "https://allgovernmentjobs.in/rrb-recruitment-2025-apply-online-for-272-nursing-superintendent-posts/34135",
      "source": "allgovernmentjobs.in",
      "description": "The Railway Recruitment Board (RRB) has officially released the notification to fill the vacancies of 272 Nursing Superintendent Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their GNM, B.Sc Nursing can apply for the RRB Recruitment 2025 . The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process, application fee,...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "08-09-2025",
        "found_date": "09-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-14T23:42:24.309376",
      "links": []
    },
    {
      "id": "1507f0e704fd38a24265ad1e11f5b0aa",
      "title": "CGCRI Recruitment 2025 - Apply Offline for Project Associate Post",
      "url": "https://allgovernmentjobs.in/cgcri-recruitment-2025-apply-offline-for-project-associate-post/34134",
      "source": "allgovernmentjobs.in",
      "description": "Central Glass and Ceramic Research Institute (CGCRI) has announced the official notification for 2025. To fill up the vacancies for Project Associate Jobs. Those candidates who have qualified in the M.Sc., B.E/ B.Tech can grab this chance and apply for the CGCRI Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and apply for these posts. Interested and eligible candidates can apply on or before the last date of applicati...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "04-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Analyst"
      ],
      "scraped_at": "2025-08-14T23:42:24.309395",
      "links": []
    },
    {
      "id": "78295873ce97753ebf4554a0fe3c1f23",
      "title": "MITRA Recruitment 2025 - Apply Online for Environment and Forestry Specialist Posts",
      "url": "https://allgovernmentjobs.in/mitra-recruitment-2025-apply-online-for-environment-and-forestry-specialist-posts/34133",
      "source": "allgovernmentjobs.in",
      "description": "The Maharashtra Institution for Transformation (MITRA) has officially released the notification to fill the vacancies of 01 Environment and Forestry Specialist Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Post-graduation or diploma can apply for the MITRA Recruitment 2025 . The interested applicants can apply in online mode. Here we have mentioned the education details, age ...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "25-08-2025",
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-14T23:42:24.309415",
      "links": []
    },
    {
      "id": "d02e9c9c76889b85707d1b0f6f7c65b7",
      "title": "NABARD Recruitment 2025 - Apply Online for 05 Legal Officer and Other posts",
      "url": "https://allgovernmentjobs.in/nabard-recruitment-2025-apply-online-for-05-legal-officer-and-other-posts/34132",
      "source": "allgovernmentjobs.in",
      "description": "The National Bank for Agriculture and Rural Development (NABARD) has announced the official notification for 2025. To fill up the vacancies for 05 Legal Officers, GIS Analyst, and Software Developers Jobs. Those candidates who have qualified in Any Degree, LLB, B.E/ B.Tech, M.E/ M.Tech can grab this chance and apply for these posts. Interested and eligible candidates can apply online through the website on or before the last date of application. Here, we mentioned the age limit, selection pro...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Analyst"
      ],
      "scraped_at": "2025-08-14T23:42:24.309433",
      "links": []
    },
    {
      "id": "5db0295bd09e993761b4e99178f2df90",
      "title": "THSTI Recruitment 2025 - Apply Online for Consultant Post",
      "url": "https://allgovernmentjobs.in/thsti-recruitment-2025-apply-online-for-consultant-post/34130",
      "source": "allgovernmentjobs.in",
      "description": "The Translational Health Science and Technology Institute (THSTI) has announced the latest job notification for 2025. To fill up the vacancies for a Consultant - Quality Assurance Position. Those candidates who have qualified in the MBBS, BDS, BHMS, BAMS, BVSc, and M.Sc can grab this chance and apply for the THSTI Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-14T23:42:24.309470",
      "links": []
    },
    {
      "id": "1a5c1fe18011be2d3bd55d52ec0367a3",
      "title": "RVNL Recruitment 2025 - Apply Offline for Chief Project Manager Posts",
      "url": "https://allgovernmentjobs.in/rvnl-recruitment-2025-apply-offline-for-chief-project-manager-posts/34129",
      "source": "allgovernmentjobs.in",
      "description": "The Rail Vikas Nigam Limited (RVNL) has officially released the notification to fill the vacancies of 01 Chief Project Manager Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Civil Engineering can apply for the RVNL Recruitment 2025 . The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, selection process, ...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "12-09-2025",
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Analyst"
      ],
      "scraped_at": "2025-08-14T23:42:24.309487",
      "links": []
    },
    {
      "id": "774a950b988ccff08936830d21ccce0c",
      "title": "ANGRAU Recruitment 2025 - Walk-in-Interview for Research Associate Post",
      "url": "https://allgovernmentjobs.in/angrau-recruitment-2025-walk-in-interview-for-research-associate-post/34128",
      "source": "allgovernmentjobs.in",
      "description": "Acharya NG Ranga Agricultural University (ANGRAU) has announced the official notification for 2025. To fill up the vacancies for Research Associate Jobs. Those candidates who have qualified in the M.Sc., Ph.D can grab this chance and apply for the ANGRAU Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can attend the interview at the address given belo...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "22-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-14T23:42:24.309506",
      "links": []
    },
    {
      "id": "b7d4ffc74b6ba552028ed885740192c9",
      "title": "Kerala PSC",
      "url": "https://allgovernmentjobs.in/kerala-psc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Mahatma Gandhi University, Kerala (MGU Kerala) has declared the official notification for 2025. To fill up the vaca .... The Kerala Veterinary and Animal Sciences University (KVASU) has released the notification for 2025. To fill up the vaca .... The Kerala Veterinary and Animal Science University (KVASU) has announced the official Notification for 2025. Allotted 0 .... The Kerala Veterinary and Animal Science University (KVASU) has announced the official Notification for 2025. Allotted 0 ......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-14T23:42:24.309533",
      "links": []
    },
    {
      "id": "f57d62b5f801d77b91a82a76f5ff2703",
      "title": "PWD Puducherry",
      "url": "https://allgovernmentjobs.in/pwd-puducherry-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Puducherry Police Department (Puducherry Police) has officially released the notification to fill the vacancies of 2 .... The Puducherry Department of  Revenue and Disaster Management (DRDM) has recently published the Notification for 20 ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-14T23:42:24.309558",
      "links": []
    },
    {
      "id": "19ccf688b487df63ff2b823dc1df1c08",
      "title": "THSTI",
      "url": "https://allgovernmentjobs.in/thsti-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Translational Health Science and Technology Institute (THSTI) has announced the latest job notification for 202 .... The Translational Health Science and Technology Institute (THSTI) has announced the official notification for 2025. To f .... The Translational Health Science and Technology Institute (THSTI) has officially released the notification to fill the v .... The Translational Health Science and Technology (THSTI) has officially released the notification for 2025. To fill up th ......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2025-08-14T23:42:24.309609",
      "links": []
    },
    {
      "id": "b4d2d42d7baa7b13dce774da276e4a93",
      "title": "DSSSB Delhi High Court Court Attendant Online Form 2025 for 334 Post",
      "url": "https://www.rojgarresult.com/dsssb-delhi-high-court-03-2025/",
      "source": "www.rojgarresult.com",
      "description": "DSSSB Delhi High Court DHC Various Post Advt No 03/2025 Various Post Recruitment 2025: Apply Online for 334 Post Post Update Date: 14-08-2025 Short Description: DSSSB Various Post Online Form 2025 | Advt No 03/2025 : Delhi Subordinate Service Selection Board (DSSSB) Delhi High Court DHC Official Notification is released and Online Form Now Started on 26 August 2025 to 24 September 2025 is Last Date for Upcoming DSSSB Advt No 03/2025 Examination, Vacancy 2025 Full Notification available at the...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "24/09/2025",
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-14T23:42:49.210199",
      "links": []
    },
    {
      "id": "57f43d22799a34964f30417d6a2ec9f6",
      "title": "Bihar SHS ANM Online Form 2025 for 5006 Post",
      "url": "https://www.rojgarresult.com/bihar-shs-anm-2025/",
      "source": "www.rojgarresult.com",
      "description": "Bihar Swastha Vibhag ANM Recruitment 2025: Apply for 5006 Post Post Date: 14-08-2025 Short Description: Bihar SHS ANM Recruitment 2025 Apply Online Form : Bihar Swastha Vibhag SHS ANM Online Form 2025, Notification has been released on the website @https://shs.bihar.gov.in/ & Application Form now started on 14 August 2025 to 28 August 2025 for Total 5006 Post Bihar State Health Society Jobs 2025. Get the direct link to download notification link available on Bihar SHS ANM Vacancy 2025 Officia...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-14T23:42:49.210222",
      "links": [
        "https://shs.bihar.gov.in/"
      ]
    },
    {
      "id": "be93735a03a9d5ac5a284f10a1617ad0",
      "title": "Central Railway RRC CR Apprentices Online Form 2025",
      "url": "https://www.rojgarresult.com/rrc-cr-apprentices-august-2025/",
      "source": "www.rojgarresult.com",
      "description": "RRC Railway Central Railway Apprentice Recruitment 2025: Apply for 2379 Post Post Date: 14-08-2025 Short Description: Railway RRC CR Apprentice Recruitment 2025 Apply Online Form : Railway Recruitment Cell Railway RRC CR Apprentice Online Form 2025, Notification has been released on the website @https://cr.indianrailways.gov.in/ & Application Form now started on 12 August 2025 to 11 September 2025 for Total 2379 Post Railway Recruitment Cell Jobs 2025. Get the direct link to download notifica...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [
        "English",
        "Hindi"
      ],
      "scraped_at": "2025-08-14T23:42:49.210242",
      "links": [
        "https://cr.indianrailways.gov.in/"
      ]
    },
    {
      "id": "b873b9b60fabf721215fcc052c75237f",
      "title": "IIT BHU Recruitment 2025 - Apply for Project Scientist Post",
      "url": "https://allgovernmentjobs.in/iit-bhu-recruitment-2025-apply-for-project-scientist-post/34168",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology Varanasi (IIT BHU) has announced the official notification for 2025. To fill up the vacancies for Project Scientist posts. Those candidates who have qualified for a Ph.D. can grab this chance and apply for the IIT BHU Recruitment 2025 . Here, we mentioned the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply on or before the last date of application. ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "11-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-16T23:40:48.613918",
      "links": []
    },
    {
      "id": "22a701ee1f4e8813c46753676fe187b7",
      "title": "RITES Recruitment 2025 - Apply Online for 06 Deputy General Manager and Other Posts",
      "url": "https://allgovernmentjobs.in/rites-recruitment-2025-apply-online-for-06-deputy-general-manager-and-other-posts/34167",
      "source": "allgovernmentjobs.in",
      "description": "The Rail India Technical and Economic Services (RITES) has officially released the notification to fill the vacancies of 06 Deputy General Manager, Group General Manager Jobs. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, M.E./M. Tech in Mechanical Engineering can apply for the RITES Recruitment 2025 . The interested applicants can apply in online mode. Here we have me...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "28-09-2025",
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-16T23:40:48.613945",
      "links": []
    },
    {
      "id": "cf75a30d14d6b07b62a8aeb569bba656",
      "title": "IHBT Recruitment 2025 - Walk-in-Interview for 20 Project Associate and Other Posts",
      "url": "https://allgovernmentjobs.in/ihbt-recruitment-2025-walk-in-interview-for-20-project-associate-and-other-posts/34166",
      "source": "allgovernmentjobs.in",
      "description": "Institute of Himalayan Bioresource Technology (IHBT) has announced the official notification for 2025. To fill up the vacancies for 20 Project Associates and Project Assistant Jobs. Those candidates who have qualified in the M.Sc, B.Sc, and M.Pharm can grab this chance and apply for these posts. Here, we include the age limit, selection process, and salary structure, education details, application fee, and how to apply for the IHBT Recruitment 2025 . Interested and eligible candidates can att...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "21-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-16T23:40:48.613989",
      "links": []
    },
    {
      "id": "ebdb28a1344a73e4453b70470cbc269f",
      "title": "NCBS Recruitment 2025 - Apply Online for Administrative Assistant Posts",
      "url": "https://allgovernmentjobs.in/ncbs-recruitment-2025-apply-online-for-administrative-assistant-posts/34165",
      "source": "allgovernmentjobs.in",
      "description": "The National Centre for Biological Sciences (NCBS) has officially released the notification to fill the vacancies of 01 Administrative Assistant Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Any Degree, CA can apply for the NCBS Recruitment 2025 . The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process, ap...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "31-08-2025",
        "found_date": "21-07-2025"
      },
      "category": "Banking",
      "skills": [
        "Analyst"
      ],
      "scraped_at": "2025-08-16T23:40:48.614009",
      "links": []
    },
    {
      "id": "0f38fcd9f7bd61e96b590cd6a56a0691",
      "title": "NIPER Recruitment 2025 - Apply for 02 Project Research Scientist Post",
      "url": "https://allgovernmentjobs.in/niper-recruitment-2025-apply-for-02-project-research-scientist-post/34164",
      "source": "allgovernmentjobs.in",
      "description": "National Institute of Pharmaceutical Education and Research Ahmedabad (NIPER) has declared the latest job notification fr 2025. To fill up the vacancies for 02 Project Research Scientist Jobs. Those candidates who have qualified in the M.Sc., Ph.D can grab this chance and apply for the NIPER Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can fill out...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "15-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-16T23:40:48.614029",
      "links": []
    },
    {
      "id": "0e152491eb493be769d167f936edd976",
      "title": "PGIMER Recruitment 2025 - Apply Online for Project Research Scientist Post",
      "url": "https://allgovernmentjobs.in/pgimer-recruitment-2025-apply-online-for-project-research-scientist-post/34162",
      "source": "allgovernmentjobs.in",
      "description": "Post Graduate Institute of Medical Education and Research, Chandigarh (PGIMER) has announced the official notification for 2025. To fill up the vacancies for Project Research Scientist Jobs. Those candidates who have qualified in the MBBS, BDS, and MVSc can grab this chance and apply for the PGIMER Recruitment 2025 . Here we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-16T23:40:48.614081",
      "links": []
    },
    {
      "id": "0ce6209f8e864965dc06168b134474c8",
      "title": "BMRCL Recruitment 2025 - Apply Online for 05 Axpert Developer Posts",
      "url": "https://allgovernmentjobs.in/bmrcl-recruitment-2025-apply-online-for-05-axpert-developer-posts/34161",
      "source": "allgovernmentjobs.in",
      "description": "The Bangalore Metro Rail Corporation Limited (BMRCL) has officially released the notification to fill the vacancies of 05 Axpert Developer Posts. Interested and eligible candidates can also use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, B.Sc., can apply for the BMRCL Recruitment 2025 . The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection proce...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "08-09-2025",
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-16T23:40:48.614103",
      "links": []
    },
    {
      "id": "fe723edb4e1462378021eb5f1e74c7b5",
      "title": "GIPMER Recruitment 2025 - Walk-in-Interview for 22 Senior Resident Posts",
      "url": "https://allgovernmentjobs.in/gipmer-recruitment-2025-walk-in-interview-for-22-senior-resident-posts/34160",
      "source": "allgovernmentjobs.in",
      "description": "Govind Ballabh Pant Institute of Postgraduate Medical Education and Research (GIPMER) has declared the latest job notification for 2025. To fill up the vacancies for 22 Senior Resident Jobs. Those candidates who have qualified in the MBBS, Post-Graduation, and Diploma can grab this chance and apply for the GIPMER Recruitment 2025 . Interested and eligible candidates can attend the interview at the address given below. Here, we mentioned the age limit, selection process, salary structure, educ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "22-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-16T23:40:48.614129",
      "links": []
    },
    {
      "id": "dde74b164437063db8eaece5f50dabca",
      "title": "NIPER",
      "url": "https://allgovernmentjobs.in/niper-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "National Institute of Pharmaceutical Education and Research Ahmedabad (NIPER) has declared the latest job notification f .... Delhi Pharmaceutical Sciences and Research University (DPSRU) has announced the official notification for 2025. To fill .... National Institute of Pharmaceutical Education and Research (NIPER Ahmedabad) has declared the official notification for .... The National Institute of Pharmaceutical Education and Research (NIPER) Guwahati has announced the official notification...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Teaching",
      "skills": [],
      "scraped_at": "2025-08-16T23:40:48.614184",
      "links": []
    },
    {
      "id": "79b91ffa0518a23115dba81f836157ac",
      "title": "BMRCL",
      "url": "https://allgovernmentjobs.in/bmrcl-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Bangalore Metro Rail Corporation Limited (BMRCL) has officially released the notification to fill the vacancies of 0 .... The Bangalore Metro Rail Corporation Limited (BMRCL) has declared the official notification for 2025. To fill up the vac .... The Bangalore Metro Rail Corporation Limited (BMRCL) has officially released the notification for 07 General Manager and ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-16T23:40:48.614228",
      "links": []
    },
    {
      "id": "4e054a5c993833c96e09f96ace660452",
      "title": "IIT Madras Recruitment 2025 - Apply Online for Junior Research Fellow Jobs",
      "url": "https://allgovernmentjobs.in/iit-madras-recruitment-2025-apply-online-for-junior-research-fellow-jobs/34202",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology Madras (IIT Madras) has declared the official notification for 2025. To fill up the vacancies for Junior Research Fellow Jobs. Those candidates who have qualified in the B.E/ B.Tech., M.E/ M.Tech. in Civil Engineering can grab this chance and apply for the IIT Madras Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates ca...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066010",
      "links": []
    },
    {
      "id": "f9f25595f1c3e168f52f5547c6b67123",
      "title": "WAPCOS Recruitment 2025 - Apply Offline for 04 Junior Assistant Posts",
      "url": "https://allgovernmentjobs.in/wapcos-recruitment-2025-apply-offline-for-04-junior-assistant-posts/34201",
      "source": "allgovernmentjobs.in",
      "description": "The Water Resources, Power, and Infrastructure Sectors (WAPCOS) has officially released the notification to fill the vacancies of 04 Junior Assistant Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed Any Degree can apply for the WAPCOS Recruitment 2025. The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, selection process, appli...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "27-08-2025",
        "found_date": "11-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066038",
      "links": []
    },
    {
      "id": "b29c853a43dc33eaa1b37fe698376b43",
      "title": "IIT Ropar Recruitment 2025 - Apply Online for Junior Research Fellow Post",
      "url": "https://allgovernmentjobs.in/iit-ropar-recruitment-2025-apply-online-for-junior-research-fellow-post/34200",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology of Ropar (IIT Ropar) has announced the official notification for 2025. To fill up the vacancies for Junior Research Fellow Jobs. Those candidates who have qualified in the B.E/ B.Tech., M.E/ M.Tech. can grab this chance and apply for the IIT Ropar Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply on or before...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066058",
      "links": []
    },
    {
      "id": "2cc543ee14f340a4ee76db3080dfc986",
      "title": "NIELIT Recruitment 2025 - Apply Offline for 02 Lab Engineer Posts",
      "url": "https://allgovernmentjobs.in/nielit-recruitment-2025-apply-offline-for-02-lab-engineer-posts/34199",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Electronics and Information Technology (NIELIT) has officially released the notification to fill the vacancies of 02 Lab Engineer Jobs. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Electrical, Electronics, and Computer Science Engineering can apply for the NIELIT Recruitment 2025 . The interested applicants can apply in offline mode. Here w...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "22-08-2025",
        "found_date": "18-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066092",
      "links": []
    },
    {
      "id": "dbeefecbdd2e025b194d77acccb6b303",
      "title": "IIT Gandhinagar Recruitment 2025 - Apply Online for 03 IT Engineer Posts",
      "url": "https://allgovernmentjobs.in/iit-gandhinagar-recruitment-2025-apply-online-for-03-it-engineer-posts/34198",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology Gandhinagar (IIT Gandhinagar) has declared the latest job notification for 2025. To fill up the vacancies for 03 IT Engineer Jobs. Those candidates who have qualified in the B.E/ B.Tech, M.Sc, MCA, 0th Pass, 12th can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the IIT Gandhinagar Recruitment 2025 . Interested and eligible candidates ca...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "18-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-18T23:41:03.066112",
      "links": []
    },
    {
      "id": "6f710ca025b101b760bcdba1c5289d2e",
      "title": "NCRTC Recruitment 2025 - Apply Online for Assistant Manager Post",
      "url": "https://allgovernmentjobs.in/ncrtc-recruitment-2025-apply-online-for-assistant-manager-post/34197",
      "source": "allgovernmentjobs.in",
      "description": "The National Capital Region Transport Corporation (NCRTC) has released the official notification for 2025. To fill up the vacancies for Assistant Manager Jobs. Those candidates who have qualified in the Diploma in Electrical Engineering can grab this chance and apply for the NCRTC Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply online throug...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-18T23:41:03.066131",
      "links": []
    },
    {
      "id": "dc8120f04ca34bf7d8e5a695ac7916dd",
      "title": "RailTel Recruitment 2025 - Apply Offline for Executive Posts",
      "url": "https://allgovernmentjobs.in/railtel-recruitment-2025-apply-offline-for-executive-posts/34196",
      "source": "allgovernmentjobs.in",
      "description": "The RailTel Corporation of India Limited (RailTel) has officially released the notification to fill the vacancies of 01 Executive Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Electrical, Electronics Engineering, M.Sc., MCA can apply for the RailTel Recruitment 2025 . The interested applicants can apply in offline mode. Here we have mentioned the education det...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "04-09-2025",
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066156",
      "links": []
    },
    {
      "id": "dfde5d7cbebb56ddf29180b13cb0dffe",
      "title": "IIT Dhanbad Recruitment 2025 - Apply Online for Senior Research Fellow Post",
      "url": "https://allgovernmentjobs.in/iit-dhanbad-recruitment-2025-apply-online-for-senior-research-fellow-post/34195",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology (IIT) Dhanbad has declared the official notification for 2025. To fill up the vacancies for Senior Research Fellow Jobs. Those candidates who have qualified in the B.E/ B.Tech., M.E/ M.Tech. can apply for the IIT Dhanbad Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply on or before the last date of applicati...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "11-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066175",
      "links": []
    },
    {
      "id": "f3326b5acb4b7f50e2f3dbeba5def83c",
      "title": "Repco Bank Recruitment 2025 - Apply Online for 30 Customer Service Associate/ Clerk Posts",
      "url": "https://allgovernmentjobs.in/repco-bank-recruitment-2025-apply-online-for-30-customer-service-associate-clerk-posts/34194",
      "source": "allgovernmentjobs.in",
      "description": "The Repco Bank has officially released the notification to fill the vacancies of 30 Customer Service Associate/ Clerk Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed Any Degree can apply for the Repco Bank Recruitment 2025. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process, application fee, salary, and how t...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "08-09-2025",
        "found_date": "18-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066195",
      "links": []
    },
    {
      "id": "4dc11f0c911b332cf85394d603e8081c",
      "title": "Indian Air Force",
      "url": "https://allgovernmentjobs.in/indian-air-force-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Air Force has officially released the notification to fill the vacancies of 01 Agniveervayu Posts. Interested .... The Indian Air Force (IAF) has officially released the online applications to fill up these 01 Airmen Group Y Medic ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066219",
      "links": []
    },
    {
      "id": "62cb4d3b61a384dca088554dd7b14594",
      "title": "IIT Ropar",
      "url": "https://allgovernmentjobs.in/iit-ropar-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology of Ropar (IIT Ropar) has announced the official notification for 2025. To fill up the .... The Indian Institute of Technology of Ropar (IIT Ropar) has officially released the notification for 31 Deputy .... The Indian Institute of Technology (IIT) Ropar has officially released the Notification for 2025. Allotted Vacancie ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066259",
      "links": []
    },
    {
      "id": "f258b377e0fe4585b34c8433f5605c19",
      "title": "NIELIT",
      "url": "https://allgovernmentjobs.in/nielit-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Electronics and Information Technology (NIELIT) has officially released the notification to fi ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066281",
      "links": []
    },
    {
      "id": "754099e2e3e530b794337aba3897ee57",
      "title": "IIT Gandhinagar",
      "url": "https://allgovernmentjobs.in/iit-gandhinagar-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology Gandhinagar (IIT Gandhinagar) has declared the latest job notification for 2025. .... The Indian Institute of Technology (IIT) Gandhinagar has announced the official notification for 2025. To fill up the va .... The Indian Institute of Technology Gandhinagar (IIT Gandhinagar) has officially released the notification to fill the va .... The Indian Institute of Technology (IIT Gandhinagar) has announced the official notification for 2025. To fi up the vaca ......",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066303",
      "links": []
    },
    {
      "id": "f4320ca3f06879933fd5f54ffcf03b37",
      "title": "RAILTEL",
      "url": "https://allgovernmentjobs.in/railtel-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The RailTel Corporation of India Limited (RailTel) has officially released the notification to fill the vacancies of 01 .... The RailTel Corporation of India (RailTel) has officially released the notification for 06 Engineer Posts. Int ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066324",
      "links": []
    },
    {
      "id": "94eea0885662ed2bc48660b61963f413",
      "title": "NCRTC",
      "url": "https://allgovernmentjobs.in/ncrtc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Capital Region Transport Corporation (NCRTC) has released the official notification for 2025. To fill up th .... The National Capital Region Transport Corporation (NCRTC) is accepting Online applications for 01 Group General Manager/ ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066342",
      "links": []
    },
    {
      "id": "c451c6e55c0045ea8ccdd4fc599780e5",
      "title": "Repco Bank",
      "url": "https://allgovernmentjobs.in/repco-bank-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Repco Bank has officially released the notification to fill the vacancies of 30 Customer Service Associate/ Clerk Po ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-18T23:41:03.066361",
      "links": []
    },
    {
      "id": "51ed83060e37bb19795a1e4497c6d23d",
      "title": "NIT Patna Recruitment 2025 - Apply Offline for Junior Research Fellow Post",
      "url": "https://allgovernmentjobs.in/nit-patna-recruitment-2025-apply-offline-for-junior-research-fellow-post/34209",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technology (NIT) Patna has announced the official notification for 2025. To fill up the vacancies for Junior Research Fellow Jobs. Those candidates who have qualified in the B.E/ B.Tech., M.E/M. Tech. in Electronics and Communication Engineering can apply for the NIT Patna Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible aspirants can ap...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "15-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-19T23:40:46.282709",
      "links": []
    },
    {
      "id": "2cdab436742e8aeb364c610ea99f3149",
      "title": "BDL Recruitment 2025 - Apply Offline for General Manager Post",
      "url": "https://allgovernmentjobs.in/bdl-recruitment-2025-apply-offline-for-general-manager-post/34208",
      "source": "allgovernmentjobs.in",
      "description": "The Bharat Dynamic Limited (BDL) has announced the official notification for 2025. To fill up the vacancies for General Manager Jobs. Those candidates who have qualified in the B.E/ B.Tech. in Mechanical Engineering, Electrical Engineering can grab this chance and apply for the BDL Recruitment 2025 . Here we mentioned the age limit, selection process, and salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can fill out the...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "18-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-19T23:40:46.282736",
      "links": []
    },
    {
      "id": "0521dd2653e0cc3b58340394babaebfe",
      "title": "NEIST Recruitment 2025 - Apply Offline for Doctor Post",
      "url": "https://allgovernmentjobs.in/neist-recruitment-2025-apply-offline-for-doctor-post/34207",
      "source": "allgovernmentjobs.in",
      "description": "North East Institute of Science and Technology, Jorhat (NEIST) has announced the official notification for 2025. To fill up the vacancies for Doctor Jobs. Those candidates who have qualified in the MBBS can grab this chance and apply for the NEIST Recruitment 2025 . Here we mentioned the age limit, selection process, and salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can fill out the application form on or before the ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-19T23:40:46.282758",
      "links": []
    },
    {
      "id": "37474d637bf6ae3ee9826a89384e22a3",
      "title": "DHS Ranipet Recruitment 2025 - Apply Offline for 40 Staff Nurse Pharmacist and Other Posts",
      "url": "https://allgovernmentjobs.in/dhs-ranipet-recruitment-2025-apply-offline-for-40-staff-nurse-pharmacist-and-other-posts/34206",
      "source": "allgovernmentjobs.in",
      "description": "The District Health Society Ranipet (DHS Ranipet) has declared the latest job notification for 2025. To fill up the vacancies for 40 Staff Nurses, Lab Technicians, Pharmacists, Health Inspectors, and Multi-Purpose Hospital Workers. Those candidates who have qualified in the B.Pharm, B.Sc Nursing, Diploma, 12th, GNM, 8th, and D.Pharm can grab this chance and apply for the DHS Ranipet Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, appli...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "18-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-19T23:40:46.282810",
      "links": []
    },
    {
      "id": "aeda2e0acf281f9c60364dfa1414fc91",
      "title": "Lucknow University Recruitment 2025 - Walk-in-Interview for 05 Subject Expert Posts",
      "url": "https://allgovernmentjobs.in/lucknow-university-recruitment-2025-walk-in-interview-for-05-subject-expert-posts/34205",
      "source": "allgovernmentjobs.in",
      "description": "University of Lucknow has declared the official notification fr 2025. To fill up the vacancies for 05 Subject Experts Jobs. Those candidates who have qualified in the M.Sc., M.Pharm., and Post-Graduation can grab this chance and apply for these posts. Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the Lucknow University Recruitment 2025 . Interested and eligible candidates can attend the interview at the given venu...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "23-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-19T23:40:46.282831",
      "links": []
    },
    {
      "id": "863c3d7442f55badc5b74eabcb615b94",
      "title": "THSTI Recruitment 2025 - Apply Online for 02 Team Lead Clinic Science and Other Posts",
      "url": "https://allgovernmentjobs.in/thsti-recruitment-2025-apply-online-for-02-team-lead-clinic-science-and-other-posts/34204",
      "source": "allgovernmentjobs.in",
      "description": "The Translational Health Science and Technology Institute (THSTI) has announced the latest job notification for 2025. To fill up the vacancies for 02 Team Lead Clinical Science and Administrator Positions. Those candidates who have qualified in the MD, MDS, BDS, BAMS, BHMS, and CA can grab this chance and apply for the THSTI Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested an...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "01-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-19T23:40:46.282850",
      "links": []
    },
    {
      "id": "8a3fee22bd9c4429ef54e28907f94363",
      "title": "NIT Patna",
      "url": "https://allgovernmentjobs.in/nit-patna-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technology (NIT) Patna has announced the official notification for 2025. To fill up the vacanc .... The National Institute of Technology (NIT) Patna has announced the official notification for 2025. To fill up the vacanc ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-19T23:40:46.282926",
      "links": []
    },
    {
      "id": "d1ed54fa3c01032fb045d955f41eb011",
      "title": "University of Lucknow",
      "url": "https://allgovernmentjobs.in/university-of-lucknow-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "University of Lucknow has declared the official notification fr 2025. To fill up the vacancies for 05 Subject Exper .... The University of Lucknow has officially released the notification for 2025. To fill up the vacancies for Research ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2025-08-19T23:40:46.282973",
      "links": []
    },
    {
      "id": "cea20e9995ccd4f58e66d43069d95e5b",
      "title": "RPSC Senior Teacher Grade II TGT Online Form 2025 for 6500 Post",
      "url": "https://www.rojgarresult.com/rpsc-senior-teacher-2025/",
      "source": "www.rojgarresult.com",
      "description": "RPSC Senior Teacher 2nd Grade TGT Recruitment 2025: Apply for 6500 Post Post Date: 19-08-2025 Short Description: RPSC Senior Teacher Recruitment 2025 Apply Online Form : Rajasthan Public Service Commission RPSC 2nd Grade Senior Teacher Online Form 2025, Notification has been released on the website @https://rpsc.rajasthan.gov.in/ & Application Form now started on 19 August 2025 to 17 September 2025 for Total 6500 Post Rajasthan Public Service Commission Jobs 2025. Get the direct link to downl...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "19-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Mathematics",
        "Hindi",
        "English"
      ],
      "scraped_at": "2025-08-19T23:41:05.197728",
      "links": [
        "https://rpsc.rajasthan.gov.in/"
      ]
    },
    {
      "id": "3da0ba8a9e3ebb7c1f863853574ef2d0",
      "title": "BSF Head Constable Radio RO / RM Online Form 2025 for 1121 Post",
      "url": "https://www.rojgarresult.com/bsf-hc-ro-rm-august25/",
      "source": "www.rojgarresult.com",
      "description": "Border Security Force BSF Head Constable Radio Operator RO / Radio Mechanic RM Recruitment 2025: Apply Online for 1121 Post Post Update Date: 18-08-2025 Short Description: Border Security Force BSF HC RO / RM (Male & Female) Recruitment 2025  : BSF Head Constable Radio Exam Notification is released and Online Form Now Started on 24 August 2025 to 23 September 2025 is Last Date for BSF Head  Constable Recruitment 2025 Examination, Vacancy 2025 Full Notification available at the official websit...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "23/09/2025",
        "found_date": "18-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2025-08-19T23:41:05.197766",
      "links": []
    },
    {
      "id": "3e523799bfd7d27b9e0305880ef96207",
      "title": "NIAB Recruitment 2025 - Apply Online for 14 Technical Assistant, Young Professional and Other Posts",
      "url": "https://allgovernmentjobs.in/niab-recruitment-2025-apply-online-for-14-technical-assistant-young-professional-and-other-posts/34214",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Animal Biotechnology (NIAB) has announced the official notification for 2025. To fill up the 14 vacancies for Technical Assistant, Young Professional, and Project Research Scientist Jobs. Those candidates who have qualified in the B.Pharm, B.Sc, M.Pharm, M.Sc, MVSc, M.Phil/ Ph.D can grab this chance and apply for the NIAB Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-20T23:40:15.456934",
      "links": []
    },
    {
      "id": "3544a699495800e700b3ef809bd7e32d",
      "title": "KSCCF Recruitment 2025 - Apply Online for 34 Sales Assistant, Pharmacist Posts",
      "url": "https://allgovernmentjobs.in/ksccf-recruitment-2025-apply-online-for-34-sales-assistant-pharmacist-posts/34213",
      "source": "allgovernmentjobs.in",
      "description": "The Karnataka State Cooperative Consumer Federation Limited (KSCCF) has officially released the notification to fill the vacancies of 34 Pharmacist, First Division Assistant, and Sales Assistant Jobs. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Any Degree, D. Pharm, and 12th can apply for the KSCCF Recruitment 2025 . The interested applicants can apply in online mode. Here we have...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "14-09-2025",
        "found_date": "16-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-20T23:40:15.456963",
      "links": []
    },
    {
      "id": "aad5971bce105bd981ccbf54098c0f4d",
      "title": "AIIMS Rishikesh Recruitment 2025 - Apply for 02 Project Research Scientist and Other Posts",
      "url": "https://allgovernmentjobs.in/aiims-rishikesh-recruitment-2025-apply-for-02-project-research-scientist-and-other-posts/34212",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences Rishikesh (AIIMS Rishikesh) has released the latest job notification for 2025. To fill up the vacancies for 02 Project Research Scientists and Project Technical Support Jobs. Those candidates who have qualified in the MBBS, MVSc, BDS, BAMS, Post Graduation, Diplome, Ph.D can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the AIIMS Ri...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-20T23:40:15.456987",
      "links": []
    },
    {
      "id": "1fd1532dd5623385bafbcb6998705bde",
      "title": "PGIMER Recruitment 2025 - Apply Offline for Project Nurse Posts",
      "url": "https://allgovernmentjobs.in/pgimer-recruitment-2025-apply-offline-for-project-nurse-posts/34211",
      "source": "allgovernmentjobs.in",
      "description": "Post Graduate Institute of Medical Education and Research, Chandigarh (PGIMER Chandigarh) has announced the official notification for 2025. To fill up the vacancies for Project Nurse Jobs. Those candidates who have qualified in the GNM can grab this chance and apply for the PGIMER Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply on or before ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "18-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-20T23:40:15.457006",
      "links": []
    },
    {
      "id": "2a255289b43441a8856a433ce03f1ca7",
      "title": "IISc Recruitment 2025 - Apply Online for 04 Program Assistant Posts",
      "url": "https://allgovernmentjobs.in/iisc-recruitment-2025-apply-online-for-04-program-assistant-posts/34210",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Science, Bangalore (IISc) has officially released the notification to fill the vacancies of 01 Program Manager Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Any Degree, BDS, B. Pharm, Diploma, MCA, or MBA can apply for the IISc Recruitment 2025 . The interested applicants can apply in online mode. Here we have mentioned the education details, age limit...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "01-09-2025",
        "found_date": "19-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-20T23:40:15.457026",
      "links": []
    },
    {
      "id": "791090228feef831cea2a4543ea72fcc",
      "title": "KSCCF",
      "url": "https://allgovernmentjobs.in/ksccf-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Karnataka State Cooperative Consumer Federation Limited (KSCCF) has officially released the notification to fill the ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-20T23:40:15.457171",
      "links": []
    },
    {
      "id": "d4b8855ab0061733c1319ba94b85478b",
      "title": "NIAB Hyderabad",
      "url": "https://allgovernmentjobs.in/niab-hyderabad-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Animal Biotechnology (NIAB) has announced the official notification for 2025. To fill up the 1 .... The National Institute of Animal Biotechnology (NIAB) has officially released the Notification for 2025. To fill up the ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-20T23:40:15.457193",
      "links": []
    },
    {
      "id": "b02bd0e686379a6f1ad61642c3744257",
      "title": "BEL Recruitment 2025 - Apply Online for 20 Project Engineer I Posts",
      "url": "https://allgovernmentjobs.in/bel-recruitment-2025-apply-online-for-20-project-engineer-i-posts/34221",
      "source": "allgovernmentjobs.in",
      "description": "The Bharat Electronics Limited (BEL) has officially released the notification to fill the vacancies of 20 Project Engineer -I Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Electronics, Electrical Engineering can apply for the BEL Recruitment 2025 . The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, sele...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "13-09-2025",
        "found_date": "20-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-21T23:41:07.373340",
      "links": []
    },
    {
      "id": "6eb31cbc1970f77bbc391d42f6519467",
      "title": "TMC Recruitment 2025 - Walk-in-Interview for Medical Physicist Post",
      "url": "https://allgovernmentjobs.in/tmc-recruitment-2025-walk-in-interview-for-medical-physicist-post/34220",
      "source": "allgovernmentjobs.in",
      "description": "Tata Memorial Centre (TMC) has announced the official notification for 2025. To fill up the vacancies for Medical Physicist Jobs. Those candidates who have qualified in the M.Sc., Diploma can grab this chance and apply for the TMC Recruitment 2025 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can attend the interview at the address given below. If you are looking fo...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "09-09-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-21T23:41:07.373366",
      "links": []
    },
    {
      "id": "4f7a39624611204327f98d472cbbe7fb",
      "title": "ISRO NSIL Recruitment 2025 - Apply Offline for Chairman & Managing Director Posts",
      "url": "https://allgovernmentjobs.in/isro-nsil-recruitment-2025-apply-offline-for-chairman-managing-director-posts/34219",
      "source": "allgovernmentjobs.in",
      "description": "The ISRO New Space India Limited (ISRO NSIL) has officially released the notification to fill the vacancies of 01 Chairman and Managing Director Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, MBA, and Post-graduation students can apply for the ISRO NSIL Recruitment 2025. The interested applicants can apply in offline mode. Here we have mentioned the education det...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "11-09-2025",
        "found_date": "11-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-21T23:41:07.373388",
      "links": []
    },
    {
      "id": "253648f6f4161ac271ea9ecd8022ce73",
      "title": "IIT Kharagnar Recruitment 2025 - Apply Online for 02 Senior Research Fellowship Posts",
      "url": "https://allgovernmentjobs.in/iit-kharagnar-recruitment-2025-apply-online-for-02-senior-research-fellowship-posts/34218",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology (IIT) Kharagpur has announced the official notification for 2025. To fill up the vacancies for 02 Senior Research Fellowship Jobs. Those candidates who have qualified in the B.E/ B.Tech. in Electrical Engineering can grab this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the IIT Kharagpur Recruitment 2025 . Interested and eligible candidates can appl...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "05-08-2025"
      },
      "category": "Banking",
      "skills": [
        "Word"
      ],
      "scraped_at": "2025-08-21T23:41:07.373408",
      "links": []
    },
    {
      "id": "5b71ccb4dd6a3696e4ea4e05d4011cd6",
      "title": "VMMC Safdarjung Hospital Recruitment 2025 - Walk - in for 89 Junior Resident Posts",
      "url": "https://allgovernmentjobs.in/vmmc-safdarjung-hospital-recruitment-2025-walk-in-for-89-junior-resident-posts/34217",
      "source": "allgovernmentjobs.in",
      "description": "The Vardhman Mahavir Medical College and Safdarjung Hospital (VMMC Safdarjung Hospital) has officially released the notification to fill the vacancies of 89 Junior Resident Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the deadline. Candidates who have completed their MBBS, BDS can apply for the VMMC Safdarjung Recruitment 2025 . The interested applicants can attend the walk-in interview. Here we have mentioned the education details, age li...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "26-08-2025",
        "found_date": "19-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-21T23:41:07.373427",
      "links": []
    },
    {
      "id": "c2485ffeeee88d9d011685e50df72279",
      "title": "Manipur University Recruitment 2025 ----Apply for Research Associate Post",
      "url": "https://allgovernmentjobs.in/manipur-university-recruitment-2025-apply-for-research-associate-post/34216",
      "source": "allgovernmentjobs.in",
      "description": "Manipur University has announced the official notification for 2025. To fill up the vacancies for Research Associate Jobs. Those candidates who have qualified in the Ph.D, M.Pharm, MVSc, M.E/ M.Tech can grab this chance and apply for the Manipur University Recruitment 2025. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can send yur resume to the email address before t...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-21T23:41:07.373445",
      "links": []
    },
    {
      "id": "4646856c62fbe7fd29657771c84e8b7b",
      "title": "ANGRAU Recruitment 2025 - Walk -in for Agromet Observer Posts",
      "url": "https://allgovernmentjobs.in/angrau-recruitment-2025-walk-in-for-agromet-observer-posts/34215",
      "source": "allgovernmentjobs.in",
      "description": "The Acharya NG Ranga Agricultural University (ANGRAU) has officially released the notification to fill the vacancies of 01 Agromet Observer Posts. Interested and eligible candidates can also use this opportunity to apply for these posts before the last date of application. Candidates who have completed their 12th can apply for the ANGRAU Recruitment 2025 . The interested applicants can attend the walk-in interview. Here we have mentioned the education details, age limit, selection process, ap...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "22-08-2025",
        "found_date": "14-08-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2025-08-21T23:41:07.373463",
      "links": []
    },
    {
      "id": "b888c2df0d98dd8a08ea110957809ad9",
      "title": "IIT Kharagpur",
      "url": "https://allgovernmentjobs.in/iit-kharagpur-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology (IIT) Kharagpur has announced the official notification for 2025. To fill up the vacancie .... Indian Institute of Technology (IIT) Kharagpur has announced the official notification for 2025. To fill up the vacancie .... The Indian Institute of Technology Kharagpur (IIT Kharagpur) has officially released the notification to fill the vacanc .... Indian Institute of Technology (IIT) Kharagpur has officially released the Notification for 2025. To fill up the Vacanc...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-21T23:41:07.373555",
      "links": []
    },
    {
      "id": "50009e58958b9d68bcddbd41a5929130",
      "title": "Safdarjung Hospital New Delhi",
      "url": "https://allgovernmentjobs.in/safdarjung-hospital-new-delhi-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Vardhman Mahavir Medical College and Safdarjung Hospital (VMMC Safdarjung Hospital) has officially released the noti ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Teaching",
      "skills": [],
      "scraped_at": "2025-08-21T23:41:07.373576",
      "links": []
    },
    {
      "id": "aad3b7f9b98f00665d676a9f8b42cd12",
      "title": "Manipur University",
      "url": "https://allgovernmentjobs.in/manipur-university-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Manipur University has announced the official notification for 2025. To fill up the vacancies for Research Associat ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2025-08-21T23:41:07.373596",
      "links": []
    }
  ]
}