{
  "last_updated": "2026-02-10T00:06:20.698383",
  "total_jobs": 268,
  "active_jobs": 268,
  "expired_jobs": 19,
  "jobs": [
    {
      "id": "27b7ab5626fb0a49b43674a2250f34e9",
      "title": "HARCO Recruitment 2026 - Apply Offline for 02 Resource Persons Posts",
      "url": "https://allgovernmentjobs.in/harco-recruitment-2026-apply-offline-for-02-resource-persons-posts/38358",
      "source": "allgovernmentjobs.in",
      "description": "Haryana State Co-operative Apex Bank (HARCO Bank) has declared the official notification for 2026. To fill up the vacancies for 02 Resource Persons Jobs. Those candidates who have qualified in Any Degree, post-graduation, or Diploma can grab this chance and apply for the HARCO Recruitment 2026 . Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply before the last ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "15-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-10T23:42:24.473923",
      "links": []
    },
    {
      "id": "6c8e82a2f1b21eb0fcd45b239e9e1e39",
      "title": "TMC Recruitment 2026 - Walk-in-Interview for 02 Senior Resident Posts",
      "url": "https://allgovernmentjobs.in/tmc-recruitment-2026-walk-in-interview-for-02-senior-resident-posts/38356",
      "source": "allgovernmentjobs.in",
      "description": "The Tata Memorial Centre (TMC) has declared the official notification for 2026. To fill up the vacancies for 02 Senior Resident Jobs. Those candidates who have qualified for Post Graduation, DNB, can grab this chance and apply for the TMC Recruitment 2026 . Here, we included more about the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can attend the walk-in at the address given below. If you are look...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-10T23:42:24.473960",
      "links": []
    },
    {
      "id": "7cd9b110ef7cd1f60f6e430c63f87e1e",
      "title": "EDII Recruitment 2026 - Apply for Project Officer Posts",
      "url": "https://allgovernmentjobs.in/edii-recruitment-2026-apply-for-project-officer-posts/38354",
      "source": "allgovernmentjobs.in",
      "description": "Entrepreneurship Development Institute of India (EDII) has declared the official notification for 2026. To fill up the vacancies for Project Officer Jobs. Those candidates who have qualified in Any Degree, post-graduation, or Diploma can use this chance and apply for these posts. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the EDII Recruitment 2026 . If you are looking for more, here is a list of Government Jobs ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "18-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-10T23:42:24.473980",
      "links": []
    },
    {
      "id": "c05d45bf0c84e50e552ba3890edc2f9d",
      "title": "ICAR CRRI Recruitment 2026 - Walk-in-Interview for Young Professional Posts",
      "url": "https://allgovernmentjobs.in/icar-crri-recruitment-2026-walk-in-interview-for-young-professional-posts/38352",
      "source": "allgovernmentjobs.in",
      "description": "The Central Rice Research Institute (ICAR CRRI) has declared the official notification for 2026. To fill up the vacancies for Young Professional I Jobs. Those candidates who have qualified in the B.Sc can grab this chance and apply for the ICAR CRRI Recruitment 2026 . Here we mentioned the age limit, selection process, salary, structure, education details, application fee, and how to apply for these posts. Interested candidates can attend the walk-in at the address given below. If you are loo...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "16-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-10T23:42:24.474000",
      "links": []
    },
    {
      "id": "a47ccd865dc05acaf26ee931346c667e",
      "title": "SCTIMST Recruitment 2026 - Apply Online for Project Assistant Posts",
      "url": "https://allgovernmentjobs.in/sctimst-recruitment-2026-apply-online-for-project-assistant-posts/38350",
      "source": "allgovernmentjobs.in",
      "description": "Sree Chitra Tirunal Institute for Medical Sciences and Technology (SCTIMST) has recently released the official notification for 2026. To fill up the vacancies for Project Assistant Jobs. Those candidates who have qualified in the Diploma in Mechanical Engineering, Electrical Engineering can use this chance and apply for these posts. Here, we provided more about the age limit, selection process, salary structure, education details, application fee, and how to apply for the SCTIMST Recruitment ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "11-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-10T23:42:24.474018",
      "links": []
    },
    {
      "id": "93db96e75089d65a907c8753937cd05d",
      "title": "HARCO",
      "url": "https://allgovernmentjobs.in/harco-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Haryana State Co-operative Apex Bank (HARCO Bank) has declared the official notification for 2026. To fill up the vacanc ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-10T23:42:24.474041",
      "links": []
    },
    {
      "id": "6bb55eed4b2605753b31329a414251bc",
      "title": "IIT Hyderabad",
      "url": "https://allgovernmentjobs.in/iit-hyderabad-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indin Institute of Technology Hyderabad (IIT Hyderabad) has officially released the notification to fill the vacanci .... Indian Institute of Technology Hyderabad (IIT Hyderabad) has announced the official notification for 2026. To fill .... The Indian Institute of Technology Hyderabad (IIT Hyderabad) has officially released the notification to fill the vacanc .... Indian Institute of Technology Hyderabad (IIT Hyderabad) has announced the official notification for 2025. To fill up th .......",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-10T23:42:24.474086",
      "links": []
    },
    {
      "id": "c0e52afa9a539814985b791e7c01c420",
      "title": "SCTIMST",
      "url": "https://allgovernmentjobs.in/sctimst-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Sree Chitra Tirunal Institute for Medical Sciences and Technology (SCTIMST) has recently released the official notificat .... The Sree Chitra Tirunal Institute for Medical Sciences and Technology (SCTIMST) has officially released the notification .... Sree Chitra Tirunal Institute for Medical Sciences and Technology (SCTIMST) has declared the official notification .... The Sree Chitra Tirunal Institute for Medical Sciences and Technology (SCTIMST) has declared the official notification f .......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-01-10T23:42:24.474111",
      "links": []
    },
    {
      "id": "949910432190f60e82f2170e33f0ed95",
      "title": "IIT Kanpur",
      "url": "https://allgovernmentjobs.in/iit-kanpur-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology Kanpur (IIT Kanpur) has declared the official notification for 2026. To fill up the .... Indian Institute of Technology Kanpur (IIT Kanpur) has declared the official notification for 2025. To fill up the vario .... Indian Institute of Technology Kanpur (IIT Kanpur) has declared the official notification for 2025. To fill up the .... Indian Institute of Technology Kanpur (IIT Kanpur) has declared the official notification for 2025. To fill up the vacan .... India...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2026-01-10T23:42:24.474135",
      "links": []
    },
    {
      "id": "d58ad18cb0952c0914d73fcd521209f1",
      "title": "IIT Dhanbad",
      "url": "https://allgovernmentjobs.in/iit-dhanbad-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology Dhanbad (IIT Dhanbad) has officially released the notification to fill the vacancies .... Indian Institute of Technology Dhanbad (IIT Dhanbad) has declared the official notification for 2026. To fill up the var .... Indian Institute of Technology Dhanbad (IIT Dhanbad) has declared the job notification for 2026. To fill up the vacancie .... IIT Indian School of Mines Dhanbad (IIT ISM Dhanbad) has declared the official notification for 2025. To fill up the vac...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Teaching",
      "skills": [],
      "scraped_at": "2026-01-10T23:42:24.474165",
      "links": []
    },
    {
      "id": "6447bece9f43503ce4f6efbaf14220d3",
      "title": "PGIMER Recruitment 2026 - Apply Offline for Clinical Research Coordinator Posts",
      "url": "https://allgovernmentjobs.in/pgimer-recruitment-2026-apply-offline-for-clinical-research-coordinator-posts/38394",
      "source": "allgovernmentjobs.in",
      "description": "Postgraduate Institute of Medical Education and Research (PGIMER) has declared the latest job notification for 2026. To fill up the various vacancies for Clinical Research Coordinator Jobs. Those candidates who have qualified in the B.Sc can grab this chance and apply for the PGIMER Recruitment 2026 . Interested candidates can apply before the last date of application. Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "23-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-12T23:41:17.560829",
      "links": []
    },
    {
      "id": "3ad5be57f9432faef7ba3999dbcb1a3d",
      "title": "NDDB Recruitment 2026 - Apply Online for Deputy Manager Posts",
      "url": "https://allgovernmentjobs.in/nddb-recruitment-2026-apply-online-for-deputy-manager-posts/38392",
      "source": "allgovernmentjobs.in",
      "description": "The National Dairy Development Board (NDDB) has announced the official notification for 2026. To fill up the vacancies for Deputy Manager Jobs. Those candidates who have qualified in the B.E/ B.Tech. in Mechanical Engineering can grab this chance and apply for the NDDB Recruitment 2026 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the last date of application. I...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "28-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-12T23:41:17.560853",
      "links": []
    },
    {
      "id": "475e888e5b3c09cc32cfaece13caa214",
      "title": "CCRAS Recruitment 2026 - Walk-in-Interview for 03 Senor Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/ccras-recruitment-2026-walk-in-interview-for-03-senor-research-fellow-posts/38390",
      "source": "allgovernmentjobs.in",
      "description": "The Central Council for Research in Ayurvedic Sciences (CCRAS) has declared the official notification for 2026. To fill up the vacancies for 03 Senior Research Fellow Jobs. Those candidates who have qualified in the Any Degree, BAMS, can grab this chance and apply for the CCRAS Recruitment 2026 . Interested candidates can attend the walk-in at the addres below. Here, we mentioned the age limit, selection process, salary structure, education details, application fee, and how to apply for these...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "15-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-12T23:41:17.560873",
      "links": []
    },
    {
      "id": "b6ea77d0b1ff203240f68e81aafa8b7a",
      "title": "TMC Recruitment 2026 - Walk-in-Interview for Junior Engineer Posts",
      "url": "https://allgovernmentjobs.in/tmc-recruitment-2026-walk-in-interview-for-junior-engineer-posts/38388",
      "source": "allgovernmentjobs.in",
      "description": "The Tata Memorial Centre (TMC) has declared the official notification for 2026. To fill up the vacancies for Junior Engineer Jobs. Those candidates who have completed their Any Degree, B.E/ B.Tech in Civil Engineering can grab this chance and apply for the TMC Recruitment 2026 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can attend the walk-in at the address given below. If you...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "16-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-12T23:41:17.560891",
      "links": []
    },
    {
      "id": "3236fe1308cb892726c99fa983e72348",
      "title": "IIT Kanpur Recruitment 2026 - Apply Offline for Assistant Project Manager Posts",
      "url": "https://allgovernmentjobs.in/iit-kanpur-recruitment-2026-apply-offline-for-assistant-project-manager-posts/38386",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology Kanpur (IIT Kanpur) has declared the official notification for 2026. To fill up the vacancies for Assistant Project Manager Jobs. Those candidates who have qualified in Any Degree, post-graduation, can grab this chance and apply for the IIT Kanpur Recruitment 2026 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for the posts. Interested candidates can apply before the last date of applica...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "20-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-12T23:41:17.560915",
      "links": []
    },
    {
      "id": "4dc11f0c911b332cf85394d603e8081c",
      "title": "Indian Air Force",
      "url": "https://allgovernmentjobs.in/indian-air-force-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Air Force (IAF) has officially released the notification to fill the vacancies of 01 Agniveervayu Posts. Inte .... The Indian Air Force (IAF) has officially released the notification to fill the vacancies of 144 Apprentice Posts. Inter .... The Indian Air Force (IAF) has officially released the notification to fill the vacancies of 340 Flying Officers and Gro ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-12T23:41:17.561007",
      "links": []
    },
    {
      "id": "43006eabc4c6e5b1ee7b258c97d92644",
      "title": "IIT Guwahati",
      "url": "https://allgovernmentjobs.in/iit-guwahati-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology Guwahati (IIT Guwahati) has officially released the notification to fill the vacancie .... Indian Institute of Technology (IIT Guwahati) has declared the official notification for 2025. To fill up the vacancies .... Indian Institute of Technology Guwahati (IIT Guwahati) has announced the official notification for 2026. To fill up the .... Indian Institute of Technology Guwahati (IIT Guwahati) has declared the official notification for 2025. To fill up .... T...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-12T23:41:17.561046",
      "links": []
    },
    {
      "id": "034c7bd42d91fdb16a4df34b724ed344",
      "title": "STBI Recruitment 2026 - Apply Online for Assistant Manager Posts",
      "url": "https://allgovernmentjobs.in/stbi-recruitment-2026-apply-online-for-assistant-manager-posts/38436",
      "source": "allgovernmentjobs.in",
      "description": "Savli Technology and Business Incubator (STBI) has released an official notification for 2026. To fill up vacancies for Assistant Manager Jobs. Those candidates who have qualified in the B.E/ B.Tech. in Electronics and Communication Engineering, Mechanical Engineering, and Electrical Engineering can grab this chance and apply for the STBI Recruitment 2026 . Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "22-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-13T23:42:27.137598",
      "links": []
    },
    {
      "id": "d8eb329e854c5773d0e04c8470b54c2f",
      "title": "Spices Board Recruitment 2026 - Walk-in-Interview for 03 Research Assistant Posts",
      "url": "https://allgovernmentjobs.in/spices-board-recruitment-2026-walk-in-interview-for-03-research-assistant-posts/38433",
      "source": "allgovernmentjobs.in",
      "description": "Spices Board of India has announced the official notification for 2026. To fill up the vacancies for Research Assistant Jobs. Those candidates who have qualified in the M.Sc., Post-Graduation can grab this chance and apply for the Spices Board Recruitment 2026 . Here, we mentioned the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can attend the walk-in at the address given below. If you are looking f...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-13T23:42:27.137620",
      "links": []
    },
    {
      "id": "ae355eb2fd0fb18c928ea70b67633152",
      "title": "NIAB Recruitment 2026 - Apply Online for Project Technical Support III Posts",
      "url": "https://allgovernmentjobs.in/niab-recruitment-2026-apply-online-for-project-technical-support-iii-posts/38431",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Animal Biotechnology (NAB) has declared the official notification for 2026. To fill up the vacancies for Project Technical Support III Jobs. Those candidates who have qualified in Any Degree, post-graduation, can grab this chance and apply for the NIAB Recruitment 2026 . Here we provided more about the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the last d...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "23-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-13T23:42:27.137637",
      "links": []
    },
    {
      "id": "3c8ecbd180d592d52730da976bc80cc9",
      "title": "IACS Recruitment 2026 - Apply for Research Associate I Posts",
      "url": "https://allgovernmentjobs.in/iacs-recruitment-2026-apply-for-research-associate-i-posts/38427",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Association for the Cultivation of Science (IACS) has delivered the official notification for 2026. To fill up the various vacancies for Research Associate I Jobs. Those candidates who have qualified in the Post Graduation, Ph.D, can grab this chance and apply for the IACS Recruitment 2026 . Here, we mentioned more about the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can send their resu...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "26-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-13T23:42:27.137676",
      "links": []
    },
    {
      "id": "54f79a7d2f61414148080f7178110c7c",
      "title": "AIIMS Bhopal",
      "url": "https://allgovernmentjobs.in/aiims-bhopal-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences Bhopal (AIIMS Bhopal) has declared the official notification for 2026. To fill u .... All India Institute of Medical Sciences Bhopal (AIIMS Bhopal) has declared the official notification for 2025. To fill u .... The All India Institute of Medical Sciences, Bhopal (AIIMS Bhopal) has officially released the notification to fill the .... The All India Institute of Medical Sciences, Bhopal (AIIMS Bhopal) has officially released the notification to fill the ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-01-13T23:42:27.137854",
      "links": []
    },
    {
      "id": "06db99e2baeb085058fa4083de41b78e",
      "title": "NIT Calicut Jobs 2026 - Apply Online for Junior Translation Officer Posts",
      "url": "https://allgovernmentjobs.in/nit-calicut-jobs-2026-apply-online-for-junior-translation-officer-posts/38435",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technology Calicut (NIT Calicut) has officially released the notification to fill the vacancies of 01 Junior Translation Officer Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Diploma, Post-graduation can apply for the NIT Calicut Jobs 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, s...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "15-02-2026",
        "found_date": "13-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-13T23:42:27.142796",
      "links": []
    },
    {
      "id": "75a360d9722376368bff51333034d25f",
      "title": "Defence Jobs",
      "url": "https://www.rojgarresult.com/category/defence-jobs/",
      "source": "www.rojgarresult.com",
      "description": "Skip to content Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com > Defence Jobs January 13, 2026 UP Police Constable Online Form 2026 for 32679 Post January 12, 2026 Indian Airforce Agniveer V...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Hindi"
      ],
      "scraped_at": "2026-01-13T23:42:52.421142",
      "links": []
    },
    {
      "id": "6d9519db9d0d547b9eee164f50fe352a",
      "title": "Latest Form 2025",
      "url": "https://www.rojgarresult.com/recruitments/",
      "source": "www.rojgarresult.com",
      "description": "Latest Form Online and Offline Form on Sarkari Naukri Result 2025, RojgarResults is a Latest Form  Recruitment Portal provides details of all Recruitment  , Sarkari Naukri 2025, rojgar result rojgarresult.com | Govt Jobs & Govt Jobs of Railway RRB NTPC,RRB Group D, 10 2 latest job. up police, bihar stet Latest Form BPSC Boiler Inspector Online Form 2026 BPSC Deputy Director Online Form 2026 BPSC Additional Director Cum Assistant State Fire officer Online Form 2026 UP Police Constable Online F...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Hindi"
      ],
      "scraped_at": "2026-01-13T23:42:52.429935",
      "links": []
    },
    {
      "id": "1820d4aa20e3deca5289fbe6db340b20",
      "title": "AAI Pilot Recruitment 2025",
      "url": "https://www.rojgarresult.com/aai-pilot-recruitment/",
      "source": "www.rojgarresult.com",
      "description": "Airport Authority of India Pilot Recruitment 2025 Post Date: 06-06-2025 Short Description: AAI Pilot Recruitment 2025 : AAI Pilot Recruitment 2025 has been issued by Airport Authority of India This Recruitment has been issued on a Total of 02 Post , Candidate apply through offline mode within 04 June 2025 to 27 June 2025 . For more Information visit official website @https://www.aai.aero/. Candidate can download the official notification through the link given below.More Other Recruitment | J...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "06-06-2025"
      },
      "category": "Banking",
      "skills": [
        "Mathematics"
      ],
      "scraped_at": "2026-01-13T23:42:52.429978",
      "links": [
        "https://www.aai.aero/.",
        "https://www.aai.aero/"
      ]
    },
    {
      "id": "ca8885df4df2b468e871d534915da5ec",
      "title": "UP Anganwadi Worker AWW Online Form 2025 | District Wise Update",
      "url": "https://www.rojgarresult.com/up-anganwadi-bharti-nov-2025/",
      "source": "www.rojgarresult.com",
      "description": "Uttar Pradesh UP ICDS Anganwadi Bharti Worker Recruitment 2025: Apply Online Form Post Date: 21-11-2025 Short Description: Uttar Pradesh Government UP Anganwadi Bharti (District Wise) : Recruitment Official Notification is released and Online Form Now Started on District Wise to District Wise is Last Date for District Wise Post. UP Anganwadi Recruitment , 2025 Vacancy 2025 Full Notification available at the official website. All the candidates can now check the detailed notification of UP Ang...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "21-11-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-13T23:42:52.433095",
      "links": []
    },
    {
      "id": "7f71515d547ae0a50bb44036c3505af9",
      "title": "Sarkari Yojana",
      "url": "https://www.rojgarresult.com/category/sarkari-yojna/",
      "source": "www.rojgarresult.com",
      "description": "Skip to content Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com > Sarkari Yojna December 15, 2025 UP Anganwadi Helper Online Form 2025 | All District November 21, 2025 UP Anganwadi Worker AWW...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Hindi",
        "General Knowledge"
      ],
      "scraped_at": "2026-01-13T23:42:52.448362",
      "links": []
    },
    {
      "id": "cd60997d3c96177f7c275afa6e376d47",
      "title": "10th & 10+2 Jobs",
      "url": "https://www.rojgarresult.com/category/10th-12th/",
      "source": "www.rojgarresult.com",
      "description": "Skip to content Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com > 10th 12th Jobs January 13, 2026 UP Police Constable Online Form 2026 for 32679 Post January 13, 2026 IAF Indian Air Force Air...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-13T23:42:52.448376",
      "links": []
    },
    {
      "id": "9f785a4bdc0607a77af10f7dba6f9044",
      "title": "B.Tech / MBA Jobs",
      "url": "https://www.rojgarresult.com/category/btech-mba/",
      "source": "www.rojgarresult.com",
      "description": "Skip to content Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com > B.Tech MBA Jobs January 13, 2026 BPSC Boiler Inspector Online Form 2026 January 12, 2026 BPSC Assistant Conservator of Forest...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-13T23:42:52.448415",
      "links": []
    },
    {
      "id": "4cc548d055148bdde7d54354c8ee817a",
      "title": "TI / Diploma / Apprentice Jobs",
      "url": "https://www.rojgarresult.com/category/apprentices/",
      "source": "www.rojgarresult.com",
      "description": "Skip to content Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com Rojgar Result | RojgarResult.Com Menu Home Latest Result 2025 Admit Card Answer Key Admission Latest Form 2025 About Us Contact Us Privacy Policy Rojgar Result RojgarResult.Com > Apprentice Jobs January 13, 2026 IAF Indian Air Force Airmen Group Y Medical Assistant Online Form 2026 | Intake 01/2027 Janu...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-13T23:42:52.448432",
      "links": []
    },
    {
      "id": "c382d07d414485cf41b2c11f8f797d55",
      "title": "BPSC Boiler Inspector Online Form 2026",
      "url": "https://www.rojgarresult.com/bpsc-boiler-inspector-online-form/",
      "source": "www.rojgarresult.com",
      "description": "BPSC Boiler Inspector Recruitment 2026: Apply Online for 05 Post Post Update Date: 13-01-2026 Short Description: BPSC Boiler Inspector Recruitment 2026: Bihar Public Service Commission (BPSC) has released Advertisement No. 06/2026 for the recruitment of Boiler Inspector Under Labour Resources Dept., Govt. of Bihar . Eligible candidates can apply online from 13 January 2026 . The last date to apply online and pay the examination fee is 03 February 2026 . The examination will be conducted as pe...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-13T23:42:52.448450",
      "links": []
    },
    {
      "id": "f41384792cd4e68b43a30bfcfeb48ba9",
      "title": "BPSC Deputy Director Online Form 2026",
      "url": "https://www.rojgarresult.com/bpsc-deputy-director-online-form/",
      "source": "www.rojgarresult.com",
      "description": "BPSC Deputy Director Recruitment 2026: Apply Online for 14 Post Post Update Date: 13-01-2026 Short Description: BPSC Deputy Director Recruitment 2026: Bihar Public Service Commission (BPSC) has released Advertisement No. 05/2026 for the recruitment of Deputy Director Under Home Dept. (Police Section), Govt. of Bihar . Eligible candidates can apply online from 13 January 2026 . The last date to apply online and pay the examination fee is 03 February 2026 . The examination will be conducted as ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-13T23:42:52.448468",
      "links": []
    },
    {
      "id": "1cf0558559fd2034129fa45a45a93b13",
      "title": "BPSC Additional Director Cum Assistant State Fire officer Online Form 2026",
      "url": "https://www.rojgarresult.com/bpsc-director-cum-assistant-state-fire-officer/",
      "source": "www.rojgarresult.com",
      "description": "BPSC Additional Director Cum Assistant State Fire Office Recruitment 2026: Apply Online for 04 Post Post Update Date: 13-01-2026 Short Description: BPSC Assistant Director Cum Assistant State Fire Officer Recruitment 2026: Bihar Public Service Commission (BPSC) has released Advertisement No. 04/2026 for the recruitment of Assistant Director Cum Assistant State Fire Officer Under Home Dept. (Police Section), Govt. of Bihar . Eligible candidates can apply online from 13 January 2026 . The last ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-13T23:42:52.448487",
      "links": []
    },
    {
      "id": "db2d340d849187ecd553c14d005c3168",
      "title": "IAF Indian Air Force Airmen Group Y Medical Assistant Online Form 2026 | Intake 01/2027",
      "url": "https://www.rojgarresult.com/iaf-indian-air-force-airmen-2026/",
      "source": "www.rojgarresult.com",
      "description": "Indian Air Force Group Y Medical Assistant 01/2027 Online Form 2026 Post Date: 13/01/2026 Short Description: IAF Indian Air Force Airmen Group Y Medical Assistant Recruitment 2026 Apply Online Form: IAF Airmen Group Y Medical Assistant Online Form 2026, Notification has been released on the website @https://airmenselection.cdac.in/ & Application Form now started on 12 January 2026 to 01 February 2026 for Indian Air Force Jobs 2026. Get the direct link to download notification link available o...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13/01/2026"
      },
      "category": "Banking",
      "skills": [
        "English"
      ],
      "scraped_at": "2026-01-13T23:42:52.448513",
      "links": [
        "https://airmenselection.cdac.in/"
      ]
    },
    {
      "id": "094953186629100dd100ff7fbdd84ef1",
      "title": "NHM Chandigarh Recruitment 2026 - Apply Offline for 16 Lab Technician Posts",
      "url": "https://allgovernmentjobs.in/nhm-chandiagrh-recruitment-2026-apply-offline-for-16-lab-technician-posts/38447",
      "source": "allgovernmentjobs.in",
      "description": "National Health Mission Chandigarh (NHM Chandigarh) has declared the official notification for 2026. To fill up the vacancies for 16 Lab Technician Jobs. Those candidates who have qualified in the 12th, Diploma, and B.Sc can grab this chance and apply for the NHM Chandigarh Recruitment 2026 . Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the last date of applicat...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "21-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-16T23:44:04.032558",
      "links": []
    },
    {
      "id": "54d4a8c1c7fd816447e5b78c8d1a3ebf",
      "title": "IIT Dhanbad Recruitment 2026 - Apply Offline for Junior Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/iit-dhanbad-recruitment-2026-apply-offline-for-junior-research-fellow-posts/38476",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology Dhanbad (IIT Dhanbad) has announced the official notification for 2026. To fill up the various vacancies for Junior Research Fellow Jobs. Those candidates who have qualified in the M.E/ M.Tech, M.Sc can grab this chance and apply for the IIT Dhanbad Recruitment 2026 . Here, we mentioned the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can send their resumes to the addr...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "30-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-16T23:44:04.032582",
      "links": []
    },
    {
      "id": "2397e65a89c0bc804f85fd6a43fdecee",
      "title": "INST Mohali Recruitment 2026 - Apply for Junior Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/inst-mohali-recruitment-2026-apply-for-junior-research-fellow-posts/38471",
      "source": "allgovernmentjobs.in",
      "description": "Institute of Nano Science and Technology Mohali (INST Mohali) has declared the official notification for 2026. To fill up the vacancies for B.E/ B.Tech, M.Sc, can grab this chance and apply for the INST Mohali Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply online before the last date of application. If you are looking for more, here is a list of Gover...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "27-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-16T23:44:04.032621",
      "links": []
    },
    {
      "id": "c35daf7bc426a345f857f8147d294147",
      "title": "NPCIL",
      "url": "https://allgovernmentjobs.in/npcil-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Nuclear Power Corporation of India Limited (NPCIL) has officially released the notification to fill the vacancies of .... The Nuclear Power Corporation of India Limited (NPCIL) has officially released the notification to fill the vacancies of ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-16T23:44:04.032669",
      "links": []
    },
    {
      "id": "a875e1d99faab55e4364ae27119cec4d",
      "title": "Anna University",
      "url": "https://allgovernmentjobs.in/anna-university-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Anna University has announced the official notification for 2026. To fill up the vacancies for 02 Professional Assi .... Anna University has officially released the notification to fill the vacancies of 22 Project Assistants, Project Associa .... Anna University has officially released the notification to fill the vacancies of 01 Junior Research Fellow Posts. Inter .... Anna University (AU Chennai) has declared the official notification for 2025. To fill up the vacancies for Pro .... The Anna...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-16T23:44:04.032715",
      "links": []
    },
    {
      "id": "bb5e291f2eb45656e6e0c1343c8a54af",
      "title": "IFFCO",
      "url": "https://allgovernmentjobs.in/iffco-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Farmers Fertiliser Cooperative Limited (IFFCO) has officially released the notification to fill the vacancies ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-16T23:44:04.032801",
      "links": []
    },
    {
      "id": "6f3ca7c9e5c455a0062b0a408cba1cfc",
      "title": "MPESB ITI Training Officer Online Form 2026 for 1120 Post",
      "url": "https://www.rojgarresult.com/mpesb-iti-training-officer-2026/",
      "source": "www.rojgarresult.com",
      "description": "MP Employees Selection Board MPESB ITI Training Officer Recruitment 2026 : Apply Online for 1120 Post Post Post Update Date: 15-01-2026 Short Description: MP Employees Selection Board MP ESB ITI Training Officer Online Form 2026: MP Employees Selection Board MPESB Department of Technical Education, Skill Development & Employment (ITI Training officer) Recruitment Test – 2026 Official Notification is released and Online Form Now Started on 17 January 2026  to 31 January 2026 is Last Date for M...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "15-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-16T23:44:27.381618",
      "links": []
    },
    {
      "id": "cde40bd6032278040d71ceece92404db",
      "title": "CSIR CLRI Section Officer Online Form 2026",
      "url": "https://www.rojgarresult.com/csir-clri-section-officer-2026/",
      "source": "www.rojgarresult.com",
      "description": "CSIR CLRI Central Leather Research Institute Recruitment 2026: Apply for 08 Post Post Update Date: 15-01-2026 Short Description: CSIR CLRI Section Officer Recruitment 2026 Apply Online Form : CSIR CLRI Section Officer Online Form 2026, Notification has been released on the website @https://www.clri.org/ & Application Form now started on 15 January 2026 to 04 February 2026. Central Leather Research Institute Jobs 2026. Get the direct link to download notification link available on CSIR CLRI Se...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "15-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-16T23:44:27.381655",
      "links": [
        "https://www.clri.org/"
      ]
    },
    {
      "id": "27a6495aa93966fffcea73d0d851452a",
      "title": "Bihar SSC BSSC 10+2 Inter Level Online Form 2026 for 24492 Post",
      "url": "https://www.rojgarresult.com/bssc-inter-level-02-2023/",
      "source": "www.rojgarresult.com",
      "description": "Bihar SSC 10+2 Inter Level Recruitment 2026 : Apply Online for 24492 Post Post Update Date: 15-01-2026 Short Description: Bihar BSSC Inter Level Recruitment 2025 Apply Online Form : Bihar Staff Selection Commission Bihar BSSC 10+2 Inter level Various Post Online Form 2025, Notification has been released on the website @https://bssc.bihar.gov.in/ & Application Form now started on 15 October 2025 to 15 January 2026 for Total 24492 Post Bihar Staff Selection Commission Jobs 2025. Get the direct ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "15-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-16T23:44:27.381677",
      "links": [
        "https://bssc.bihar.gov.in/"
      ]
    },
    {
      "id": "c08690d35f174b9a15f374289ac38ea9",
      "title": "RBI Office Attendant Online Form 2026 for 572 Post",
      "url": "https://www.rojgarresult.com/rbi-office-attendant-online-form/",
      "source": "www.rojgarresult.com",
      "description": "RBI Reserve Bank of India Office Attendant Online Form 2026 Post Update Date: 15-01-2026 Short Description: RBI Office Attendant Online form 2026 : Notification has been released on the website @https://opportunities.rbi.org.in/scripts/vacancies.aspx & Application Form now started on 15 January 2026 to 04 Febraury2026 . Reserve Bank of India Jobs 2026. Get the direct link to download notification link available on RBI Office Attendant Vacancy 2026 Official Website and More Other Details Age L...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "15-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-16T23:44:27.381696",
      "links": [
        "https://opportunities.rbi.org.in/scripts/vacancies.aspx"
      ]
    },
    {
      "id": "15b00b078cb92017fcfb6825bbefb1d9",
      "title": "NISER Recruitment 2026 - Apply for 02 Research Scholar Posts",
      "url": "https://allgovernmentjobs.in/niser-recruitment-2026-walk-in-interview-for-02-research-scholar-posts/38518",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Science Education and Research (NISER) has declared the official notification for 2026. To fill up the vacancies for 02 Research Scholar Jobs. Those candidates who have qualified in the B.E/ B.Tech in Mechanical Engineering and Electrical Engineering can grab this chance and apply for the NISER Recruitment 2026 . Here, we mentioned more about the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Inte...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "25-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-17T23:43:13.156222",
      "links": []
    },
    {
      "id": "e19a795b28bbe4df1fae063c419dcb71",
      "title": "CNBC Recruitment 2026 - Apply for Various Radiologist Posts",
      "url": "https://allgovernmentjobs.in/cnbc-recruitment-2026-apply-for-various-radiologist-posts/38514",
      "source": "allgovernmentjobs.in",
      "description": "Chacha Nehru Bal Chikitsalaya (CNBC) has declared the official notification for 2026. To fill up the various vacancies for Radiologist Jobs. Those candidates who have qualified in the MD/ MS and DNB can grab this chance and apply for the CNBC Recruitment 2026 . Here we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the last date. If you are looking for more, here is a lis...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "27-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-17T23:43:13.156266",
      "links": []
    },
    {
      "id": "59f39ec0fc5aae9b4ae8dd088744970d",
      "title": "Ambedkar Nagar Hospital Recruitment 2026 - Walk-in-Interview for",
      "url": "https://allgovernmentjobs.in/ambedkar-nagar-hospital-recruitment-2026-walk-in-interview-for/38512",
      "source": "allgovernmentjobs.in",
      "description": "Ambedkar Nagar Hospital has declared the official notification for 2026. To fill up the vacancies for 02 Senior Resident Jobs. Those candidates who have qualified in the MBBS Post Graduation can grab this chance and apply for the Ambedkar Nagar Hospital Recruitment 2026 . Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested aspirants can attend the walk-in at the address below. If you are looking ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "20-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-17T23:43:13.156285",
      "links": []
    },
    {
      "id": "df805d1911ab691f3ccbd1ef578488ff",
      "title": "NISER",
      "url": "https://allgovernmentjobs.in/niser-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Science Education and Research (NISER) has declared the official notification for 2026. To fil .... The National Institute of Science Education and Research (NISER) has declared the official notification for 2026. To fil .... The National Institute of Science Education and Research (NISER) has officially released the notification to fill the va .... The National Institute of Science Education and Research (NISER) has officially released the notification to fill the v...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Teaching",
      "skills": [],
      "scraped_at": "2026-01-17T23:43:13.156306",
      "links": []
    },
    {
      "id": "8f75e46f91d2aadf371fad9fe9609a48",
      "title": "AIIMS Raipur",
      "url": "https://allgovernmentjobs.in/aiims-raipur-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The All India Institute of Medical Sciences, Raipur (AIIMS Raipur) has officially released the notification to fill the .... The All India Institute of Medical Sciences Raipur (AIIMS Raipur) has declared the official notification for 2025. To fi .... All India Institute of Medical Sciences (AIIMS Raipur) has declared the official notification for 2025. To fill up the v .... All India Institute of Medical Sciences Raipur (AIIMS Raipur) has declared the official notification for 2025. To fill u...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-01-17T23:43:13.156328",
      "links": []
    },
    {
      "id": "9efb15d2e56d65326e5e3cedaed1ffba",
      "title": "JKPSC",
      "url": "https://allgovernmentjobs.in/jkpsc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Jammu & Kashmir Public Service Commission (JKPSC) has officially released the notification to fill the vacancies .... The Jammu & Kashmir Public Service Commission (JKPSC) has officially released the notification to fill the vacancies .... The Jammu & Kashmir Public Service Commission (JKPSC) has officially released the notification to fill the vacancies .... Jammu and Kashmir Public Service Commission (JKPSC) has declared the latest job notification for 2025. To fill up t .... Jammu & Ka...",
      "pdf_link": null,
      "important_dates": {},
      "category": "General",
      "skills": [],
      "scraped_at": "2026-01-17T23:43:13.156349",
      "links": []
    },
    {
      "id": "2ca72338a158ca88c6e6689e477ce83e",
      "title": "NIT Trichy",
      "url": "https://allgovernmentjobs.in/nit-trichy-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technology Tiruchirappalli (NIT Trichy) has officially released the notification to fill the v .... National Institute of Technology Tiruchirappalli (NIT Tiruchirappalli) has declared the official notification for 2026. .... The National Institute of Technology Tiruchirappalli (NIT Trichy) has officially released the notification to fill the v .... The National Institute of Technology, Tiruchirappalli (NIT Trichy) has officially released the notification to fill the ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-17T23:43:13.156373",
      "links": []
    },
    {
      "id": "a99851d92e0559618c48a8ce00933660",
      "title": "SVNIT",
      "url": "https://allgovernmentjobs.in/svnit-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Sardar Vallabhbhai National Institute of Technology Surat (SVNIT Surat) has officially released the notification to .... The Sardar Vallabhbhai National Institute of Technology (SVNIT) has officially released the notification to fill the vac .... Sardar Vallabhbhai National Institute of Technology (SVNIT) has declared the official notification for 2025. To fill up .... Sardar Vallabhbhai National Institute of Technology (SVNIT) has declared the official notification for 2025. To fill up ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-17T23:43:13.156407",
      "links": []
    },
    {
      "id": "5a97b6ed38f56b92a79447b514d4f815",
      "title": "NIPGR",
      "url": "https://allgovernmentjobs.in/nipgr-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Plant Genome Research (NIPGR) has officially released the notification to fill the vacancies o .... The National Institute of Plant Genome Research (NIPGR) has declared the official notification for 2025. To fill up the .... The National Institute of Plant Genome Research (NIPGR) has declared the official notification for 2025. To fill up the .... The National Institute of Plant Genome Research (NIPGR) has declared the official notification for 2025. To fill up ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-17T23:43:13.156429",
      "links": []
    },
    {
      "id": "b44a95488a0ceec085c4584d03ec59a0",
      "title": "NIT Jalandhar",
      "url": "https://allgovernmentjobs.in/nit-jalandhar-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "National Institute of Technology Jalandhar (NIT Jalandhar) has declared the official notification for 2026. To fill upth .... The National Institute of Technology (NIT) has declared the official notification for 2025. To fill up the Vacancies for ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-17T23:43:13.156457",
      "links": []
    },
    {
      "id": "2655681601c4c1c2f4100e719689ed08",
      "title": "IIT Jodhpur",
      "url": "https://allgovernmentjobs.in/iit-jodhpur-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology Jodhpur (IIT Jodhpur) has officially released the notification to fill the vacancies .... The Indian Institute of Technology Jodhpur (IIT Jodhpur) has officially released the notification to fill the vacancies .... Indian Institute of Technology Jodhpur (IIT Jodhpur) has declared the official notification for 2026. To fill up the vac .... The Indian Institute of Technology Jodhpur (IIT Jodhpur) has officially released the notification to fill the vacancies ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-17T23:43:13.156484",
      "links": []
    },
    {
      "id": "eecbe885c8bd5d28d3a7befb60f3d082",
      "title": "India Exim Bank Deputy Managers Online Form 2026",
      "url": "https://www.rojgarresult.com/exim-bank-deputy-managers-2026/",
      "source": "www.rojgarresult.com",
      "description": "India Exim Bank Deputy Managers Recruitment 2026: Apply Online for 20 Post Post Update Date: 17-01-2026 Short Description: India Exim Bank Deputy Managers Online Form 2026 for 20 Post: India Exim Bank GO Official Notification is released and Online Form Now Started on 26 January to 15 February 2026 is Last Date for India Exim Bank Deputy Managers Examination, Vacancy 2026 Full Notification available at the official website. All the candidates can now check the detailed notification of India E...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "15/02/2026",
        "found_date": "17-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-18T23:43:46.790649",
      "links": []
    },
    {
      "id": "8013dcd399315a61d835904ded3fb7ab",
      "title": "India Exim Bank Management Trainees Online Form 2026",
      "url": "https://www.rojgarresult.com/india-exim-bank-management-trainees-2026/",
      "source": "www.rojgarresult.com",
      "description": "India Exim Bank Management Trainees Recruitment 2026: Apply Online for 40 Post Post Update Date: 17-01-2026 Short Description: India Exim Bank Management Trainees Online Form 2026 for 40 Post: India Exim Bank GO Official Notification is released and Online Form Now Started on 17 January to 01 February 2026 is Last Date for India Exim Bank Management Trainees Examination, Vacancy 2026 Full Notification available at the official website. All the candidates can now check the detailed notificatio...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "16/02/2026",
        "found_date": "17-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-18T23:43:46.790670",
      "links": []
    },
    {
      "id": "7f48a630cc28d3ed9711d25d8a07bb4f",
      "title": "SAI Notification 2026 - Apply Online for 323 Assistant Coaches Posts",
      "url": "https://allgovernmentjobs.in/sai-notification-2026-apply-online-for-323-assistant-coaches-posts/38537",
      "source": "allgovernmentjobs.in",
      "description": "The Sports Authority of India (SAI) has officially released the notification to fill the vacancies of 323 Assistant Coaches Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Diploma can apply for the SAI Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process, application fee, salary, and h...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "15-02-2026",
        "found_date": "01-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-19T23:44:17.419324",
      "links": []
    },
    {
      "id": "c4f62b9b9e0284b11c3ab467981cf819",
      "title": "MRVC Notification 2026 - Apply Offline for 25 Project Engineer Posts",
      "url": "https://allgovernmentjobs.in/mrvc-notification-2026-apply-offline-for-25-project-engineer-posts/38535",
      "source": "allgovernmentjobs.in",
      "description": "The Mumbai Railway Vikas Corporation (MRVC) has officially released the notification to fill the vacancies of 25 Project Engineer Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Electrical and Civil Engineering can apply for the MRVC Notification 2026. The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, ...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "10-02-2026",
        "found_date": "16-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-19T23:44:17.419351",
      "links": []
    },
    {
      "id": "339d7c88ae6728574c02222aca0c4225",
      "title": "CMD Kerala",
      "url": "https://allgovernmentjobs.in/cmd-kerala-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Centre for Management Development (CMD Kerala) has officially released the notification to fill the vacancies of 02& .... The Kerala Rubber (KRL) has officially released the notification to fill the vacancies of 02 Project Engineer and Manage .... The Kerala Development and Innovation Strategic Council (KDISC) has officially released the notification to fill the vac .... The Centre for Management Development Kerala (CMD Kerala) has officially released the notification to fill the vacancie...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2026-01-19T23:44:17.425093",
      "links": []
    },
    {
      "id": "33f9b4abebed77d3a147ee7393b7d2fb",
      "title": "NIT Karnataka",
      "url": "https://allgovernmentjobs.in/nit-karnataka-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technology Karnataka (NIT Karnataka) has officially released the notification to fill the vaca .... The National Institute of Technology Karnataka (NIT Karnataka) has declared the official notification for 2025. To fill .... The National Institute of Technology, Karnataka (NIT Karnataka) has officially released the notification to fill the vac .... National Institute of Technology Karnataka (NIT Karnataka) has declared the offcial notification for 2025. To fill up th...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-19T23:44:17.425120",
      "links": []
    },
    {
      "id": "6650ee5ba1297f3c732aae33894e8a7f",
      "title": "TNPSC",
      "url": "https://allgovernmentjobs.in/tnpsc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Tamil Nadu Agricultural University (TNAU) has officially released the notification to fill the vacancies of 12  .... Chennai Corporation has declared the official notification for 2025. To fill up the vacancies for 84 Medical Office .... Tamil Nadu Power Distribution Corporation (TNPDCL) has declared the official notification for 2025. To fill up the vacan .... Tamil Nadu Open University (TNOU) has declared the official notification for 2025. To fill up 11 Assistant Professo .... Chennai ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Hindi"
      ],
      "scraped_at": "2026-01-19T23:44:17.425169",
      "links": []
    },
    {
      "id": "cb4f646c2fe8aae82a7c2fc2d2f77578",
      "title": "IIT Patna",
      "url": "https://allgovernmentjobs.in/iit-patna-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology Patna (IIT Patna) has officially released the notification to fill the vacancies of 0 .... Indian Institute of Technology Patna (IIT Patna) has declared the official notification for 2026. To fill up the various .... Indian Institute of Technology Patna (IIT Patna) has declared the official notification for 2026. To fill up the vacanci .... Indian Institute of Technology (IIT Patna) has announced the official notification for 2025. To fill up the vacancies f...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-19T23:44:17.425196",
      "links": []
    },
    {
      "id": "a6c8430a8f78fea3c328892fb29c5350",
      "title": "MPPSC",
      "url": "https://allgovernmentjobs.in/mppsc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Madhya Pradesh Employees Selection Board (MPESB) has officially released the notification to fill the vacancies of 1 .... The Madhya Pradesh Public Service Commission (MPPSC) has officially released the notification to fill the vacancies of 3 .... Madhya Pradesh State Forest Research Institute (MPSFRI)has declared the official notification for 2025. To fill up the v .... Madhya Pradesh Building Development Corporation Limited (MPBDC) has announced the official notification for 2025. To fi...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-19T23:44:17.425217",
      "links": []
    },
    {
      "id": "cce880fe69125f35b7afd6a7a42ed468",
      "title": "ICT Mumbai",
      "url": "https://allgovernmentjobs.in/ict-mumbai-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Institute of Chemical Technology Mumbai (ICT Mumbai) has officially released the notification to fill the vacancies .... Institute of Chemical Technology Mumbai (ICT Mumbai) has declared the official notification for 2026. To fill up the var .... Institute of Chemical Technology Mumbai (ICT Mumbai) has announced an official notification for 2026. To fill up the Vac .... Institute of Chemical Technology Mumbai (ICT Mumbai) has declared the official notification for 2025. To fill up the vac...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2026-01-19T23:44:17.425301",
      "links": []
    },
    {
      "id": "54d79cec76d8fd948a088717b49897a3",
      "title": "UP Aganwadi Helper Apply Online",
      "url": "https://www.rojgarresult.com/up-anganwadi-helper-online-form-2025/",
      "source": "www.rojgarresult.com",
      "description": "Uttar Pradesh UP ICDS Anganwadi Bharti Helper Recruitment 2025: Apply Online Form Post Date: 15-12-2025 Short Description: Uttar Pradesh Government UP Anganwadi Bharti (District Wise) : Recruitment Official Notification is released and Online Form Now Started on District Wise to District Wise is Last Date for District Wise Post. UP Anganwadi Recruitment , 2025 Vacancy 2025 Full Notification available at the official website. All the candidates can now check the detailed notification of UP Ang...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "15-12-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-19T23:44:40.447711",
      "links": []
    },
    {
      "id": "63d44fd13e7a170bc81aec4400f29b6c",
      "title": "IFFCO Apprentice Online Form 2026",
      "url": "https://www.rojgarresult.com/iffco-apprentice-2026/",
      "source": "www.rojgarresult.com",
      "description": "IFFCO Phulpur Apprentice Recruitment 2026: Apply Online Post Date: 19-01-2026 Short Description: INDIAN FARMERS FERTILISER COOPERATIVE LIMITED : Apprentice Recruitment Official Notification is released and Online Form Now Started on 15 January 2026 to 29 January 2026 is Last Date . IFFCO Apprentice Recruitment Examination, 2026 Vacancy 2026 Full Notification available at the official website. All the candidates can now check the detailed notification of IFFCO Recruitment 2026 Jobs. Age Limit ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "19-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-19T23:44:40.447916",
      "links": []
    },
    {
      "id": "a44595c5c07652f52f1e6fdb6a9db73d",
      "title": "RBI Notification 2026 - Apply Offline for Bank Medical Consultant Posts",
      "url": "https://allgovernmentjobs.in/rbi-notification-2026-apply-offline-for-bank-medical-consultant-posts/38560",
      "source": "allgovernmentjobs.in",
      "description": "The Reserve Bank of India (RBI) has officially released the notification to fill the vacancies of 01 Banks Medical Consultant Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their MBBS can apply for the RBI Notification 2026. The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, selection process, application fee, salary, and h...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "13-02-2026",
        "found_date": "19-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-20T23:46:52.667560",
      "links": []
    },
    {
      "id": "dd4291919d5d7bda8e4ec4c9df5590b9",
      "title": "IIAP Notification 2026 - Walk-in interview for 03 Design & Analysis Engineer Posts",
      "url": "https://allgovernmentjobs.in/iiap-notification-2026-walk-in-interview-for-03-design-analysis-engineer-posts/38557",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Astrophysics (IIAP) has officially released the notification to fill the vacancies of 03 Design & Analysis Engineer Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, M.E./M. Tech in Electronics, Mechanical Engineering, M.Sc can apply for the IIAP Notification 2026. The interested applicants can attend the interview. Here we have mentioned th...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "10-02-2026",
        "found_date": "19-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-20T23:46:52.667587",
      "links": []
    },
    {
      "id": "133c343b46810970c9745de123711037",
      "title": "IIT Mandi",
      "url": "https://allgovernmentjobs.in/iit-mandi-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology, Mandi (IIT Mandi) has officially released the notification to fill the vacancies of .... The Indian Institute of Technology Mandi (IIT Mandi) has officially released the notification to fill the vacancies of 3 .... The Indian Institute of Technology Mandi (IIT Mandi) has officially released the notification to fill the vacancies .... Indian Institute of Technology Mandi (IIT Mandi) has declared the official notification for 2025. To fill up the vacanci .......",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-20T23:46:52.673373",
      "links": []
    },
    {
      "id": "1199d94c19aaeef90166d255ced7dc58",
      "title": "Central Bank of India",
      "url": "https://allgovernmentjobs.in/central-bank-of-india-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Central Bank of India has officially released the notification to fill the vacancies of 350 Marketing Officer a .... The Central Bank of India (CBI) has officially released the notification to fill the vacancies of 01 Attendant Posts. In ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-20T23:46:52.673465",
      "links": []
    },
    {
      "id": "485f4fe8d68e0abc6622c76707406f53",
      "title": "E-courts",
      "url": "https://allgovernmentjobs.in/e-courts-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The High Court of Telangana (Telangana High Court) has officially released the notification to fill the vacancies o .... Kamrup District Court has declared the official notification for 2025. To fill up the vacancies for various Driver .... District Legal Services Authority (DLSA) Darrang has declared the official notification for 2025. To fill up the vacanci .... The Karnataka High Court has declared the official notification for 2025. To fill up the vacancies for 02 Law Resea .... Faridabad...",
      "pdf_link": null,
      "important_dates": {},
      "category": "SSC",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2026-01-20T23:46:52.673488",
      "links": []
    },
    {
      "id": "e92d390b0437c55a190eccbd57f89457",
      "title": "BCECEB",
      "url": "https://allgovernmentjobs.in/bceceb-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Bihar Combined Entrance Competitive Examination Board (BCECEB) has officially released the notification to fill the ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-20T23:46:52.673510",
      "links": []
    },
    {
      "id": "3f99175db81f2d4bf8294da0b26f46bf",
      "title": "Ministry of AYUSH",
      "url": "https://allgovernmentjobs.in/ministry-of-ayush-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Ayush Mission, Dadra & Nagar Haveli, and Daman & Diu (NAM DNH & DD) has officially release .... National AYUSH Mission Kerala (NAM Kerala) has declared the official notification for 2026. To fill up the vacancies for .... National Ayush Mission Kerala (NAM Kerala) has declared the latest notification for 2026. To fill up the various vacanci .... National Ayush Mission (NAM Kerala) has declared the official notification for 2025. To fill up the vacancies for 04&nbs .... The Nation...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Teaching",
      "skills": [],
      "scraped_at": "2026-01-20T23:46:52.673542",
      "links": []
    },
    {
      "id": "8f87ada7c4f2c876ae05087664f701b2",
      "title": "CSPGCL Notification 2026 - Apply Offline for 245 Apprentice Posts",
      "url": "https://allgovernmentjobs.in/cspgcl-notification-2026-apply-offline-for-245-apprentice-posts/38576",
      "source": "allgovernmentjobs.in",
      "description": "The Chhattisgarh State Power Generation Company Limited (CSPGCL) has officially released the notification to fill the vacancies of 245 Graduate Apprentices, Diploma Apprentices, and Trade Apprentices. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their ITI, Any Degree, B.E./B. Tech, Diploma in Mechanical, Electrical, and Civil Engineering, can apply for the CSPGCL Notification 2026. The ...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "20-02-2026",
        "found_date": "20-01-2026"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2026-01-21T23:49:49.986064",
      "links": []
    },
    {
      "id": "13767e2f775fcf83bac575659ec1b8b9",
      "title": "GBPUAT",
      "url": "https://allgovernmentjobs.in/gbpuat-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Gobind Ballabh Pant University of Agriculture and Technology (GBPUAT) has officially released the notification to fi .... Govind Ballabh Pant University of Agriculture and Technology (GBPUAT) has announced the official notification for 2026. .... Govind Ballabh Pant University of Agriculture and Technology (GBPUAT) has declared the official notification for 20 .... Govind Ballabh Pant University of Agriculture and Technology (GBPUAT) has announced the official notification for 2025. ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-21T23:49:49.991734",
      "links": []
    },
    {
      "id": "6ec13a612d2a704f29025a6a4e8d2793",
      "title": "RGSSH",
      "url": "https://allgovernmentjobs.in/rgssh-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Rajiv Gandhi Super Speciality Hospital (RGSSH) has officially released the notification to fill the vacancies of 14 .... The Rajiv Gandhi Super Speciality Hospital (RGSSH) has officially released the notification to fill the vacancies of 33 .... The Rajiv Gandhi Super Specialty Hospital (RGSSH) has officially released the notification to fill the vacancies of 47 S .... The Rajiv Gandhi Super Specialty Hospital (RGSSH) has officially released the notification to fill the vacancies of 26 J ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-01-21T23:49:49.991760",
      "links": []
    },
    {
      "id": "870cd83d64c9128cc6747c56de264a86",
      "title": "CSPGCL",
      "url": "https://allgovernmentjobs.in/cspgcl-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Chhattisgarh State Power Generation Company Limited (CSPGCL) has officially released the notification to fill the va .... The Chhattisgarh State Power Distribution Company (CSPDCL) has officially released the notification to fill the vacancie .... The Chhattisgarh State Power Distribution Company (CSPDCL) has officially released the notification to fill the vacancie ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-21T23:49:49.991829",
      "links": []
    },
    {
      "id": "90c7a7b99b66d90978fb9ffe74893f36",
      "title": "KIIFB",
      "url": "https://allgovernmentjobs.in/kiifb-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Kerala Infrastructure Investment Fund Board (KIIFB) has officially released the notification to fill the vacancies o .... The Kerala Infrastructure Investment Fund Board (KIIFB) has officially released the notification to fill the vacancies o .... Kerala Infrastructure Investment Fund Board (KIIFB) has declared the official notification for 2025. To fill up the .... The Kerala Infrastructure Investment Fund Board (KIIFB) has officially released the notification to fill the vacancies o ......",
      "pdf_link": null,
      "important_dates": {},
      "category": "General",
      "skills": [],
      "scraped_at": "2026-01-21T23:49:49.991872",
      "links": []
    },
    {
      "id": "f120c98ae3d2e4e4b4f80edc884dbd25",
      "title": "Department of Animal Husbandry and Dairying",
      "url": "https://allgovernmentjobs.in/department-of-animal-husbandry-and-dairying-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Guru Angad Dev Veterinary and Animal Sciences University (GADVASU) has officially released the notification to fill .... The National Dairy Development Board (NDDB) has announced the official notification for 2026. To fill up the vacancies f .... Department of Animal Husbandry, Himachal Pradesh (Department of Animal Husbandry HP) has released the official notificat .... Guru Angad Dev Veterinary and Animal Sciences University (GADVASU) has published the official notification for 2025 .......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-01-21T23:49:49.991959",
      "links": []
    },
    {
      "id": "c9ed97cfcb936205e60a8df5fb59c4b2",
      "title": "HPRCA Notification 2026 - Apply Online for 234 Junior Office Assistant Posts",
      "url": "https://allgovernmentjobs.in/hprca-notification-2026-apply-online-for-234-junior-office-assistant-posts/38600",
      "source": "allgovernmentjobs.in",
      "description": "The Himachal Pradesh Rajya Chayan Aayog (HPRCA) has officially released the notification to fill the vacancies of 234 Junior Office Assistant Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their 10th pass, ITI, 12th, and Diploma can apply for the HPRCA Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, sel...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "27-02-2026",
        "found_date": "27-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-22T23:45:22.464280",
      "links": []
    },
    {
      "id": "3464a0d1c7ededae2a7d64d529649ec4",
      "title": "IRCTC Notification 2026 - Walk-in interview for 43 Hospitality Monitors Posts",
      "url": "https://allgovernmentjobs.in/irctc-notification-2026-walk-in-interview-for-43-hospitality-monitors-posts/38598",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Railway Catering and Tourism Corporation (IRCTC) has officially released the notification to fill the vacancies of 43 Hospitality Monitors Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Any Degree, B.Sc., or MBA can apply for the IRCTC Notification 2026. The interested applicants can attend the walk-in interview. Here we have mentioned the education details, age li...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "05-03-2026",
        "found_date": "21-01-2026"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2026-01-22T23:45:22.464317",
      "links": []
    },
    {
      "id": "a2b2c85c74e6579cfae95e827d31cb0c",
      "title": "ECHS Notification 2026 - Apply Offline for 23 Chowkidar, Medical Officer and Other Posts",
      "url": "https://allgovernmentjobs.in/echs-notification-2026-apply-offline-for-23-chowkidar-medical-officer-and-other-posts/38597",
      "source": "allgovernmentjobs.in",
      "description": "The Ex-Servicemen Contributory Health Scheme (ECHS) has officially released the notification to fill the vacancies of 23 Medical Officers, Dental Officers, Pharmacists, Nursing Assistants, Chowkidars, Safaiwalas, and Drivers. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their MBBS, BDS, B. Pharm, 12th, DMLT, GNM, B.Sc Nursing, and 8th can apply for the ECHS Notification 2026. The intere...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "12-02-2026",
        "found_date": "22-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-22T23:45:22.464334",
      "links": []
    },
    {
      "id": "a693b3fc15cdb09df60bc676e035ebe0",
      "title": "HPPSC",
      "url": "https://allgovernmentjobs.in/hppsc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Himachal Pradesh Rajya Chayan Aayog (HPRCA) has officially released the notification to fill the vacancies of 234 Ju .... The Himachal Pradesh Rajya Chayan Aayog (HPRCA) has officially released the notification to fill the vacancies of 312 St .... The District Red Cross Society, Kangra (DRCS Kangra) has officially released the notification to fill the vacancies of 0 .... Indian Red Cross Society (IRCS) Kullu has declared the official notification for 2025. To fill up the vacancies for 04&...",
      "pdf_link": null,
      "important_dates": {},
      "category": "General",
      "skills": [],
      "scraped_at": "2026-01-22T23:45:22.469576",
      "links": []
    },
    {
      "id": "4264983919f246ed85dd920d7fa30704",
      "title": "IRCTC",
      "url": "https://allgovernmentjobs.in/irctc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Railway Catering and Tourism Corporation (IRCTC) has officially released the notification to fill the vacanci .... The Indian Railway Catering and Tourism Corporation (IRCTC) has officially released the notification to fill the vacanci .... The Indian Railway Catering and Tourism Corporation (IRCTC) has officially released the notification to fill the vacanci .... Indian Railway Catering and Tourism Corporation (IRCTC) has declared the official notification for 2025. To fill up the...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-22T23:45:22.469595",
      "links": []
    },
    {
      "id": "fbe8a2bf1996d3ab2b43bd4eafe20ce2",
      "title": "RITES",
      "url": "https://allgovernmentjobs.in/rites-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Rail India Technical and Economic Service (RITES) has officially released the notification to fill the vacancies of .... The Rail India Technical and Economic Service (RITES) has officially released the notification to fill the vacancie .... The Rail India Technical and Economic Services (RITES) has officially released the notification to fill the vacancies of .... Rail India Technical and Economic Service (RITES) has declared the latest job notification for 2025. To fill up the vaca .......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2026-01-22T23:45:22.469635",
      "links": []
    },
    {
      "id": "4b6824cfdd13eac6c7cf7771ee6a1ba9",
      "title": "GSSSB",
      "url": "https://allgovernmentjobs.in/gsssb-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Gujarat Secondary Service Selection Board (GSSSB) has officially released the notification to fill the vacancies of .... The Gujarat Secondary Service Selection Board (GSSSB) has officially released the notification to fill the vacancies of .... The Gujarat Secondary Service Selection Board (GSSSB) has officially released the notification to fill the vacancies of .... The Gujarat Secondary Service Selection Board (GSSSB) has officially released the notification to fill the vacancies of .....",
      "pdf_link": null,
      "important_dates": {},
      "category": "General",
      "skills": [],
      "scraped_at": "2026-01-22T23:45:22.469652",
      "links": []
    },
    {
      "id": "d161bc0c67594cf587e563fe854ba278",
      "title": "MHSRB",
      "url": "https://allgovernmentjobs.in/mhsrb-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Andhra Pradesh Medical Services Recruitment Board (APMSRB) has officially released the notification to fill the vaca .... The Andhra Pradesh Medical Services Recruitment Board (APMSRB) has officially released the notification to fill the vaca .... The Medical and Health Recruitment Board Assam (MHRB Assam) has officially released the notification to fill the vacanci .... The Medical Services Recruitment Board Tamilnadu (MRB Tamilnadu) has officially released the notification to fill the v...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-01-22T23:45:22.469668",
      "links": []
    },
    {
      "id": "e00e623fc1b31ef4eaa1ec6ba2bd4b23",
      "title": "NIRDPR",
      "url": "https://allgovernmentjobs.in/nirdpr-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Rural Development and Panchayati Raj (NIRDPR) has officially released the notification to fill .... National Institute of Rural Development and Panchayati Raj (NIRDPR) has declared the official notification for 2025. To .... National Institute of Rural Development and Panchayati Raj (NIRDPR) has announced the official notification for 2025. To .... The National Institute of Rural Development and Panchayati Raj (NIRDPR) has declared the official notification for 2025....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-22T23:45:22.469684",
      "links": []
    },
    {
      "id": "31b76ebfb3605a9155ac00a89565681b",
      "title": "Bihar Police Sub Inspector Prohibition Online Form 2026",
      "url": "https://www.rojgarresult.com/bihar-police-sub-inspector-prohibition-2026/",
      "source": "www.rojgarresult.com",
      "description": "BPSSC Sub Inspector SI Prohibition Recruitment 2026 Apply Online for 78 Post Post Update Date: 22-01-2026 Short Description: Bihar Police Subordinate Services Commission BPSSC has released the advertisement Advt. No.-03/2026: For Selection of Sub-Inspector Prohibition in Prohibition, Excise & Registration Dept., Govt. of Bihar . Those Candidates Are Interested with BPSSC SI Prohibition Can Apply Online from 27/01/2026 to 27/02/2026. For other information related to Bihar Police SI Prohibition...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "27/02/2026",
        "found_date": "22-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-22T23:45:46.156851",
      "links": []
    },
    {
      "id": "784a254b7270362224b5c5c448a819c2",
      "title": "Bihar BTSC JE Junior Engineer Online Form 2025 Date Extended",
      "url": "https://www.rojgarresult.com/bihar-btsc-je-junior-engineer-2025/",
      "source": "www.rojgarresult.com",
      "description": "Bihar BTSC JE Junior Engineer Recruitment 2025: Apply for 2809 Post Post Date: 13-12-2025 Short Description: Bihar BTSC JE Junior Engineer Online Form 2025: Bihar Technical Service Commission has announced recruitment for 2809 Posts of BTSC Bihar JE Junior Engineer Vacancy 2025. Candidates who want to apply online can apply from the link given on Rojgar Result. Bihar Lab Technician Online Form 2025 can be filled from 05 December to 12 January 2026. . More Other Recruitment / Syllabus / Admit ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-12-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-22T23:45:46.156867",
      "links": []
    },
    {
      "id": "b05e3214724f8ab7a4858e6d01e0d34e",
      "title": "Central Bank Specialist Officer Online Form 2026",
      "url": "https://www.rojgarresult.com/central-bank-specialist-officer-2026/",
      "source": "www.rojgarresult.com",
      "description": "Central Bank Specialist Officer Recruitment 2026: Apply Online for 350 Post Post Update Date: 22 -01-2026 Short Description: Central Bank Specialist Officer Online form 2026 for 350 Post: Central Bank of India GO Official Notification is released and Online Form Now Started on 20 January to 03 February 2026 is Last Date for Central Bank Specialist Officer Online form 2026 , Vacancy 2026 Full Notification available at the official website. All the candidates can now check the detailed notifica...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "18/02/2026",
        "found_date": "20/01/2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-22T23:45:46.156883",
      "links": []
    },
    {
      "id": "671bd1a1c8382dbc7a4acf5c4c244eae",
      "title": "RRB Railway Group D Online Form 2026",
      "url": "https://www.rojgarresult.com/rrb-group-d-2026/",
      "source": "www.rojgarresult.com",
      "description": "RRB Railway Group D Various Posts of Level-1 CEN 09/2025 Recruitment 2026: Apply Online for 22000 Post Post Update Date: 22-01-2026 Short Description: RRB Railway Group D Various Post Level – 1 CEN 09/2025 Apply Online for 22000 Post : Railway Recruitment Board RRB Group D Level 1 CEN 09/2025 Official Notification is Released and Online Form Now Started on 31 January 2026 to 02 March 2026 is Last Date for RRB Group D Level 1 Examination, Vacancy 2025 Full Notification available at the officia...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "02/03/2026",
        "found_date": "22-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-22T23:45:46.156902",
      "links": []
    },
    {
      "id": "518ffd2970c10a19aa902b0d901bdb2a",
      "title": "HPSC Assistant Engineer Civil Group B Online Form 2026 for 50 Post",
      "url": "https://www.rojgarresult.com/hpsc-assistant-engineer-2026/",
      "source": "www.rojgarresult.com",
      "description": "HPSC Assistant Engineer Recruitment 2026: Apply for Civil Group B 50 Post Post Update Date: 09-01-2026 Short Description: HPSC Assistant Engineer Group B Online Form 2026: Haryana Public Service Commission has announced recruitment for 50 Posts of Haryana PSC Assistant Engineer Group B. Candidates who want to apply online can apply from the link given on Rojgar Result. Haryana Assistant Engineer Online Form 2026 can be filled from 13 January 2026 to 12 Febuary2026. More Other Recruitment / Sy...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "09-01-2026"
      },
      "category": "Banking",
      "skills": [
        "Hindi"
      ],
      "scraped_at": "2026-01-22T23:45:46.156918",
      "links": []
    },
    {
      "id": "925584f0e7ce8ae55da8f7fc8456dc6b",
      "title": "NHSRC Notification 2026 - Apply Online for Senior Consultant Posts",
      "url": "https://allgovernmentjobs.in/nhsrc-notification-2026-apply-online-for-senior-consultant-posts/38614",
      "source": "allgovernmentjobs.in",
      "description": "The National Health Systems Resource Centre (NHSRC) has officially released the notification to fill the vacancies of 01 Senior Consultant Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their MBBS, MBA, Post-graduation, PGDM can apply for the NHSRC Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selecti...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "10-02-2026",
        "found_date": "21-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-23T23:45:00.562035",
      "links": []
    },
    {
      "id": "a32787b1b873241d61472fe95cacc699",
      "title": "ECHS Notification 2026 - Apply Offline for 172 Clerk, Medical Officer and Other Posts",
      "url": "https://allgovernmentjobs.in/echs-notification-2026-apply-offline-for-172-clerk-medical-officer-and-other-posts/38613",
      "source": "allgovernmentjobs.in",
      "description": "The Ex-Servicemen Contributory Health Scheme (ECHS) has officially released the notification to fill the vacancies of 172 Medical Officers, Dental Officers, Pharmacists, Lab Technicians, Nursing Assistants, Peons, and Chowkidars. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their MBBS, BDS, B. Pharm, D. Pharm, 12th, 08th, DMLT, B.Sc Nursing, Any Degree, MD/MS can apply for the ECHS Noti...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "10-02-2026",
        "found_date": "23-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-23T23:45:00.562060",
      "links": []
    },
    {
      "id": "cc345f7f89250593e6641c2afc49cf37",
      "title": "UCIL Notification 2026 - Apply Online for 364 Apprentice Posts",
      "url": "https://allgovernmentjobs.in/ucil-notification-2026-apply-online-for-364-apprentice-posts/38610",
      "source": "allgovernmentjobs.in",
      "description": "The Uranium Corporation of India Limited (UCIL) has officially released the notification to fill the vacancies of 364 Graduate Apprentices, Diploma Apprentices, and Trade Apprentices. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their 10th pass, ITI, Diploma, B.E./B. Tech in Electrical,  Mechanical, Civil Engineering, MBA, LLB, and any degree can apply for the UCIL Notification 2026. Th...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "28-02-2026",
        "found_date": "01-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-23T23:45:00.562079",
      "links": []
    },
    {
      "id": "24adc874035b34655ddf714e8e96d995",
      "title": "NHSRC",
      "url": "https://allgovernmentjobs.in/nhsrc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Health Systems Resource Centre (NHSRC) has officially released the notification to fill the vacancies of 01 .... The National Health System Resource Centre (NHSRC) has officially released the notification to fill the vacancies of 02 .... The National Health Systems Resource Centre (NHSRC) has declared the official notification for 2025. To fill up the vaca .... The National Health Systems Resource Centre (NHSRC) has declared the official notification for 2025. To fill up the ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-01-23T23:45:00.567141",
      "links": []
    },
    {
      "id": "2ee80025e69fb1115ffcbc2749d1f578",
      "title": "ISRO SAC Jobs 2026 - Apply Online for 49 Scientist/ Engineer Posts",
      "url": "https://allgovernmentjobs.in/isro-sac-jobs-2026-apply-online-for-49-scientist-engineer-posts/38615",
      "source": "allgovernmentjobs.in",
      "description": "The Space Applications Centre (ISRO SAC) has officially released the notification to fill the vacancies of 49 Scientist/ Engineer Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. candidates who have completed their B.E./B. Tech, M.E./M. Tech, B.Sc, and M.Sc. can apply for the ISRO SAC Jobs 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection ...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "12-02-2026",
        "found_date": "23-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-23T23:45:00.572374",
      "links": []
    },
    {
      "id": "0db9cb070f15fcf797a8ee33c7ac4332",
      "title": "NIT Jalandhar Jobs 2026 - Apply Online for 101 Faculty Posts",
      "url": "https://allgovernmentjobs.in/nit-jalandhar-jobs-2026-apply-online-for-101-faculty-posts/38608",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technology Jalandhar (NIT Jalandhar) has officially released the notification to fill the vacancies of 101 Assistant Professor, Associate Professor, and Professor Jobs. Interested anbd eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, M.E./M. Tech, Ph.D., can apply for the NIT Jalandhar Jobs 2026. The interested applicants can apply in online mode. Here we have...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "27-02-2026",
        "found_date": "22-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-23T23:45:00.572411",
      "links": []
    },
    {
      "id": "1d1d2e6b390693723d4a5363317cbc80",
      "title": "Rajasthan RSSB LDC, Jr Assistant Online Form 2026",
      "url": "https://www.rojgarresult.com/rajasthan-ldc-online-form/",
      "source": "www.rojgarresult.com",
      "description": "Rajasthan RSSB LDC / Jr Assistant Recruitment 2026: Apply Online for 10644 Post Post Update Date: 21-01-2026 Short Description: The Rajasthan Staff Selection Board (RSSB) has released the RSSB LDC/Jr Assistant Online Form 2026 for a total of 10644 posts . The online application process will begin on 15 January 2026 , and the last date to apply and complete the form is 13 February 2026 . Candidates can make corrections in the application form as per the official schedule . The Rajasthan RSSB L...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "13/02/2026",
        "found_date": "21-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-23T23:45:23.618742",
      "links": []
    },
    {
      "id": "ef58ab45d9801e4e6edc36135a285012",
      "title": "Rajasthan RIICO Various Post Online Form 2026",
      "url": "https://www.rojgarresult.com/riico-various-post-2026/",
      "source": "www.rojgarresult.com",
      "description": "Rajasthan RIICO Various Post Recruitment 2026 Apply Online for 98 Post Post Update Date: 23-01-2026 Short Description: RAJASTHAN STATE INDUSTRIAL DEVELOPMENT AND INVESTMENT CORPORATION LIMITED RIICO has released the advertisement Advt. No. A.1(8)378/02/2025: For Selection of RAJASTHAN STATE INDUSTRIAL DEVELOPMENT AND INVESTMENT CORPORATION LIMITED . Those Candidates Are Interested with RIICO Various Post for 98 Post Can Apply Online from 21/01/2026 to 20/02/2026. For other information related...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "07/03/2026",
        "found_date": "23-01-2026"
      },
      "category": "Banking",
      "skills": [
        "English",
        "Hindi"
      ],
      "scraped_at": "2026-01-23T23:45:23.618759",
      "links": []
    },
    {
      "id": "5f277ad184e16f5c67bde66e8c201fd2",
      "title": "HSSC Haryana Police Constable Online Form 2026 for 5500 Post",
      "url": "https://www.rojgarresult.com/hssc-advt-01-2026/",
      "source": "www.rojgarresult.com",
      "description": "HSSC Haryana Constable  (MALE, FEMALE & GRP) Recruitment 2026 : Apply Online Form Post Update Date: 06-01-2026 Short Description: Haryana Police Constable Recruitment 2026 Apply Online Form : Haryana Constable Online Form 2026, Notification has been released on the website https://hssc.gov.in/ & Application Form now started on 11/01/2026 to 25/01/2026. Haryana Staff Selection Commission Jobs 2026. Get the direct link to download notification link available on HSSC Haryana Police Constable Rec...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "06-01-2026"
      },
      "category": "Banking",
      "skills": [
        "Hindi"
      ],
      "scraped_at": "2026-01-23T23:45:23.618776",
      "links": [
        "https://hssc.gov.in/"
      ]
    },
    {
      "id": "0d69326280401635e8720a11f5f1fe62",
      "title": "RVNL Notification 2026 - Apply Offline for Executive Director Posts",
      "url": "https://allgovernmentjobs.in/rvnl-notification-2026-apply-offline-for-executive-director-posts/38636",
      "source": "allgovernmentjobs.in",
      "description": "The Rail Vikas Nigam Limited (RVNL) has officially released the notification to fill the vacancies of 01 Executive Director Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Civil Engineering can apply for the RVNL Notification 2026. The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, selection process, ap...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "13-02-2026",
        "found_date": "24-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-24T23:43:33.507193",
      "links": []
    },
    {
      "id": "45640e8af742c6a4d368d4511a2d7f4b",
      "title": "CSB Notification 2026 - Apply Online for 28 Scientist B Posts",
      "url": "https://allgovernmentjobs.in/csb-notification-2026-apply-online-for-28-scientist-b-posts/38628",
      "source": "allgovernmentjobs.in",
      "description": "The Central Silk Board (CSB) has officially released the notification to fill the vacancies of 28 Scientist B Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech can apply for the CSB Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process, application fee, salary, and how to appl...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "18-02-2026",
        "found_date": "19-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-24T23:43:33.507235",
      "links": []
    },
    {
      "id": "dde74b164437063db8eaece5f50dabca",
      "title": "NIPER",
      "url": "https://allgovernmentjobs.in/niper-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Pharmaceutical Education and Research, Ahmedabad (NIPER Ahmedabad) has officially released the .... National Institute of Pharmaceutical Education and Research (NIPER Kolkata) has declared the official notification for 2 .... National Institute of Pharmaceutical Education and Research Guwahati (NIPER Guwahati) has declared the official notifica .... The National Institute of Pharmaceutical Education and Research, Ahmedabad (NIPER Ahmedabad) has officially released th...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Teaching",
      "skills": [],
      "scraped_at": "2026-01-24T23:43:33.513013",
      "links": []
    },
    {
      "id": "9a58c634c4643a8dda69ee2de84ba4d8",
      "title": "Indian Bank",
      "url": "https://allgovernmentjobs.in/indian-bank-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Bank has officially released the notification to fill the vacancies of 01 Authorised Doctor Posts. Interested .... The Indian Bank has officially released the notification to fill the vacancies of 01 Faculty Posts. Interested and eligi .... Indian Bank has declared the official notification for 2025. To fill up the vacancies for Dealer Jobs. Those candid .... The Indian Bank has released the official notification for 2025. To fill up the vacancies for Financial Literacy Co ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-24T23:43:33.513048",
      "links": []
    },
    {
      "id": "80d21766749cca39938f5d91bbbf0f79",
      "title": "NEIGRIHMS",
      "url": "https://allgovernmentjobs.in/neigrihms-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The North Eastern Indira Gandhi Regional Institute of Health and Medical Sciences (NEIGRIHMS) has officially released th .... The North Eastern Indira Gandhi Regional Institute of Health and Medical Sciences (NEIGRIHMS) has officially released th .... The North Eastern Indira Gandhi Regional Institute of Health & Medical Sciences (NEIGRIHMS) has officially released ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-01-24T23:43:33.513070",
      "links": []
    },
    {
      "id": "8bb5b01efd6dce033aa301dc946e868e",
      "title": "JKSSB",
      "url": "https://allgovernmentjobs.in/jkssb-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Jammu and Kashmir Services Selection Board (JKSSB) has officially released the notification to fill the vacancies of .... Jammu and Kashmir Services Selection Board (JKSSB) has declared the official notification for 2026. To fill up the vacan .... Jammu and Kashmir Services Selection Board (JKSSB) has declared the official notification for 2025. To fill up the vacan .... The Jammu and Kashmir Services Selection Board (JKSSB) has officially released the notification to fill the vacancies o...",
      "pdf_link": null,
      "important_dates": {},
      "category": "General",
      "skills": [],
      "scraped_at": "2026-01-24T23:43:33.513200",
      "links": []
    },
    {
      "id": "a8f9b97e408f8afcb99de8af2b3e51f7",
      "title": "NEIGRIHMS Jobs 2026 - Apply Online for 02 Project Nurse, Project Technical Support Posts",
      "url": "https://allgovernmentjobs.in/neigrihms-jobs-2026-apply-online-for-02-project-nurse-project-technical-support-posts/38633",
      "source": "allgovernmentjobs.in",
      "description": "The North Eastern Indira Gandhi Regional Institute of Health and Medical Sciences (NEIGRIHMS) has officially released the notification to fill the vacancies of 02 Project Nurse and Project Technical Support Jobs. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who completed their GNM, Diploma, and 12th can apply for the NEIGRIHMS Jobs 2026. The interested applicants can apply in online mode. Here we have men...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "15-02-2026",
        "found_date": "24-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-24T23:43:33.519018",
      "links": []
    },
    {
      "id": "c409ba57a5c5da6ab33f2e974d5d1b1c",
      "title": "NIMHANS",
      "url": "https://allgovernmentjobs.in/nimhans-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Mental Health and Neuro Sciences (NIMHANS) has officially released the notification to fill th .... The National Institute of Mental Health and Neuro Sciences (NIMHANS) has declared the official notification 2026. To fil .... The National Institute of Mental Health and Neurosciences (NIMHANS) has officially released the notification to fill the .... The National Institute of Mental Health and Neurosciences (NIMHANS) has officially released the notification to fill th...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-01-25T23:44:14.266123",
      "links": []
    },
    {
      "id": "0e29a012089b5033c98e301a298a57e3",
      "title": "RRB Railway Group D Admit Card 2025",
      "url": "https://www.rojgarresult.com/railway-rrb-group-d-2025/",
      "source": "www.rojgarresult.com",
      "description": "Railway RRB Group D 08/2024 Exam City Details / Admit Card 2025 Post Update Date: 24-12-2025 Short Description: Railway RRB Group D Exam City / Admit Card 2025 : RRB Railway Group D Online Form 2025, Notification has been released on the website @https://indianrailways.gov.in/ & Application Form now started on 23 rd Jan’25 for Railway Recruitment Board Jobs 2025. Get the direct link to download notification link available on Railway RRB Group D Vacancy 2025 Official Website and More Other Det...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "24-12-2025"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-26T23:47:31.681817",
      "links": [
        "https://indianrailways.gov.in/"
      ]
    },
    {
      "id": "5bced667e4ba1f803cc881dea91e62e4",
      "title": "Rajasthan RSSB Lab Assistant Online Form 2026",
      "url": "https://www.rojgarresult.com/rssb-lab-assistant-2026/",
      "source": "www.rojgarresult.com",
      "description": "Rajasthan Staff Selection Board RSSB Lab Assistant Recruitment 2026 Apply Online for 804 Post Post Update Date: 26-01-2026 Short Description: RSSB RSMSSB has released the Lab Assistant Advt No 05/2026 Notification 2026. Those candidates who are interested in this Rajasthan Lab Assistant Recruitment 2026 Exam can Apply Online from 27 January 2026 to 25 February 2026. Read the notification for RSSB Lab Assistant Exam, eligibility, Subject Details information, Document Required, age limit, How t...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "25/02/2026",
        "found_date": "26-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-26T23:47:31.682049",
      "links": []
    },
    {
      "id": "591a7897ba8896d2126aa256bcf44aed",
      "title": "NIELIT Recruitment 2026 - Apply Online for 04 Staff Car Driver Posts",
      "url": "https://allgovernmentjobs.in/nielit-recruitment-2026-apply-online-for-04-staff-car-driver-posts/38679",
      "source": "allgovernmentjobs.in",
      "description": "National Institute of Electronics & Information Technology (NIELIT) has declared the official notification for 2026. To fill up the vacancies for 04 Staff Car Driver Jobs. Those candidates who have qualified in the 10th Pass can grab this chance and apply for the NIELIT Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply online before the last date of appl...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "26-02-2026",
        "found_date": "28-01-2026"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2026-01-27T23:46:58.302233",
      "links": []
    },
    {
      "id": "a4ef84f1a86d48039f203feccda4cf6a",
      "title": "AAI Recruitment 2026 - Apply Offline for Medical Consultant Posts",
      "url": "https://allgovernmentjobs.in/aai-recruitment-2026-apply-offline-for-medical-consultant-posts/38678",
      "source": "allgovernmentjobs.in",
      "description": "The Airports Authority of India (AAI) has declared the official notification for 2026. To fill up the vacancies for Medical Consultant Jobs. Those candidates who have qualified in the MBBS can grab this chance and apply for these posts. Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for the AAI Recruitment 2026 . Interested candidates can apply before the last date of application. If you are looking for more, here is ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "16-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-27T23:46:58.302264",
      "links": []
    },
    {
      "id": "66382bdd443b1da25900917795c5f33d",
      "title": "IIT Gandhinagar Recruitment 2026 - Apply Offline for Post Doctoral Fellow Posts",
      "url": "https://allgovernmentjobs.in/iit-gandhinagar-recruitment-2026-apply-offline-for-post-doctoral-fellow-posts/38675",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology Gandhinagar (IIT Gandhinagar) has declared the official notification for 2026. To fill up the vacancies for Post-Doctoral Fellow Jobs. Those candidates who have qualified in the Post Graduation, Ph.D can grab this chance and apply for the IIT Gandhinagar Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the lastdate ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "10-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-27T23:46:58.302285",
      "links": []
    },
    {
      "id": "d1404daf16104642b735cb81fcd71eea",
      "title": "Punjab University Recruitment 2026 - Walk-in-Interview for 02 Research Investigator Posts",
      "url": "https://allgovernmentjobs.in/punjab-university-recruitment-2026-walk-in-interview-for-02-research-investigator-posts/38674",
      "source": "allgovernmentjobs.in",
      "description": "Punjab University has declared the official notification for 2026. To fill up the vacancies for 02 Research Investigator Jobs. Those candidates who have qualified in the M.Sc can grab this chance and apply for the Punjab University Recruitment 2026 . Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can attend the walk-in at the address given below. If you are looking for more, here ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "28-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-27T23:46:58.302305",
      "links": []
    },
    {
      "id": "abb0f774dd3bee48602787abb27a91b6",
      "title": "IIT Madras Recruitment 2026 - Apply Online for Junior Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/iit-madras-recruitment-2026-apply-online-for-junior-research-fellow-posts/38672",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology (IIT Madras) has declared the official notification for 2026. To fill up the vacancies for Junior Research Fellow Jobs. Those candidates who have qualified in the B.E/ B.Tech., M.E/ M.Tech can grab this chance and apply for the IIT Madras Recruitment 2026 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply online before the last date of applica...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-27T23:46:58.302324",
      "links": []
    },
    {
      "id": "f258b377e0fe4585b34c8433f5605c19",
      "title": "NIELIT",
      "url": "https://allgovernmentjobs.in/nielit-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "National Institute of Electronics & Information Technology (NIELIT) has declared the official notification for 2026. .... The National Institute of Electronics and Information Technology (NIELIT) has officially released the notification to fi .... The National Institute of Electronics and Information Technology (NIELIT) has announced the official notification for 20 .... The National Institute of Electronics and Information Technology (NIELIT) has officially released the notification to fi .....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-27T23:46:58.302361",
      "links": []
    },
    {
      "id": "85db9b0483000624ba57e8d2bc717625",
      "title": "Panjab University",
      "url": "https://allgovernmentjobs.in/panjab-university-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Punjab University has declared the official notification for 2026. To fill up the vacancies for 02 Research Investigator .... Punjab University has declared the official notification for 2026. To fill up the vacancies for 02 Medical Officer .... Punjab University has declared the official notification for 2025. To fill up the vacancies for Project Technical S .... Punjab University has declared the latest job notification for 2025. To fill up the vacancies for Project Scientist .... Punjab Ag...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-01-27T23:46:58.302410",
      "links": []
    },
    {
      "id": "ea6c3e62931d3d5b20697fddeab94337",
      "title": "PGIMER",
      "url": "https://allgovernmentjobs.in/pgimer-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Postgraduate Institute of Medical Education and Research (PGIMER) has declared the official notification for 2026. To fi .... Postgraduate Institute of Medical Education and Research (PGIMER) has declared the official notification for 2026. To fi .... Postgraduate Institute of Medical Education and Research (PGIMER) has declared the official notification for 2026. To fi .... Postgraduate Institute of Medical Education and Research (PGIMER) has delivered the official notification for 2026. To ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-27T23:46:58.302458",
      "links": []
    },
    {
      "id": "64a89f55bd1abb2c046d649d0f20acf8",
      "title": "NRL Notification 2026 - Apply Online for 12 Deputy Associate Posts",
      "url": "https://allgovernmentjobs.in/nrl-notification-2026-apply-online-for-12-deputy-associate-posts/38719",
      "source": "allgovernmentjobs.in",
      "description": "The Numaligarh Refinery Limited (NRL) has officially released the notification to fill the vacancies of 12 Deputy Associate Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Mechanical Engineering can apply for the NRL Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process,...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "11-02-2026",
        "found_date": "22-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-28T23:52:10.988212",
      "links": []
    },
    {
      "id": "9f65147c67890c6bedd8a744e4d19ede",
      "title": "IARI Notification 2026 - Walk-in interview for Young Professional II Posts",
      "url": "https://allgovernmentjobs.in/iari-notification-2026-walk-in-interview-for-young-professional-ii-posts/38718",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Agricultural Research Institute (IARI) has officially released the notification to fill the vacancies of 01 Young Professional II Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Post-graduation can apply for the IARI Notification 2026. The interested applicants can attend the walk-in interview. Here we have mentioned the education details, age limit, selection proce...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "12-02-2026",
        "found_date": "28-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-28T23:52:10.988241",
      "links": []
    },
    {
      "id": "413c28edceb58f23b1032a3153e6128d",
      "title": "AIESL Notification 2026 - Apply Offline for Company Secretary Posts",
      "url": "https://allgovernmentjobs.in/aiesl-notification-2026-apply-offline-for-company-secretary-posts/38717",
      "source": "allgovernmentjobs.in",
      "description": "Air India Engineering Services Limited ( AIESL) has declared the official notification for 2026. To fill up the vacancies for the Company Secretary Jobs. Those candidates who have qualified in Any Degree can use this chance and apply for these posts. Here we listed more about the age limit, selection process, salary structure, education details, application fee, and how to apply for the AIESL Notification 2026 . Interested and eligible candidates can apply before the last date. If you are loo...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "16-02-2026",
        "found_date": "27-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-28T23:52:10.988262",
      "links": []
    },
    {
      "id": "e80085cef9ef46982c4ab7155f1a3d06",
      "title": "JNU Notification 2026 - Apply Offline for Pathologist Posts",
      "url": "https://allgovernmentjobs.in/jnu-notification-2026-apply-offline-for-pathologist-posts/38714",
      "source": "allgovernmentjobs.in",
      "description": "The Jawaharlal Nehru University (JNU) has officially released the notification to fill the vacancies of 01 Pathologist Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Post-graduation, MD/MS, DNB, or Diploma can apply for the JNU Notification 2026. The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, selection process, ap...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "10-02-2026",
        "found_date": "28-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-28T23:52:10.988286",
      "links": []
    },
    {
      "id": "60c5ed6e9032cc8c93a4298d7e317ecd",
      "title": "SDH Chandigarh Notification 2026 - Walk-in-Interview for Various Specialist Posts",
      "url": "https://allgovernmentjobs.in/sdh-chandigarh-notification-2026-walk-in-interview-for-various-specialist-posts/38711",
      "source": "allgovernmentjobs.in",
      "description": "Sub District Hospital (SDH Chandigarh) has declared the official notification for 2026. To fill up the vacancies for Specialist Jobs. Those candidates who have qualified in the MBBS, MD/MS, DND, and Diploma can grab this chance and apply for the SDH Chandigarh Notification 2026 . Here we mentioned more about the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can attend the walk-in at the address below...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "05-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-28T23:52:10.988306",
      "links": []
    },
    {
      "id": "567eb8b8a922d52240f697d9bf497d80",
      "title": "PAU Recruitment 2026 - Apply Offline for Junior Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/pau-recruitment-2026-apply-offline-for-junior-research-fellow-posts/38720",
      "source": "allgovernmentjobs.in",
      "description": "Punjab Agricultural University (PAU) has declared the official notification for 2026. To fill up the vacancies for Junior Research Fellow Jobs. Those candidates who have qualified in the B.E/ B.Tech, M.E/ M.Tech can grab this chance and apply for the PAU Recruitment 2026 . Here, we mentioned the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the last date of application. If you are lo...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "02-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-28T23:52:10.993930",
      "links": []
    },
    {
      "id": "1d9afa00ed6dba16c127e616b2c1e846",
      "title": "DCPU Chengalpattu Recruitment 2026 - Apply Offline for 02 Supervisor Posts",
      "url": "https://allgovernmentjobs.in/dcpu-chengalpattu-recruitment-2026-apply-offline-for-02-supervisor-posts/38715",
      "source": "allgovernmentjobs.in",
      "description": "District Child Protection Unit, Chengalpattu (DCPU Chengalpattu) has declared the official notification for 2026. To fill up the 02 vacancies for Supervisor Jobs. Those candidates who have qualified in Any Degree can use this chance and apply for the DCPU Chengalpattu Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply before the last date of ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "10-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-28T23:52:10.993954",
      "links": []
    },
    {
      "id": "a5b3e032f4807b820d3cb6243fe9be9d",
      "title": "AIESL",
      "url": "https://allgovernmentjobs.in/aiesl-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Air India Engineering Services Limited ( AIESL) has declared the official notification for 2026. To fill up the vacancie .... Air India Engineering Services Limited (AIESL) has declared the official notification for 2025. To fill up the vacancies ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2026-01-28T23:52:10.993990",
      "links": []
    },
    {
      "id": "804b9f093fbc4529b3067334e647b061",
      "title": "IIITDM",
      "url": "https://allgovernmentjobs.in/iiitdm-kancheepuram-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Information Technology Design and Manufacturing Jabalpur (IIITDM Jabalpur) has officially releas .... Indian Institute of Information Technology Design & Manufacturing (IIITDM Kancheepuram) has declared the official no .... The Indian Institute of Information Technology Design & Manufacturing Kancheepuram (IIITDM Kancheepuram) has officia .... The Indian Institute of Information Technology Design and Manufacturing Kurnool (IIITDM Kurnool) has officially released .... I...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Railway",
      "skills": [],
      "scraped_at": "2026-01-28T23:52:10.994011",
      "links": []
    },
    {
      "id": "8ff15d5f93e975690a5292eb948241e9",
      "title": "GMCH Chandigarh",
      "url": "https://allgovernmentjobs.in/gmch-chandigarh-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Sub District Hospital (SDH Chandigarh) has declared the official notification for 2026. To fill up the vacancies for&nbs .... Government Medical College and Hospital (GMCH Chandigarh) has declared the official notification for 2026. To fill up th .... Government Medical College and Hospital, Chandigarh (GMCH Chandigarh) has declared the official notification for 2026. T .... Government Medical College and Hospital, Chandigarh (GMCH Chandigarh) has announced the latest job notification for ......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Teaching",
      "skills": [],
      "scraped_at": "2026-01-28T23:52:10.994038",
      "links": []
    },
    {
      "id": "d09ff0699fab45e292bce6a1905744f3",
      "title": "National Chemical Laboratory",
      "url": "https://allgovernmentjobs.in/national-chemicallaboratory-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Chemical Laboratory, Pune (NCL Pune) has officially released the notification to fill the vacancies of 01 P .... The Hindustan Organic Chemicals Limited (HOCL) has officially released the notification to fill the vacancies of 75&nbsp ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-28T23:52:10.994080",
      "links": []
    },
    {
      "id": "2905ac6b1227431d861640b4992cfdb6",
      "title": "Ministry of Tribal Affairs",
      "url": "https://allgovernmentjobs.in/ministry-of-tribal-affairs-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Ministry of External Affairs announced the official notification for 2026. To fill up the vacancies for various&nbsp .... The Ministry of External Affairs has declared the official notification for 2025. To fill up the vacancies for Cons .... The Ministry of External Affairs has declared the official notification for 2025. To fill up the vacancies for Youn .... The Ministry of External Affairs has declared the official notification for 2025. To fill up the vacancies for Cons ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-28T23:52:10.994103",
      "links": []
    },
    {
      "id": "412987adb931f1e763852ef1dc0112b5",
      "title": "DFCCIL",
      "url": "https://allgovernmentjobs.in/dfccil-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Dedicated Freight Corridor Corporation of India Limited (DFCCIL) has declared the latest job notification for 2026. To f .... Dedicated Freight Corridor Corporation of India Limited (DFCCIL) has declared the official notification for 2025. To fil .... Dedicated Freight Corridor Corporation of India Limited (DFCCIL) has declared the official notification for 2025. To fil .... Dedicated Freight Corridor Corporation of India Limited (DFCCIL) has declared the official notification for 2025. To fi...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-28T23:52:10.994126",
      "links": []
    },
    {
      "id": "f28c20ad782b9b384b256ace52799862",
      "title": "IIT ISM Dhanbad Notification 2026 - Apply Online for Project Associate I Posts",
      "url": "https://allgovernmentjobs.in/iit-ism-dhanbad-notification-2026-apply-online-for-project-associate-i-posts/38763",
      "source": "allgovernmentjobs.in",
      "description": "IIT Indian School of Mines Dhanbad (IIT ISM Dhanbad) has declared the latest notification for 2026. To fill up the various vacancies for Project Associate I Jobs. Those candidates who have qualified in the B.E/ B.Tech, M.E/ M.Tech, and M.Sc can grab this chance and apply for the IIT ISM Dhanbad Notification 2026 . Here, we mentioned more about the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can app...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "09-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-29T23:51:24.550002",
      "links": []
    },
    {
      "id": "cb7872ec612fdb72adb28fee572f2f1f",
      "title": "IIEST Notification 2026 - Apply Online for 02 Junior Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/iiest-notification-2026-apply-online-for-02-junior-research-fellow-posts/38758",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Engineering Science and Technology (IIEST) has officially released the notification to fill the vacancies of 02 Junior Research Fellow Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their M.E./M. Tech in Mechanical Engineering, M.Sc can apply for the IIEST Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the educa...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "15-02-2026",
        "found_date": "20-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-29T23:51:24.550038",
      "links": []
    },
    {
      "id": "84e486251d280ac9a4dcfe16404f46f1",
      "title": "JPSC Notification 2026 - Apply Online for 30 Drug Inspector Posts",
      "url": "https://allgovernmentjobs.in/jpsc-notification-2026-apply-online-for-30-drug-inspector-posts/38756",
      "source": "allgovernmentjobs.in",
      "description": "The Jharkhand Public Service Commission (JPSC) has officially released the notification to fill the vacancies of 30 Drug Inspector Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B. Pharm, MBBS can apply for the JPSC Notification 2026 . The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process, application fe...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "18-02-2026",
        "found_date": "29-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-29T23:51:24.550061",
      "links": []
    },
    {
      "id": "ce5bfbb1b5af281cab3bd7c0ce6c1662",
      "title": "DCPU Nadia Notification 2026 - Apply for Protection Officer Posts",
      "url": "https://allgovernmentjobs.in/dcpu-nadia-notification-2026-apply-for-protection-officer-posts/38755",
      "source": "allgovernmentjobs.in",
      "description": "District Child Protection Unit Nadia (DCPU Nadia) has declaredthe latest job notification for 2026. To fill up the various vacancies for Protection Officer Jobs. Those candidates who have qualified in the Any Degree, post-graduation, can grab this chance and apply for the DCPU Nadia Notification 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the last date ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "14-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-29T23:51:24.550086",
      "links": []
    },
    {
      "id": "33900bcd0e3b48fa26ecdde89f85f4a1",
      "title": "NHM Kerala Recruitment 2026 - Apply Online for 02 Technical Consultant and Other Posts",
      "url": "https://allgovernmentjobs.in/nhm-kerala-recruitment-2026-apply-online-for-02-technical-consultant-and-other-posts/38761",
      "source": "allgovernmentjobs.in",
      "description": "National Health Mission Kerala (NHM Kerala) has declared the official notification for 2026. To fill up the vacancies for 02 Technical Consultant and Associate Technical Consultant Jobs. Those candidates who have qualified in the Any Degree, MBBS, or MD can grab this chance and apply for the NHM Kerala Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply be...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "10-02-2026",
        "found_date": "24-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-29T23:51:24.555651",
      "links": []
    },
    {
      "id": "ca4df5320e09026917124b9d8df1c637",
      "title": "ACTREC Recruitment 2026 - Walk-in-Interview for Multi Tasking Staff Posts",
      "url": "https://allgovernmentjobs.in/actrec-recruitment-2026-walk-in-interview-for-multi-tasking-staff-posts/38759",
      "source": "allgovernmentjobs.in",
      "description": "The Advanced Centre for Treatment Research and Education in Cancer (ACTREC) has published the official notification for 2026. To fill up the various vacancies for Multi-Tasking Staff Jobs. Those candidates who have qualified in the 08th Pass can grab this chance and apply for the ACTREC Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can attend the ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "05-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-29T23:51:24.555681",
      "links": []
    },
    {
      "id": "83fd7b486a7a7304dceda73fefd35aac",
      "title": "IIT Delhi Recruitment 2026 - Apply Offline for Project Scientist Posts",
      "url": "https://allgovernmentjobs.in/iit-delhi-recruitment-2026-apply-offline-for-project-scientist-posts/38757",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology Delhi (IIT Delhi) has announced the official notification for 2026. To fill up the vacancies for Project Scientist Jobs. Those candidates who have qualified in the B.E/ B.Tech, M.Sc can grab this chance and apply for the IIT Delhi Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the last date of application. If you ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-29T23:51:24.555702",
      "links": []
    },
    {
      "id": "21a9160ba8c847080e3d3930c2e1bc95",
      "title": "NIT Calicut",
      "url": "https://allgovernmentjobs.in/nit-calicut-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technology Calicut (NIT Calicut) has officially released the notification to fill the vacancie .... The National Institute of Technology Calicut (NIT Calicut) has officially released the notification to fill the vacancie .... The National Institute of Technology (NIT Calicut) has officially released the notification to fill the vacancies of 01 .... The National Institute of Technology Calicut (NIT Calicut) has officially released the notification to fill the vacancie...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-29T23:51:24.555746",
      "links": []
    },
    {
      "id": "9fbfde9859a8aec650f9d4a357c724f7",
      "title": "Department of Science & Technology",
      "url": "https://allgovernmentjobs.in/department-of-science-technology-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Engineering Science and Technology (IIEST) has officially released the notification to fill the .... The Indian Institute of Engineering Science and Technology Shibpur (IIEST Shibpur) has officially released the notificat .... Savli Technology and Business Incubator (STBI) has released an official notification for 2026. To fill up vacancies for& .... The Indian Institute of Engineering Science and Technology (IIEST) has officially released the notification to fill the ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Engineering",
      "skills": [],
      "scraped_at": "2026-01-29T23:51:24.555809",
      "links": []
    },
    {
      "id": "99c501e4184340d1c73a28502f9387b3",
      "title": "IIT Delhi",
      "url": "https://allgovernmentjobs.in/iit-delhi-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology Delhi (IIT Delhi) has announced the official notification for 2026. To fill up the vacanc .... The Indian Institute of Technology, Delhi (IIT Delhi) has officially released the notification to fill the vacancies of .... The Indian Institute of Technology Delhi (IIT Delhi) has officially released the notification to fill the vacancies of 0 .... Indian Institute of Technology Delhi (IIT Delhi) has declared the latest job notification for 2026. To fill up the vacan...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-29T23:51:24.555832",
      "links": []
    },
    {
      "id": "afa2b2b0c97e3bbf1404ad5493e443ef",
      "title": "AIIMS Bhubaneswar",
      "url": "https://allgovernmentjobs.in/aiims-bhubaneswar-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The All India Institute of Medical Sciences, Bhubaneswar (AIIMS Bhubaneswar) has officially released the notification to .... The District Health Society Coimbatore (DHS Coimbatore) has declared the latest job notification for 2025. To fill up th .... All India Institute of Medical Sciences Bhubaneswar (AIIMS Bhubaneswar) has declared the official notification for 2025. .... All India Institute of Medical Sciences Bhubaneswar (AIIMS Bhubaneswar) has declared the official notification for 2025...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-01-29T23:51:24.555856",
      "links": []
    },
    {
      "id": "d4b8855ab0061733c1319ba94b85478b",
      "title": "NIAB Hyderabad",
      "url": "https://allgovernmentjobs.in/niab-hyderabad-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Animal Biotechnology (NIAB) has declared the official notification for 2026. To fill up the va .... The National Institute of Animal Biotechnology (NAB) has declared the official notification for 2026. To fill up the vac .... The National Institute of Animal Biotechnology (NIAB)has declared the official notification for 2025. To fill up the vac .... The National Institute of Animal Biotechnology(NIAB) has officially released the notification to fill the vacancies of ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-29T23:51:24.555913",
      "links": []
    },
    {
      "id": "d2707229bccf8c9af373462ab3323077",
      "title": "DPSRU Notification 2026 - Walk-in interview for 12 Teaching Staff Posts",
      "url": "https://allgovernmentjobs.in/dpsru-notification-2026-walk-in-interview-for-12-teaching-staff-posts/38800",
      "source": "allgovernmentjobs.in",
      "description": "The Delhi Pharmaceutical Sciences and Research University (DPSRU) has officially released the notification to fill the vacancies of 12 Assistant Professor and  Guest Faculty Jobs. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B. Pharm, M. Pharm, BAMS, and Ph.D. can apply for the DPSRU Notification 2026. The interested applicants can attend the walk-in interview. Here we have mentio...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "12-02-2026",
        "found_date": "09-02-2026"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2026-01-30T23:51:11.535791",
      "links": []
    },
    {
      "id": "1bdf7f2003179771be4a1e0cc66d50e3",
      "title": "CERC Notification 2026 - Apply Offline for Staff Consultant Posts",
      "url": "https://allgovernmentjobs.in/cerc-notification-2026-apply-offline-for-staff-consultant-posts/38799",
      "source": "allgovernmentjobs.in",
      "description": "The Central Electricity Regulatory Commission (CERC) has officially released the notification to fill the vacancies of 01 Staff Consultant Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, M.E./M. Tech and MBA students can apply for the CERC Notification 2026. The interested applicants can apply in offline mode. Here we have mentioned the education details, age lim...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "27-02-2026",
        "found_date": "28-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-30T23:51:11.535813",
      "links": []
    },
    {
      "id": "bb70980bd9815f42baff29d27830c971",
      "title": "TMC Notification 2026 - Walk-in-Interview for 02 Medical Officer Posts",
      "url": "https://allgovernmentjobs.in/tmc-notification-2026-walk-in-interview-for-02-medical-officer-posts/38798",
      "source": "allgovernmentjobs.in",
      "description": "The Tata Memorial Centre (TMC) has declared the official notification for 2026. To fill up the 02 vacancies for Medical Officer Jobs. Those candidates who have qualified in the MBBS can grabthis chance and apply for the TMC Notification 2026 . Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can attend the walk-in at the address given below. If you are looking for more, here is a li...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "03-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-30T23:51:11.535836",
      "links": []
    },
    {
      "id": "6fe2587381b699b9da518208ac896f60",
      "title": "Supreme Court Notification 2026 - Apply Online for 90 Law Clerk Posts",
      "url": "https://allgovernmentjobs.in/supreme-court-notification-2026-apply-online-for-90-law-clerk-posts/38797",
      "source": "allgovernmentjobs.in",
      "description": "The Supreme Court has announced the official notification for 2026. To fill up the vacancies for 90 Law Clerk Jobs. Those candidates who have qualified in the Any Degree, LLB, can grab this chance and apply for the Supreme Court Notification 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply online before the last date of application. If you are looking for more, her...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "07-02-2026"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2026-01-30T23:51:11.535854",
      "links": []
    },
    {
      "id": "94de550732a066619adffe98563776a2",
      "title": "NIT Karnataka Recruitment 2026 - Apply for Project Assistant Posts",
      "url": "https://allgovernmentjobs.in/nit-karnataka-recruitment-2026-apply-for-project-assistant-posts/38805",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technology (NIT Karnataka) has declared the latest job notification for 2026. To fill up the various vacancies for Project Assistant Jobs. Those candidates who have qualified in the B.E/ B.Tech in Mining Engineering or Civil Engineering can grab this chance and apply for the NIT Karnataka Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligibl...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "10-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-30T23:51:11.541704",
      "links": []
    },
    {
      "id": "3d47fb035a4ff0a3908e5e998c9bbd54",
      "title": "NAL Recruitment 2026 - Walk-in-Interview for 35 Apprentice Posts",
      "url": "https://allgovernmentjobs.in/nal-recruitment-2026-walk-in-interview-for-35-apprentice-posts/38803",
      "source": "allgovernmentjobs.in",
      "description": "National Aerospace Laboratories (NAL Bangalore) has declaredthe official notification for 2026. To fill up the vacancies for 35 Apprentice Jobs. Those candidates who have qualified in the ITI can use this chance and apply for the NAL Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can attend the walk-in at the address given below. If you are looking...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "05-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-30T23:51:11.541741",
      "links": []
    },
    {
      "id": "87671db6da65ee0ca0fb53f0a56cdcee",
      "title": "AIIMS Bhubaneswar Recruitment 2026 - Apply Offline for Data Entry Operator Posts",
      "url": "https://allgovernmentjobs.in/aiims-bhubaneswar-recruitment-2026-apply-offline-for-data-entry-operator-posts/38801",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences Bhubaneswar (AIIMS Bhubaneswar) has announced the official notification for 2026. To fill up the vacancies for Data Entry Operator Jobs. Those candidates who have qualified in the Intermediate (10+2) can use this chance and apply for the AIIMS Bhubaneswar Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "10-02-2026"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2026-01-30T23:51:11.541763",
      "links": []
    },
    {
      "id": "169d5b434aa76b09e9409f8be8600f52",
      "title": "AIIMS",
      "url": "https://allgovernmentjobs.in/aiims-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The All India Institute of Medical Sciences Bathinda (AIIMS Bathinda) has officially released the notification to fill t .... All India Institute of Medical Sciences Bhubaneswar (AIIMS Bhubaneswar) has announced the official notification for .... The All India Institute of Medical Sciences, Bhubaneswar (AIIMS Bhubaneswar) has officially released the notification to .... All India Institute of Medical Sciences Bibinagar (AIIMS Bibinagar) has declared the official notification for 2026. To .......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-01-30T23:51:11.541814",
      "links": []
    },
    {
      "id": "d3a4e22e24e303a027b853a9ee01bd89",
      "title": "Supreme Court",
      "url": "https://allgovernmentjobs.in/supreme-court-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Supreme Court has announced the official notification for 2026. To fill up the vacancies for 90 Law Clerk Jobs. Thos ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-30T23:51:11.541880",
      "links": []
    },
    {
      "id": "4ef59836aa9e887e5eba0181ddf82af2",
      "title": "CUSAT Notification 2026 - Apply Online for 03 Technical Assistant Grade III Posts",
      "url": "https://allgovernmentjobs.in/cusat-notification-2026-apply-online-for-03-technical-assistant-grade-iii-posts/38827",
      "source": "allgovernmentjobs.in",
      "description": "Cochin University of Science and Technology (CUSAT) has announced the official notification for 2026. Allotted 03 vacancies for Technical Assistant Grade III Jobs. Those candidates who have qualified in the Post-Graduation, M.Sc can grab this chance and apply for the CUSAT Notification 2026 . Here, we mentioned the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply online before the last date of...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.211862",
      "links": []
    },
    {
      "id": "d165a9bc556d2eb9e3255ca08e1aa1fa",
      "title": "OFBH Notification 2026 - Apply Offline for Safety Officer Posts",
      "url": "https://allgovernmentjobs.in/ofbh-notification-2026-apply-offline-for-safety-officer-posts/38821",
      "source": "allgovernmentjobs.in",
      "description": "The Ordnance Factory Bhusawal (OFBH) has officially released the notification to fill the vacancies of 01 Safety Officer Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Any Degree or Diploma can apply for the OFBH Notification 2026. The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, selection process, application fee, ...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "20-02-2026",
        "found_date": "31-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.211888",
      "links": []
    },
    {
      "id": "0966d8000e7e879eea45fd63597af816",
      "title": "ACTREC Recruitment 2026 - Walk-in-Interview for Lab Assistant Posts",
      "url": "https://allgovernmentjobs.in/actrec-recruitment-2026-walk-in-interview-for-lab-assistant-posts/38829",
      "source": "allgovernmentjobs.in",
      "description": "The Advanced Centre for Treatment Research and Education in Cancer (ACTREC) has published the official notification for 2026. To fill up the various vacancies for Lab Assistant Jobs. Those candidates who have qualified in the 10th Pass can grab this chance and apply for the ACTREC Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can attend the walk-in at the addr...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "09-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.217646",
      "links": []
    },
    {
      "id": "f0a8cbbbc4bbdb2430fe6c568d925bec",
      "title": "DRDO CABS Recruitment 2026 - Apply Offline for 10 Junior Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/drdo-cabs-recruitment-2026-apply-offline-for-10-junior-research-fellow-posts/38826",
      "source": "allgovernmentjobs.in",
      "description": "The Centre for Airborne Systems Defence Research and Development Organisation (DRDO CABS) has declared the latest notification for 2026. To fill up the 10 vacancies for Junior Research Fellow Jobs. Those candidates who have qualified in the B.E/ B.Tech, M.E/ M.Tech in Mechanical Engineering can usethis chance and apply for these posts. Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for the DRDO CABS Recruitment 2026 ....",
      "pdf_link": null,
      "important_dates": {
        "found_date": "22-10-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.217683",
      "links": []
    },
    {
      "id": "376a457358a8b2255e8378ef7e63100b",
      "title": "JIPMER Recruitment 2026 - Walk-in-Interview for Project Associate I Posts",
      "url": "https://allgovernmentjobs.in/jipmer-recruitment-2026-walk-in-interview-for-project-associate-i-posts/38824",
      "source": "allgovernmentjobs.in",
      "description": "Jawaharlal Institute of Postgraduate Medical Education and Research (JIPMER) has declared the official notification for 2026. To fill up the various vacancies for Project Associate I Jobs. Those candidates who have completed their Any Degree, B.Pharm, B.Sc Nursing can grab this chance and apply for the JIPMER Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. If you are looking for more...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "10-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.217704",
      "links": []
    },
    {
      "id": "d07477d9286a07806c59dc99978ab30b",
      "title": "AIIMS Kalyani Recruitment 2026 - Apply Online for 133 Senior Resident Posts",
      "url": "https://allgovernmentjobs.in/aiims-kalyani-recruitment-2026-apply-online-for-133-senior-resident-posts/38822",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences (AIIMS Kalyani ) has declared the official notification for 2026. To fill up the vacancies for 133 Senior Resident Jobs. Those candidates who have qualified in the MBBS, MD/ MS, and DNB can grab this chance and apply for the AIIMS Kalyani Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply on or before the last date ...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "17-02-2026",
        "found_date": "30-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.217728",
      "links": []
    },
    {
      "id": "86fd845244cc5346da799b9d97892c05",
      "title": "PGIMER Recruitment 2026 - Walk-in-Interview for 02 Senior Resident Posts",
      "url": "https://allgovernmentjobs.in/pgimer-recruitment-2026-walk-in-interview-for-02-senior-resident-posts/38820",
      "source": "allgovernmentjobs.in",
      "description": "Postgraduate Institute of Medical Education and Research (PGIMER) has declared the official notification for 2026. To fill up the 02 vacancies for Senior Resident Jobs. Those candidates who have qualified in the MD/ MS can grab this chance and apply for the PGIMER Recruitment 2026 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can attend the walk-in at the address below. If you a...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "09-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.217746",
      "links": []
    },
    {
      "id": "2f3a9e103a2c6c8b8d9eeabca9db8828",
      "title": "CUSAT",
      "url": "https://allgovernmentjobs.in/cusat-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Cochin University of Science and Technology (CUSAT) has announced the official notification for 2026. Allotted 03 vacanc .... The Cochin University of Science and Technology (CUSAT) has officially released the notification to fill the vacancies o .... Cochin University of Science and Technology (CUSAT) has declared he official notification for 2026. To fill up the vacan .... Cochin University of Science and Technology (CUSAT) has declared the official notification for 2025. To fill up the vac...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.217793",
      "links": []
    },
    {
      "id": "818522cb4bc2c252d5b6a9f389355e7c",
      "title": "Mumbai Port Trust",
      "url": "https://allgovernmentjobs.in/mumbai-port-trust-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Mumbai Port Trust has officially released the notification to fill the vacancies of 01 Chief Asset Monetisation Offi .... Mumbai Port Trust has declared he official notification for 2026. To fill up the 24 vacancies for Junior Associate .... Mumbai Port Authority has declared the official notification for 2025. To fill up the vacancies for 04 Chief Mechan .... Mumbai Port Authority has declared the official notification for 2025. To fill up the vacancies for Junior Director .... Mumbai Po...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.217817",
      "links": []
    },
    {
      "id": "fb9f1d796e91366f4fb21016a3ff430b",
      "title": "JIPMER",
      "url": "https://allgovernmentjobs.in/jipmer-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Jawaharlal Institute of Postgraduate Medical Education and Research (JIPMER) has declared the official notification for .... Jawaharlal Institute of Postgraduate Medical Education and Research (JIPMER) has declared the official notification for .... The Jawaharlal Institute of Postgraduate Medical Education & Research (JIPMER) has officially released the notificat .... Jawaharlal Institute of Postgraduate Medical Education and Research (JIPMER) has declared the official notification for .... ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.217837",
      "links": []
    },
    {
      "id": "5ea0e2fa55894c438afb37484949aa68",
      "title": "Paradip Port Trust",
      "url": "https://allgovernmentjobs.in/paradip-port-trust-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Paradip Port Authority has officially released the notification to fill the vacancies of 02 Deputy Chief Medica .... The Paradip Port Authority (PPT) has officially released the notification to fill the vacancies of 02 Marine Engineers a ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.217858",
      "links": []
    },
    {
      "id": "84099683de7bb3102bfb6cb759235bc7",
      "title": "Oil India Limited",
      "url": "https://allgovernmentjobs.in/oil-india-limited-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Oil India Limited (Oil India) has officially released the notification to fill the vacancies of 02 Electrician and .... The North East Gas Distribution Company Limited (NEGDCL) has officially released the notification to fill the vacancies .... Oil India Limited (Oil India) has officially released the notification to fill the vacancies of 02 Doctor Posts. Interes .... Oil India Limited (Oil India) has officially released the notification to fill the vacancies of 09 Chemist, Geologist Po .... ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.217922",
      "links": []
    },
    {
      "id": "6fb71261557e721cf6923a207ec53d89",
      "title": "DMRCL",
      "url": "https://allgovernmentjobs.in/dmrc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Delhi Metro Rail Corporation (DMRC) has officially released the notification to fill the vacancies of 07 Joint .... The Delhi Metro Rail Corporation (DMRC) has officially released the notification to fill the vacancies of 01 Manager Pos .... The Delhi Metro Rail Corporation (DMRC) has officially released the notification to fill the vacancies of 01 Chief Engin .... The Delhi Metro Rail Corporation Limited (DMRC) has officially released the notification to fill the vacancies of 01 Sec .......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.217944",
      "links": []
    },
    {
      "id": "a8addaef456105e3174b2bdda988e7a6",
      "title": "DHFWS Dakshin Dinajpur Jobs 2026 - Apply Online for 11 Medical Officer, Specialist and Other Posts",
      "url": "https://allgovernmentjobs.in/dhfws-dakshin-dinajpur-jobs-2026-apply-online-for-11-medical-officer-specialist-and-other-posts/38828",
      "source": "allgovernmentjobs.in",
      "description": "The District Health & Family Welfare Samiti, Dakshin Dinajpur (DHFWS Dakshin Dinajpur) has officially released the notification to fill the vacancies of 11 Medical Officers, Specialists, Obstetricians & Gynecologists, Pediatrician Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Diploma, MBBS, MD/MS, DNB, and Post-graduation can apply for the DHFWS Dakshin Dinajpur Jobs 2026. T...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "12-02-2026",
        "found_date": "27-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-01-31T23:47:48.223651",
      "links": []
    },
    {
      "id": "d767bc7536b7a1bdf7d0d5a833711893",
      "title": "ERNET Notification 2026 - Apply Offline for Project Engineer Posts",
      "url": "https://allgovernmentjobs.in/ernet-notification-2026-apply-offline-for-project-engineer-posts/38847",
      "source": "allgovernmentjobs.in",
      "description": "The Education and Research Network India (ERNET) has officially released the notification to fill the vacancies of 01 Project Engineer Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Electronics Engineering, MCA, and M.Sc. can apply for the ERNET Notification 2026. The interested applicants can apply in offline mode. Here we have mentioned the education details,...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "16-02-2026",
        "found_date": "02-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.797664",
      "links": []
    },
    {
      "id": "d19ffececee0fd039da00e61821037ce",
      "title": "RRB Notification 2026 - Apply Online for 22195 Group D Posts",
      "url": "https://allgovernmentjobs.in/rrb-notification-2026-apply-online-for-22195-group-d-posts/38845",
      "source": "allgovernmentjobs.in",
      "description": "The Railway Recruitment Board (RRB) has officially released the notification to fill the vacancies of 22195 Assistant, Track Maintainer, Assistant Operations, and Pointsman B Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their 10th or ITI can apply for the RRB Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age l...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "02-03-2026",
        "found_date": "31-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.797688",
      "links": []
    },
    {
      "id": "9baed3d1e22b96a6ecfec17e1be9b49d",
      "title": "WBSHFWS Notification 2026 - Apply Online for 03 Sub Assistant Engineer Posts",
      "url": "https://allgovernmentjobs.in/wbshfws-notification-2026-apply-online-for-03-sub-assistant-engineer-posts/38844",
      "source": "allgovernmentjobs.in",
      "description": "The West Bengal State Health and Family Welfare Samiti (WBSHFWS) has officially released the notification to fill the vacancies of 03 Sub Assistant Engineer Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Diploma in Civil Engineering can apply for the WBSHFWS Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, ag...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "16-02-2026",
        "found_date": "02-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.797707",
      "links": []
    },
    {
      "id": "c12c9a5024f70c5f078e11affa7c6cc6",
      "title": "ECHS Notification 2026 - Apply Offline for 06 Medical Officer, Clerk and Other Posts",
      "url": "https://allgovernmentjobs.in/echs-notification-2026-apply-offline-for-06-medical-officer-clerk-and-other-posts/38843",
      "source": "allgovernmentjobs.in",
      "description": "The Ex-Servicemen Contributory Health Scheme (ECHS) has officially released the notification to fill the vacancies of 06 Officer In Charge, Medical Officer, Dental Officer, and Clerk Jobs. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Any Degree, MBBS, MD/MS, DNB, BDS can apply for the ECHS Notification 2026. The interested applicants can apply in offline mode. Here we have mention...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "14-02-2026",
        "found_date": "02-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.797729",
      "links": []
    },
    {
      "id": "d0a8bd6cfe66ab13deaf6903624357c3",
      "title": "ECHS Notification 2026 - Apply Offline for 39 Medical Officer, Driver Posts",
      "url": "https://allgovernmentjobs.in/echs-notification-2026-apply-offline-for-39-medical-officer-driver-posts/38841",
      "source": "allgovernmentjobs.in",
      "description": "The Ex-Servicemen Contributory Health Scheme (ECHS) has officially released the notification to fill the vacancies of 39 Officer In Charge, Dental Officer, Pharmacist, Nursing Assistant, Female Attendant, Safaiwala, Chowkidar. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their 08th, 12th, DMLT, B. Pharm, GNM, B.Sc, BDS, any degree, MBBS, MD/MS can apply for the ECHS Notification 2026. T...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "16-02-2026",
        "found_date": "02-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.797766",
      "links": []
    },
    {
      "id": "689c83b4b03a7ddfb7b323a8b6675fd0",
      "title": "HAL Notification 2026 - Apply Offline for 02 Visiting Consultant Posts",
      "url": "https://allgovernmentjobs.in/hal-notification-2026-apply-offline-for-02-visiting-consultant-posts/38840",
      "source": "allgovernmentjobs.in",
      "description": "The Hindustan Aeronautics Limited (HAL) has officially released the notification to fill the vacancies of 02 Visiting Consultant Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their MBBS, DNB, and MD/MS can apply for the HAL Notification 2026. The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, selection process, application...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "13-02-2026",
        "found_date": "30-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.797784",
      "links": []
    },
    {
      "id": "52a3042918bfd391b48ac6f5328f4dbc",
      "title": "BFUHS",
      "url": "https://allgovernmentjobs.in/bfuhs-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Baba Farid University of Health Science (BFUHS) has officially released the notification to fill the vacancies of 01 .... The Baba Farid University of Health Sciences (BFUHS) has officially released the notification to fill the vacancies of 1 .... Baba Farid University of Health Sciences (BFUHS) has declared the official notification for 2025. To fill up the vacanci .... The Baba Farid University of Health Sciences (BFUHS) has officially released the notification to fill the vacancies ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.803491",
      "links": []
    },
    {
      "id": "373f516ecb270340d789b0d1670dbb04",
      "title": "ERNET",
      "url": "https://allgovernmentjobs.in/ernet-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Education and Research Network India (ERNET) has officially released the notification to fill the vacancies of 01 Pr .... The Education and Research Network India (ERNET) has declared the official notification for 2025. To fill up the va .... The Education and Research Network of India (ERNET India) has officially released the notification to fill the vacancies ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Teaching",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.803548",
      "links": []
    },
    {
      "id": "20a20e01a9a0f0ca7399b115d4ae3c81",
      "title": "AIIMS Delhi",
      "url": "https://allgovernmentjobs.in/aiims-delhi-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The All India Institute of Medical Sciences, Delhi (AIIMS Delhi) has officially released the notification to fill the va .... The All India Institute of Medical Sciences, Delhi (AIIMS Delhi) has officially released the notification to fill the va .... The All India Institute of Medical Sciences, Delhi (AIIMS Delhi) has officially released the notification to fill the va .... All India Institute of Medical Sciences, Delhi (AIIMS Delhi) has declared the official notification for 2026. To fill u...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.803597",
      "links": []
    },
    {
      "id": "3817f3d7717e77b518aab056abbce4c4",
      "title": "RGIPT",
      "url": "https://allgovernmentjobs.in/rgipt-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Rajiv Gandhi Institute of Petroleum Technology (RGIPT) has officially released the notification to fill the vacancie .... Rajiv Gandhi Institute of Petroleum Technology (RGIPT) has declared the official notification for 2025. To fill up the v .... Rajiv Gandhi Institute of Petroleum Technology (RGIPT) has declared the official notification for 2025. To fill up the v .... The Rajiv Gandhi Institute of Petroleum Technology (RGIPT) has officially released the notification to fill the vac ......",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.803637",
      "links": []
    },
    {
      "id": "23e532ddbc9fd1acdb83c447304a0f87",
      "title": "Panchayati Raj",
      "url": "https://allgovernmentjobs.in/panchayati-raj-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Vijayanagara Zilla Panchayat has officially released the notification to fill the vacancies of 01 SLWM Consultant Po .... Shivamogga Zilla Panchayat has declared the official notification for 2025. To fill up the vacancies for Accounts M .... Zilla Parishad Palghar has declared the official notification for 2025. To fill up the vacancies for Lawyer Jobs. T .... The Uttar Pradesh Panchayat Raj (UP Panchayat Raj) has officially released the notification to fill the vacancies of 826 .... Zil...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.803657",
      "links": []
    },
    {
      "id": "92272f1be441dd5a7c1fb5e533be43f9",
      "title": "MAHATRANSCO",
      "url": "https://allgovernmentjobs.in/mahatransco-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Maharashtra State Electricity Transmission Company (MAHATRANSCO) has officially released the notification to fill th .... Maharashtra State Electricity Transmission Company (MAHATRANSCO) has declared the official notification for 2026. To fil .... Maharashtra State Electricity Transmission Company Limited (MAHATRANSCO) has declared the official notification for 2025 .... Maharashtra State Electricity Transmission Company (MAHATRANSCO) has declared the official notification for 2025. To fi...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.803676",
      "links": []
    },
    {
      "id": "5bc94e67da00fa1866d0cc3d6a24023b",
      "title": "WBPSC",
      "url": "https://allgovernmentjobs.in/wbpsc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Syama Prasad Mookerjee Port Kolkata (SMP Kolkata) has officially released the notification to fill the vacancies of .... The Syama Prasad Mookerjee Port (SMP) has officially released the notification to fill the vacancies of 08 Cabin As .... The West Bengal State Agricultural Marketing Board (WBSAMB) has officially released the notification to fill the va .... The West Bengal Forensic Science Laboratory (WBFSL) has officially released the notification to fill the vacancies of 81 .... The ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.803719",
      "links": []
    },
    {
      "id": "6250c53d7b663a39d3c29e0f543bc543",
      "title": "IIITDM Kancheepuram Jobs 2026 - Apply Online for Junior Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/iiitdm-kancheepuram-jobs-2026-apply-online-for-junior-research-fellow-posts/38848",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Information Technology Design & Manufacturing Kancheepuram (IIITDM Kancheepuram) has officially released the notification to fill the vacancies of 01 Junior Research Fellow Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, M.E./M. Tech in Electrical, Electronics, Mechanical, and Civil Engineering can apply for the IIITDM Kancheppuram Jobs 20...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "16-02-2026",
        "found_date": "27-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-02T23:54:47.809606",
      "links": []
    },
    {
      "id": "0a0e8a05ae3a8428c17d62726550c767",
      "title": "TMC Notification 2026 - Walk-in-Interview for 02 Clinical Research Coordinator Posts",
      "url": "https://allgovernmentjobs.in/tmc-notification-2026-walk-in-interview-for-02-clinical-research-coordinator-posts/38887",
      "source": "allgovernmentjobs.in",
      "description": "The Tata Memorial Centre (TMC) has announced the official notification for 2026. To fill up the vacancies for 02 Clinical Research Coordinator Jobs. Those candidates who have qualified in the B.Sc, B.Pharm, and Post Graduation can grab this chance and apply for the TMC Notification 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can attend the walk-in at the ad...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "20-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.157248",
      "links": []
    },
    {
      "id": "5434ff37c25c00dd1f019860657a8b6c",
      "title": "IIT BHU Notification 2026 - Apply Offline for Software Developer Posts",
      "url": "https://allgovernmentjobs.in/iit-bhu-notification-2026-apply-offline-for-software-developer-posts/38884",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology BHU (IIT BHU) has officially released the notification to fill the vacancies of 01 Software Developer Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Computer Science, Electronics Engineering can apply for the IIT BHU Notification 2026. The interested applicants can apply in offline mode. Here we have mentioned the education d...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "24-02-2026",
        "found_date": "03-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.157274",
      "links": []
    },
    {
      "id": "f28a9c569b1e72ac6829a5aa0fd2b9d2",
      "title": "NIMHANS Notification 2026 - Apply Offline for Project Research Scientist II Posts",
      "url": "https://allgovernmentjobs.in/nimhans-notification-2026-apply-offline-for-project-research-scientist-ii-posts/38882",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Mental Health and Neuro Sciences (NIMHANS) has officially released the notification to fill the vacancies of 01 Project Research Scientist II Jobs. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, M.E./M. Tech, M.Sc can apply for the NIMHANS Notification 2026. The interested applicants can apply in offline mode. Here we have mentioned the educat...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "22-02-2026",
        "found_date": "02-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.157295",
      "links": []
    },
    {
      "id": "6f8b346daec9e6799d32538e143f1863",
      "title": "NITTTR Notification 2026 - Apply Offline for Consultant Posts",
      "url": "https://allgovernmentjobs.in/nitttr-notification-2026-apply-offline-for-consultant-posts/38880",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technical Teachers Training and Research (NITTTR) has officially released the notification to fill the vacancies of 01 Consultant Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Post-graduation can apply for the NITTTR Notification 2026. The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, selec...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "16-02-2026",
        "found_date": "03-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.157314",
      "links": []
    },
    {
      "id": "67387454ddb7b40333b0660ccf64e2fa",
      "title": "Fatehabad District Court Recruitment 2026 - Apply Offline for 04 Peon Posts",
      "url": "https://allgovernmentjobs.in/fatehabad-district-court-recruitment-2026-apply-offline-for-04-peon-posts/38889",
      "source": "allgovernmentjobs.in",
      "description": "Fatehabad District Court has announced the latest job notification for 2026. To fill up the vacancies for 04 Peon Jobs. Those candidates who have qualified in the 10th Pass can grab this chance and apply for the Fatehabad District Court Recruitment 2026 . Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the last date of application. If you are looking for more, here...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.163281",
      "links": []
    },
    {
      "id": "23b1fdd9c4fea2fb8d6fd4828b2e39da",
      "title": "IISER Tirupati Recruitment 2026 - Apply of Research Associate I Posts",
      "url": "https://allgovernmentjobs.in/iiser-tirupati-recruitment-2026-apply-of-research-associate-i-posts/38885",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Science Education and Research (IISER Tirupati) has released the latest job notification for Research Associate I Jobs 2026. Those candidates who have qualified in the Post-Graduation, Ph.D can grab this chance and apply for the IISER Tirupati Recruitment 2026 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the last date of application. If you ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "10-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.163311",
      "links": []
    },
    {
      "id": "53900890acec84b2e9ea7707ced60b37",
      "title": "AIIMS Bilaspur Recruitment 2026 - Apply Offline for 02 Transplant Coodinator Posts",
      "url": "https://allgovernmentjobs.in/aiims-bilaspur-recruitment-2026-apply-offline-for-02-transplant-coodinator-posts/38883",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences Bilaspur (AIIMS Bilaspur) has declared the official notification for 2026. To fill up the vacancies for 02 Transplant Coordinator Jobs. Those candidates who have qualified in the Any Degree, post-graduation, or B.Sc Nursing can grab this chance and apply for the AIIMS Bilaspur Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. If you are looking f...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.163331",
      "links": []
    },
    {
      "id": "bb802990907353d99f3667129d9886f9",
      "title": "SCTIMST Recruitment 2026 - Walk-in-Interview for Senior Project Engineer Posts",
      "url": "https://allgovernmentjobs.in/sctimst-recruitment-2026-walk-in-interview-for-senior-project-engineer-posts/38881",
      "source": "allgovernmentjobs.in",
      "description": "Sree Chitra Tirunal Institute for Medical Sciences and Technology (SCTIMST) has declared the official notification for 2026. To fill up the vacancies for  Senior Project Engineer Jobs. Those candidates who have qualified in the B.E/ B.Tech, M.E/ M.Tech in Mechanical Engineeringcan use this chance and apply for the SCTIMST Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested can...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "07-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.163349",
      "links": []
    },
    {
      "id": "c41cd0658ea9fa5b985b36c9caa92da0",
      "title": "NITTTR",
      "url": "https://allgovernmentjobs.in/nitttr-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technical Teachers Training and Research (NITTTR) has officially released the notification to .... National Institute of Technical Teachers Training and Research (NITTTR Chennai) has declared the latest job notification .... National Institute of Technical Teachers Training and Research, Kolkata (NITTTR Kolkata) has declared the official notif .... National Institute of Technical Teachers Training and Research (NITTTR) has declared the offcial notification for 2025. ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Teaching",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.163500",
      "links": []
    },
    {
      "id": "64cb2609eebc7f3b09519f30e877e49b",
      "title": "IIM Kozhikode",
      "url": "https://allgovernmentjobs.in/iim-kozhikode-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Management Kozhikode (IIM Kozhikode) has declared the official notification for 2026. To fill up the .... The Indian Institute of Management Kozhikode (IIM Kozhikode) has officially released the notification to fill the vacanc .... Indian Institute of Management Kozhikode (IIM Kozhikode) has announced the official notification for 2025. To fill up th .... Indian Institute of Management (IIM) Kozhikode has declared the official notification for 2025. To fill up the vacancie...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.163518",
      "links": []
    },
    {
      "id": "41a378f087343fc36dc64edffc4304dd",
      "title": "Hindustan Copper Ltd",
      "url": "https://allgovernmentjobs.in/hindustan-copper-ltd-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Hindustan Copper Limited (HCL) has declared the official notification for 2026. To fill up the vacancies for 47&nbsp .... The Hindustan Copper Limited (Hindustan Copper) has officially released the notification to fill the vacancies of 03 You .... The Hindustan Copper Limited (HCL) has officially released the notification to fill the vacancies of 64 Supervisor Posts ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.163538",
      "links": []
    },
    {
      "id": "19ccf688b487df63ff2b823dc1df1c08",
      "title": "THSTI",
      "url": "https://allgovernmentjobs.in/thsti-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Translational Health Science and Technology Institute (THSTI) has officially released the notification to fill the v .... Translational Health Science and Technology Institute (THSTI) has announced the official notification for 2026. To fill .... The Translational Health Science and Technology Institute (THSTI) has officially released the notification to fill the v .... The Translational Health Science and Technology Institute (THSTI) has officially released the notification to fill the v...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.163558",
      "links": []
    },
    {
      "id": "abab33ca6427aeee75e3707bda365bb0",
      "title": "AIIMS Patna",
      "url": "https://allgovernmentjobs.in/aiims-patna-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The All India Institute of Medical Sciences Patna (AIIMS Patna) has declared its official notification for 2026. To fill .... The All India Institute of Medical Sciences, Patna (AIIMS Patna) has officially released the notification to fill the va .... The All India Institute of Medical Sciences, Patna (AIIMS Patna) has officially released the notification to fill the va .... All India Institute of Medical Sciences Patna (AIIMS Patna) has announced the official notification for 2025. To fill u...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.163577",
      "links": []
    },
    {
      "id": "a7c3cb97f55f0e5ea6d879258d77334b",
      "title": "IIT Guwahati Jobs 2026 - Apply Online for Junior Engineer Posts",
      "url": "https://allgovernmentjobs.in/iit-guwahati-jobs-2026-apply-online-for-junior-engineer-posts/38888",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology Guwahati (IIT Guwahati) has officially released the notification to fill the vacancies of 01 Junior Engineer Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Diploma in Mechanical, Electrical, and Civil Engineering can apply for the IIT Guwahati Jobs 2026. The interested applicants can apply in online mode. Here we have mentioned the education...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "17-02-2026",
        "found_date": "02-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-03T23:53:43.169446",
      "links": []
    },
    {
      "id": "ea4649d60933185492c8f01386bc98be",
      "title": "BHEL Notification 2026 - Apply Online for 23 FTA Grade III Supervisor Posts",
      "url": "https://allgovernmentjobs.in/bhel-notification-2026-apply-online-for-23-fta-grade-iii-supervisor-posts/38909",
      "source": "allgovernmentjobs.in",
      "description": "The Bharat Heavy Electricals Limited (BHEL) has officially released the notification to fill the vacancies of 23 FTA Grade III Supervisor Jobs. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Diploma in Electrical and Civil Engineering can apply for the BHEL Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit,...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "24-02-2026",
        "found_date": "03-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-04T23:53:31.129637",
      "links": []
    },
    {
      "id": "c2edf737ec2355d9442ed9b9508f2ae1",
      "title": "NHSRC Notification 2026 - Apply Online for Lead Consultant Posts",
      "url": "https://allgovernmentjobs.in/nhsrc-notification-2026-apply-online-for-lead-consultant-posts/38908",
      "source": "allgovernmentjobs.in",
      "description": "The National Health Systems Resource Centre (NHSRC) has officially released the notification to fill the vacancies of 01 Lead Consultant Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, M.E./M. Tech in Computer Science Engineering, MCA, MBA, and M.Sc can apply for the NHSRC Notification 2026. The interested applicants can apply in online mode. Here we have mention...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "24-02-2026",
        "found_date": "02-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-04T23:53:31.129663",
      "links": []
    },
    {
      "id": "4d93bb0e790509edd4c00ba25948ec4a",
      "title": "ANGRAU Notification 2026 - Walk-in interview for Medical Officer Posts",
      "url": "https://allgovernmentjobs.in/angrau-notification-2026-walk-in-interview-for-medical-officer-posts/38905",
      "source": "allgovernmentjobs.in",
      "description": "The Acharya NG Ranga Agricultural University (ANGRAU) has officially released the notification to fill the vacancies of 01 Medical Officer Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their MBBS can apply for the ANGRAU Notification 2026. The interested applicants can attend the walk-in interview. Here we have mentioned the education details, age limit, selection process, applica...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "11-02-2026",
        "found_date": "03-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-04T23:53:31.129708",
      "links": []
    },
    {
      "id": "3b356d93a6192512e3a43d60eea2c275",
      "title": "PMC Notification 2026 - Apply Online for 255 Intern, Gardener Posts",
      "url": "https://allgovernmentjobs.in/pmc-notification-2026-apply-online-for-255-intern-gardener-posts/38904",
      "source": "allgovernmentjobs.in",
      "description": "The Pune Municipal Corporation (PMC) has officially released the notification to fill the vacancies of 255 Intern and Gardener Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application.  Candidates who have completed their B.E./B. Tech in Mechanical, Electrical, Civil Engineering, 10th can apply for the PMC Notification 2026 . The interested applicants can apply in online mode. Here we have mentioned the education details,...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "10-02-2026",
        "found_date": "04-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-04T23:53:31.129728",
      "links": []
    },
    {
      "id": "b735a68235f8b3c328c4f1e62de5100a",
      "title": "NBPGR Notification 2026 - Apply Offline for Senior Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/nbpgr-notification-2026-apply-offline-for-senior-research-fellow-posts/38901",
      "source": "allgovernmentjobs.in",
      "description": "The National Bureau of Plant Genetic Resources (NIBPGR) has officially released the notification to fill the vacancies of 01 Senior Research Fellow Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Any Degree, Post-graduation can apply for the NBPGR Notification 2026. The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, se...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "28-02-2026",
        "found_date": "04-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-04T23:53:31.129747",
      "links": []
    },
    {
      "id": "6a10120b55ff4549a457bd83c5a7192a",
      "title": "IIT Goa Notification 2026 - Apply Online for Junior Research Fellow Posts",
      "url": "https://allgovernmentjobs.in/iit-goa-notification-2026-apply-online-for-junior-research-fellow-posts/38900",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology Goa (IIT Goa) has officially released the notification to fill the vacancies of 01 Junior Research Fellow Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech, M.E./M. Tech in Mechanical Engineering can apply for the IIT Goa Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education det...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "17-02-2026",
        "found_date": "04-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-04T23:53:31.129765",
      "links": []
    },
    {
      "id": "f1cacc39a1e9da8b147a0cf79f1df8f1",
      "title": "NIIST",
      "url": "https://allgovernmentjobs.in/niist-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute for Interdisciplinary Science and Technology (NIIST) has officially released the notification to .... The National Institute for Interdisciplinary Science & Technology (NIIST)has declared the official notification for .... The National Institute for Interdisciplinary Science and Technology (NIIST) has officially released the notification to ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-02-04T23:53:31.135688",
      "links": []
    },
    {
      "id": "12a926ba7d5a59749b743144d9d70be6",
      "title": "NIT Rourkela",
      "url": "https://allgovernmentjobs.in/nit-rourkela-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology Rourkela (NIT Rourkela) has officially released the notification to fill the vacancie .... National Institute of Technology Rourkela (NIT Rourkela) has declared the official notification for 2026. To fill up the .... National Institute of Technology Rourkela (NIT Rourkela) has declared the official notification for 2025. To fill up the .... The National Institute of Technology Rourkela (NIT Rourkela) has officially released the notification to fill the v ......",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-02-04T23:53:31.135712",
      "links": []
    },
    {
      "id": "4d933077d85df186d8f3de491008f189",
      "title": "Manipur PSC",
      "url": "https://allgovernmentjobs.in/manipur-psc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Manipur Public Service Commission (MPSC) has officially released the notification to fill the vacancies of 130  .... Manipur Staff Selection Commission (Manipur SSC) has declared the official notification for 2026. To fill up the vacanci .... The Manipur Public Service Commissioner (Manipur PSC) has officially released the notification to fill the vacancies of ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "SSC",
      "skills": [],
      "scraped_at": "2026-02-04T23:53:31.135738",
      "links": []
    },
    {
      "id": "a95f8b7b40027ba5de3cf611b212b5c1",
      "title": "NHM Murshidabad Jobs 2026 - Apply Online for 10 Block Programme Coordinators Posts",
      "url": "https://allgovernmentjobs.in/nhm-murshidabad-jobs-2026-apply-online-for-10-block-programme-coordinators-posts/38902",
      "source": "allgovernmentjobs.in",
      "description": "The National Health Mission Murshidabad (NHM Murshidabad) has officially released the notification to fill the vacancies of 10 Block Programme Coordinator Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their post-graduation and MBA can apply for the NHM Murshidabad Jobs 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "21-02-2026",
        "found_date": "02-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-04T23:53:31.141760",
      "links": []
    },
    {
      "id": "70cdfc32ffea4d3ef253c798c6b48494",
      "title": "All Government Jobs",
      "url": "https://allgovernmentjobs.in/",
      "source": "allgovernmentjobs.in",
      "description": "Install All Government Jobs Home Latest Govt Jobs Results Qualifications Organizations Contact Us Login India's Best Portal for All Government Jobs Updates search 310 Notifications and 75,677 Jobs All Government Jobs - Sarkari Naukri India's Best Govt Job Site Get Your Latest Government Jobs Explore the world of All Government Jobs, which offer a wide range of career options. Our robust tool enables you to discover the perfect Govt job that aligns with your qualifications and interests. All G...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.270683",
      "links": []
    },
    {
      "id": "fe0401064c6850ee4a40cd1ad8e34043",
      "title": "Latest Govt Jobs",
      "url": "https://allgovernmentjobs.in/latest-government-jobs",
      "source": "allgovernmentjobs.in",
      "description": "Join on Telegram All Government Jobs Home Latest Govt Jobs Results Qualifications Organizations About Us Contact Us Register Login Home > Latest Government Jobs Government Jobs 2026 | 75,677 Latest Govt Jobs 310 Notifications All Government Jobs 2026: Here, you can apply for the latest job postings and recruitment notifications, we are expert in providing the government jobs that offer many employment opportunities for you. our job portal which provides the best recruitment information relate...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [
        "Excel"
      ],
      "scraped_at": "2026-02-05T23:51:13.270721",
      "links": []
    },
    {
      "id": "df51fd822a4feaacdaf996e2d3c50661",
      "title": "Qualifications",
      "url": "https://allgovernmentjobs.in/jobs-by-qualification",
      "source": "allgovernmentjobs.in",
      "description": "Join on Telegram All Government Jobs Home Latest Govt Jobs Results Qualifications Organizations About Us Contact Us Register Login Jobs By Quaifications Education Total Post Notifications Apply Now M.Pharm 118 11 Apply / View Post Graduation 1,880 64 Apply / View MBBS 3,870 55 Apply / View MS/ MD 1,186 29 Apply / View M.E / M.Tech 1,077 57 Apply / View Electrical Engineering 1,437 31 Apply / View B.E/ B.Tech 10,232 106 Apply / View M.Sc 1,055 35 Apply / View Electronics and Communication Engi...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.270748",
      "links": []
    },
    {
      "id": "a14bae7bd9ce0589c8be86df885cf2ff",
      "title": "Organizations",
      "url": "https://allgovernmentjobs.in/jobs-by-organization",
      "source": "allgovernmentjobs.in",
      "description": "Join on Telegram All Government Jobs Home Latest Govt Jobs Results Qualifications Organizations About Us Contact Us Register Login Jobs By Organization Organization Total Post Notifications Apply Now ACTREC 2 2 Apply / View GMCH 134 6 Apply / View IIT Roorkee 3 2 Apply / View NIT 31 4 Apply / View AIIMS 142 6 Apply / View Ministry of AYUSH 51 5 Apply / View IIM 1 1 Apply / View E-courts 459 7 Apply / View NHM 1,580 26 Apply / View NIMHANS 5 4 Apply / View 1 2 3 Next All Government Jobs AllGov...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.270776",
      "links": []
    },
    {
      "id": "3aebc6c7ddcf741178ffb334ccd84169",
      "title": "Medical",
      "url": "https://allgovernmentjobs.in/medical-jobs",
      "source": "allgovernmentjobs.in",
      "description": "The R.G. Kar Medical College & Hospital (R.G. Kar Medical College) has officially released the notification to fill ... All India Institute of Medical Sciences Bathinda (AIIMS Bathinda) has declared the official notification for 2026. To fi... National Institute of Mental Health and Neuro Sciences (NIMHANS) has declared the latest job notification for 2026. To f... Employees' State Insurance Corporation (ESIC Andhra Pradesh) has declared the official notification for 2026. To fill up... Distr...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.270801",
      "links": []
    },
    {
      "id": "d7cfa41aa25c524e2ccb0798d6b41c8f",
      "title": "Engineering",
      "url": "https://allgovernmentjobs.in/engineering-jobs",
      "source": "allgovernmentjobs.in",
      "description": "Join on Telegram All Government Jobs Home Latest Govt Jobs Results Qualifications Organizations About Us Contact Us Register Login Home > Engineering Jobs Engineering Govt Jobs 2024- [all vacancies] Posts B.E / B.Tech, M.E / M.Tech Engineering Jobs : For all the students in India who have a dream to become an engineer and work in the government sector, Government Jobs for Engineering is the best match. The Central Government of India has announced Total 8987 vacancies for people who like to g...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.270823",
      "links": []
    },
    {
      "id": "40739f76344ff63612b1eab1bd5e8bb6",
      "title": "Finance",
      "url": "https://allgovernmentjobs.in/mba-jobs",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Management Nagpur (IIM Nagpur) has officially released the notification to fill the vacancies of... The Mumbai Port Trust has officially released the notification to fill the vacancies of 06 Professional Intern Posts. In... The Sardar Vallabhbhai National Institute of Technology (SVNIT) has officially released the notification to fill the vac... The National Health Systems Resource Centre (NHSRC) has officially released the notification to fill the vacancies of 01... T...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.270849",
      "links": []
    },
    {
      "id": "55ec3dbde87163e0b1955d0a26c8029e",
      "title": "Nurse",
      "url": "https://allgovernmentjobs.in/staff-nurse-jobs",
      "source": "allgovernmentjobs.in",
      "description": "Join on Telegram All Government Jobs Home Latest Govt Jobs Results Qualifications Organizations About Us Contact Us Register Login Home > Staff Nurse Jobs Staff Nurse Vacancy 2024, 1193 Upcoming Nursing Job alert Staff Nurse Vacancy : Every year, lakhs of students apply for Government jobs as off now Total 12116 Nursing Govt Jobs were available, and try their best to secure a place in the tough government industry. This time, the Central Government of India has announced Staff Nurse Vacancy 2...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "26-02-06"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.270871",
      "links": []
    },
    {
      "id": "f8da4d1065d86319bcab0375f7a7ee5f",
      "title": "Pharmacy",
      "url": "https://allgovernmentjobs.in/pharmacy-jobs",
      "source": "allgovernmentjobs.in",
      "description": "The Advanced Centre for Treatment Research and Education in Cancer (ACTREC) has published the official notification... The National Institute of Technology Kurukshetra (NIT Kurukshetra) has officially released the notification to fill the ... The Baba Farid University of Health Science (BFUHS) has officially released the notification to fill the vacancies of 01... The District Health Society Kallakurichi (DHS Kallakurichi) has officially released the notification to fill the vacanci... The In...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.270892",
      "links": []
    },
    {
      "id": "ba7971b0ef03335f68b55c65d003d7a6",
      "title": "Dental",
      "url": "https://allgovernmentjobs.in/bds-jobs",
      "source": "allgovernmentjobs.in",
      "description": "Delhi Municipal Corporation has declared the official notification for 2026. To fill up the vacancies for Junior Re... The District Health Society Tirunelveli (DHS Tirunelveli) has officially released the notification to fill the vacancies... The Baba Farid University of Health Science (BFUHS) has officially released the notification to fill the vacancies of 01... The Ex-Servicemen Contributory Health Scheme (ECHS Leimakhong) has officially released the notification to fill the vaca... The Na...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.270913",
      "links": []
    },
    {
      "id": "2a7aa9e0a17fc238afce7ef7eb24c2ae",
      "title": "Aviation",
      "url": "https://allgovernmentjobs.in/aeronautical-engineering-jobs",
      "source": "allgovernmentjobs.in",
      "description": "SJVN has invited online applications for Apprentice Jobs. There are 300 positions released in Himachal Pradesh Gove... CSIR-National Aerospace Laboratories (NAL) has introduced the latest job notification for the 74 Project Associate, Seni... DRDO-Advanced Centre for Energetic Material (ACEM) has issued a new job notification for the position of Apprentice... Pawan Hans Limited (PHL) has published the latest job notification for the 20 General Manager, Joint General Manage... Central Mechanic...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.270934",
      "links": []
    },
    {
      "id": "91f96aa87b17a2f9d92025c6155d4267",
      "title": "Naval",
      "url": "https://allgovernmentjobs.in/indian-navy-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Navy has officially released the notification to fill the vacancies of 260 SSC Officer Posts. Interested and ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.270955",
      "links": []
    },
    {
      "id": "d7c0b557d3d17d5cc3a05ba010391419",
      "title": "Hotel Management",
      "url": "https://allgovernmentjobs.in/hotel-management-jobs",
      "source": "allgovernmentjobs.in",
      "description": "DU Jobs 2023 is now out on its official website. Candidates who are looking for the University of Delhi Jobs 2023 can ap... Institute of Hotel Management, Catering Technology & Applied Nutrition (IHMCTAN), Mumbai invites applicants to fill ... National Institute of Technical Teachers Training and Research (NITTTR) Chennai has announced the Latest Job Notificatio... Jharkhand Staff Selection Commission (JSSC) has announced the Latest Job Notification for the Post of Training Officer w... Natio...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.270976",
      "links": []
    },
    {
      "id": "cdf3a911adf444977ac2ed3413ace85c",
      "title": "Sports Quota",
      "url": "https://allgovernmentjobs.in/sports-quota-jobs",
      "source": "allgovernmentjobs.in",
      "description": "Railway Recruitment Cell - East Central Railway has officially declared the notification for the posts of Sportsperson i... Northern Railway has released the notification for the position of Sports Quota. There are 21 vacancies announced on its... North Western Railway If you're passionate about sports and looking for a job opportunity, North Western Railway may hav...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.270996",
      "links": []
    },
    {
      "id": "9652317edecb5d653907b3152758d8b1",
      "title": "Architecture",
      "url": "https://allgovernmentjobs.in/architectural-engineering-jobs",
      "source": "allgovernmentjobs.in",
      "description": "National Aluminium Company Limited (NALCO) has issued a new job notification for the positions of Executive Director, Gr... Bharat Earth Movers Limited (BEML) has introduced the latest job notification for the 26 Chief General Manager, Assistan... Rail India Technical and Economic Services Limited (RITES) has published the latest job notification for the 01 &nb... School of Planning and Architecture, Bhopal (SPA) has released the latest job notification for the 01 Junior Research Fe... The Na...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.271026",
      "links": []
    },
    {
      "id": "56ea27387e66431c8e7a34e7d791a0ac",
      "title": "ITI / Diploma",
      "url": "https://allgovernmentjobs.in/iti-jobs",
      "source": "allgovernmentjobs.in",
      "description": "The National Centre for Earth Science Studies (NCESS) has published the official notification for 2026. To fill up the v... The Hindustan Copper Limited (HCL) has declared the official notification for 2026. To fill up the vacancies for 47&nbsp... The Tata Memorial Centre (TMC) has declared the official notification for 2026. To fill up the vacancies for Biomed... The Rail Wheel Factory (RWF) has officially released the notification to fill the vacancies of 01 Sports Quota Posts. In... The Ra...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.271048",
      "links": []
    },
    {
      "id": "3bac3da83cb5d4a1f4731fce8cf4521d",
      "title": "Agriculture",
      "url": "https://allgovernmentjobs.in/agricultural-engineering-jobs",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Hydrology (NIH) has declared the latest job notification for 2026. To fill up the vacancies fo...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.271072",
      "links": []
    },
    {
      "id": "d4e523cadf2c56d8a5947cca18ac7d0a",
      "title": "AIIMS Kalyani Notification 2026 - Apply Online for Project Technical Support II Posts",
      "url": "https://allgovernmentjobs.in/aiims-kalyani-notification-2026-apply-online-for-project-technical-support-ii-posts/38945",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences (AIIMS Kalyani) has declared the official notification for 2026. To fill up the vacancies for Project Technical Support II Jobs. Those candidates who have qualified in the Intermediate (10+2), DMLT, and Diploma can grab this chance and apply for the AIIMS Kalyani Notification 2026 . Here we mentioned more about the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "14-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.273999",
      "links": []
    },
    {
      "id": "91710726b44f5a0a28c1214dd6bda981",
      "title": "ACTREC Recruitment 2026 - Walk-in-Interview for Clinical Trial Coordinator Posts",
      "url": "https://allgovernmentjobs.in/actrec-recruitment-2026-walk-in-interview-for-clinical-trial-coordinator-posts/38949",
      "source": "allgovernmentjobs.in",
      "description": "The Advanced Centre for Treatment Research and Education in Cancer (ACTREC) has published the official notification for 2026. To fill up the vacancies for Clinical Trial Coordinator Jobs. Those candidates who have qualified in the Post Graduation, M.Pharm, can grab this chance and apply for the ACTREC Recruitment 2026 . Here, we mentioned more information about the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.279613",
      "links": []
    },
    {
      "id": "f26d3b8da887c7294c2688afb669b4fc",
      "title": "IIT Roorkee Recruitment 2026 - Apply Offline for Junior research Fellow Post",
      "url": "https://allgovernmentjobs.in/iit-roorkee-recruitment-2026-apply-offline-for-junior-research-fellow-post/38947",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology Roorkee (IIT Roorkee) has declared the official notification for 2026. To fill up the various vacancies for Junior Research Fellow Jobs. Those candidates who have qualified in the B.E/ B.Tech, M.E/ M.Tech in Electrical Engineering can grab this chance and apply for the IIT Roorkee Recruitment 2026 . Here, we mentioned more about the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested ca...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "14-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.279639",
      "links": []
    },
    {
      "id": "0617fd7524991da91799fd984b3727b3",
      "title": "AIIMS Bathinda Recruitment 2026 - Walk-in-Interview for 03 Medical Officer Posts",
      "url": "https://allgovernmentjobs.in/aiims-bathinda-recruitment-2026-walk-in-interview-for-03-medical-officer-posts/38943",
      "source": "allgovernmentjobs.in",
      "description": "All India Institute of Medical Sciences Bathinda (AIIMS Bathinda) has declared the official notification for 2026. To fill up the vacancies for 03 Medical Officer Jobs. Those candidates who have qualified in the MBBS can grab this chance and apply for the AIIMS Bathinda Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the last date. If you are lo...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "16-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.279659",
      "links": []
    },
    {
      "id": "765bdfdf2ec4f7b9a023be4e5a6a357d",
      "title": "DLSA Muzaffarpur Recruitment 2026 - Apply Offline for 48 Para Legal Volunteers Posts",
      "url": "https://allgovernmentjobs.in/dlsa-muzaffarpur-recruitment-2026-apply-offline-for-48-para-legal-volunteers-posts/38941",
      "source": "allgovernmentjobs.in",
      "description": "District Legal Services Authority (DLSA Muzaffarpur) has declared the official notification for 2026. To fill up the vacancies for 48 Para Legal Volunteers Jobs. Those candidates who have qualified in the 10th Pass can grab this chance and apply for the DLSA Muzaffarpur Recruitment 2026 . Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply before the last date of...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "10-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.279679",
      "links": []
    },
    {
      "id": "9b118b272d2177073b8911a3bd9da6cb",
      "title": "IIT Roorkee",
      "url": "https://allgovernmentjobs.in/iit-roorkee-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Indian Institute of Technology Roorkee (IIT Roorkee) has declared the official notification for 2026. To fill up the var .... Indian Institute of Technology Roorkee (IIT Roorkee) has declaredthe latest job notification for 2026. To fill up t .... The Indian Institute of Technology Roorkee (IIT Roorkee) has officially released the notification to fill the vacancies .... The Indian Institute of Technology Roorkee (IIT Roorkee) has officially released the notification to fill the vacancies .... ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.279728",
      "links": []
    },
    {
      "id": "b7d4ffc74b6ba552028ed885740192c9",
      "title": "Kerala PSC",
      "url": "https://allgovernmentjobs.in/kerala-psc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Mahatma Gandhi University, Kerala (MGU Kerala) has declared the official notification for 2026. To fill up the vacancies .... The Kerala Veterinary and Animal Sciences University (KVASU) has officially released the notification to fill the vacanc .... Kerala Public Service Commission has declared the official notification for 2025. To fill up the vacancies for Phar .... The Kudumbashree Broiler Farmers Producers Company Limited (KBFPCL) has declared the official notification for 2025 .... The...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.279857",
      "links": []
    },
    {
      "id": "d6164005f69f5a735ec3c9b4920aad10",
      "title": "IIM Nagpur Jobs 2026 - Apply Online for Manager Posts",
      "url": "https://allgovernmentjobs.in/iim-nagpur-jobs-2026-apply-online-for-manager-posts/38942",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Management Nagpur (IIM Nagpur) has officially released the notification to fill the vacancies of 01 Manager Posts. Interested and eligible candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Any Degree, MBA can apply for the IIM Nagpur Jobs 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process, application fee,...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "17-02-2026",
        "found_date": "05-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-05T23:51:13.285443",
      "links": []
    },
    {
      "id": "d21a564eae2d0b535e39ce8be11bde22",
      "title": "GTBH Notification 2026 - Apply Online for 35 Senior Resident Posts",
      "url": "https://allgovernmentjobs.in/gtbh-notification-2026-apply-online-for-35-senior-resident-posts/38965",
      "source": "allgovernmentjobs.in",
      "description": "The Guru Teh Bahadur Hospital (GTBH) has officially released the notification to fill the vacancies of 35 Senior Resident Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their MBBS, MDS, Post-graduation, DNB, PGDM can apply for the GTBH Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process, a...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "10-02-2026",
        "found_date": "05-02-2026"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2026-02-06T23:53:01.765747",
      "links": []
    },
    {
      "id": "97e7da79caabac47bcb4a57602ee9ca4",
      "title": "IIT Patna Notification 2026 - Apply Online for Research Assistant Posts",
      "url": "https://allgovernmentjobs.in/iit-patna-notification-2026-apply-online-for-research-assistant-posts/38963",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology Patna (IIT Patna) has officially released the notification to fill the vacancies of 01 Research Assistant Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Civil Engineering can apply for the IIT Patna Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, ...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "14-02-2026",
        "found_date": "03-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-06T23:53:01.765768",
      "links": []
    },
    {
      "id": "376fe16671b5eeef15229036b8ff438a",
      "title": "HVF AVNL Notification 2026 - Apply Offline for 220 Junior Technician Posts",
      "url": "https://allgovernmentjobs.in/hvf-avnl-notification-2026-apply-offline-for-220-junior-technician-posts/38961",
      "source": "allgovernmentjobs.in",
      "description": "The Heavy Vehicles Factory (HVF) AVNL has officially released the notification to fill the vacancies of 220 Junior Technician Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their 10th can apply for the HVF AVNL Notification 2026 . The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, selection process, application fee, salary,...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "14-02-2026",
        "found_date": "25-01-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-06T23:53:01.765787",
      "links": []
    },
    {
      "id": "7d9e5e0be0e6c66c527c6697bc858e9b",
      "title": "Ministry of Defence",
      "url": "https://allgovernmentjobs.in/ministry-of-defence-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Heavy Vehicles Factory (HVF) AVNL has officially released the notification to fill the vacancies of 220 Junior Techn .... The Heavy Vehicles Factory, Avadi (HVF Avadi) has officially released the notification to fill the vacancies of 220 Juni .... Advanced Weapons & Equipment India Limited (AWEIL) has declared the official notification for 2026. To fill up the v .... The Defence Institute of Advanced Technology (DIAT Pune) has officially released the notification to fill the vacancies ......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-06T23:53:01.771524",
      "links": []
    },
    {
      "id": "e59bf68ed06238db8bb3c589d41136ba",
      "title": "AIIMS Nagpur",
      "url": "https://allgovernmentjobs.in/aiims-nagpur-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The All India Institute of Medical Sciences, Nagpur (AIIMS Nagpur) has officially released the notification to fill the .... All India Institute of Medical Sciences Nagpur (AIIMS Nagpur) has announced the official notification for 2026. To .... The All India Institute of Medical Sciences, Nagpur (AIIMS Nagpur) has officially released the notification to fill the .... All India Institute of Medical Sciences Nagpur (AIIMS Nagpur) has published the official notification for 2026. To .... All Ind...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Medical",
      "skills": [],
      "scraped_at": "2026-02-06T23:53:01.771593",
      "links": []
    },
    {
      "id": "e0aa75d44cea1d85045bffea8878534f",
      "title": "Sainik School Chhingchhip Mizoram Notification 2026 - Apply Offline for Lower Division Clerk Posts",
      "url": "https://allgovernmentjobs.in/sainik-school-chhingchhip-mizoram-notification-2026-apply-offline-for-lowe-division-clerk-posts/38993",
      "source": "allgovernmentjobs.in",
      "description": "The Sainik School Chhingchhip, Mizoram, has released the official notification for 2026. To fill up the vacacies for Lower Division Clerk Jobs. Those candidates who have qualified in the 10th Pass can use this chance and apply for the Sainik School Chhingchhip, Mizoram Notification 2026. Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply before the last date of...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "27-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-07T23:59:13.372136",
      "links": []
    },
    {
      "id": "5d2b5d029cbb10085314184a489a671a",
      "title": "DSCI Notification 2026 - Walk-in-Interview for 15Junior Resident Posts",
      "url": "https://allgovernmentjobs.in/dsci-notification-2026-walk-n-interview-for-15junior-resident-posts/38970",
      "source": "allgovernmentjobs.in",
      "description": "Delhi State Cancer Institute (DSC) has declared the latest job notification for 2026. To fill up the 15 vacancies for Junior Resident Jobs. Those candidates who have qualified in the MBBS can grab this chance and apply for the DSCI Notification 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested aspirants can attend the walk-in at the address below. If you are looking for more, here is a ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-02-2026"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2026-02-07T23:59:13.372168",
      "links": []
    },
    {
      "id": "c72b3196f5892d8f2a739d344b3bf12f",
      "title": "ASTEC Notification 2026 - Walk-in interview for Programme Officer Posts",
      "url": "https://allgovernmentjobs.in/astec-notification-2026-walk-in-interview-for-programme-officer-posts/39008",
      "source": "allgovernmentjobs.in",
      "description": "The Assam Science and Technology and Environment Council (ASTEC) has officially released the notification to fill the vacancies of 01 Programme Officer Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their Diploma or Post-graduation can apply for the ASTEC Notification 2026. The interested applicants can attend the walk-in interview. Here we have mentioned the education details, age...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "20-02-2026",
        "found_date": "05-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-07T23:59:13.372191",
      "links": []
    },
    {
      "id": "ce0cb74faceaad0d98860c8d5a9481a9",
      "title": "MRVC Notification 2026 - Apply Offline for Deputy General Manager Posts",
      "url": "https://allgovernmentjobs.in/mrvc-notification-2026-apply-offline-for-deputy-general-manager-posts/39006",
      "source": "allgovernmentjobs.in",
      "description": "The Mumbai Railway Vikas Corporation (MRVC) has officially released the notification to fill the vacancies of 01 Deputy General Manager Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Civil Engineering can apply for the MRVC Notification 2026. The interested applicants can apply in offline mode. Here we have mentioned the education details, age limit, selection...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "05-03-2026",
        "found_date": "06-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-07T23:59:13.372210",
      "links": []
    },
    {
      "id": "e3c465e9a9847c241395008723a303e2",
      "title": "BSAMCH Notification 2026 - Apply Online for 20 Junior Resident Posts",
      "url": "https://allgovernmentjobs.in/bsamch-notification-2026-apply-online-for-20-junior-resident-posts/39004",
      "source": "allgovernmentjobs.in",
      "description": "Dr Baba Saheb Ambedkar Hospital and Medical College (BSAMCH) has officially released the notification to fill the vacancies of 20 Junior Resident Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their MBBS can apply for the BSAMCH Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process, applicat...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "13-02-2026",
        "found_date": "01-02-2026"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2026-02-07T23:59:13.372228",
      "links": []
    },
    {
      "id": "1c4bf6d1cf433d22346046b1d6f75c11",
      "title": "NPCIL Notification 2026 - Apply Online for 30 Executive Trainee Posts",
      "url": "https://allgovernmentjobs.in/npcil-notification-2026-apply-online-for-30-executive-trainee-posts/39002",
      "source": "allgovernmentjobs.in",
      "description": "The Nuclear Power Corporation of India Limited (NPCIL) has officially released the notification to fill the vacancies of 30 Executive Trainee posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech can apply for the NPCIL Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection process, appli...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "04-03-2026",
        "found_date": "11-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-07T23:59:13.372250",
      "links": []
    },
    {
      "id": "806cb22e22dcd9bc2aa38a03ff077f0e",
      "title": "Ambedkar University Recruitment 2026 - Apply Offline for Research Assistant Posts",
      "url": "https://allgovernmentjobs.in/ambedkar-recruitment-2026-apply-offline-for-research-assistant-posts/38997",
      "source": "allgovernmentjobs.in",
      "description": "Ambedkar University University Delhi has declared the official notification for 2026. To fill up the various vacancies for Research Assistant Jobs. Those candidates who have qualified in the Post Graduation, M.Sc can grab this chance and apply for the Ambedkar University Recruitment 2026 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the last date. If you are loo...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "20-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-07T23:59:13.377957",
      "links": []
    },
    {
      "id": "97c0a44f4d37aaaaf2db61770fb2332d",
      "title": "AERA Recruitment 2026 - Apply Offline for 03 Data Analyst Posts",
      "url": "https://allgovernmentjobs.in/aera-recruitment-2026-apply-offline-for-03-data-analyst-posts/39007",
      "source": "allgovernmentjobs.in",
      "description": "The Airports Economic Regulatory Authority of India (AERA) has declared the official notification for 2026. To fill up the vacancies for 03 Data Analyst Jobs. Those candidates who have qualified in Any Degree can grab this chance and apply for the AERA Recruitment 2026 . Here, we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the last date of application. If you are lookin...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "18-02-2026"
      },
      "category": "Banking",
      "skills": [
        "Analyst",
        "Data Entry"
      ],
      "scraped_at": "2026-02-07T23:59:13.377982",
      "links": []
    },
    {
      "id": "1db9398369d599c417dcecd736a78736",
      "title": "NHAI Recruitment 2026 - Apply Online for 06 Chief General Manager Posts",
      "url": "https://allgovernmentjobs.in/nhai-recruitment-2026-apply-online-for-06-chief-general-manager-posts/39005",
      "source": "allgovernmentjobs.in",
      "description": "The National Highways Authority of India (NHAI) has declared the official notification for 2026. To fill up the vacancies for 06 Chief General Manager Jobs. Those candidates who have qualified in the B.E/ B.Tech in Civil Engineering can grab this chance and apply for the NHAI Recruitment 2026 . Here we include the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply online before the last date. If...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "06-03-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-07T23:59:13.378001",
      "links": []
    },
    {
      "id": "a79a7baf2a2e8ab579413430e919a3f6",
      "title": "NEIST Recruitment 2026 - Walk-in-Interview for Project Associate I Posts",
      "url": "https://allgovernmentjobs.in/neist-recruitment-2026-walk-in-interview-for-project-associate-i-posts/39003",
      "source": "allgovernmentjobs.in",
      "description": "North East Institute of Science and Technology (NEIST) has declared the latest jobs notifiction for various Project Associate I Jobs. Those candidates who have qualified in the M.E/ M.Tech, M.Sc can grab this chance and apply for the NEIST Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can attend the walk-in at the address below. If you are looking for more, he...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "12-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-07T23:59:13.378021",
      "links": []
    },
    {
      "id": "01d9cf5f866e9cd395bd5547f92360f6",
      "title": "Sainik School",
      "url": "https://allgovernmentjobs.in/sainik-school-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Sainik School Chhingchhip, Mizoram, has released the official notification for 2026. To fill up the vacacies for&nbs .... Sainik School Kodagu has published the official notification for 2025. To fill up the vacancies for 04 Art Master a .... Sainik School has announced the official notification for 2025. To fill up the vacancies for 03 Librarian, Band Mas .... The Sainik School has announced the official notification for 2025. To fill up the vacancies for 02 General Employe ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Teaching",
      "skills": [],
      "scraped_at": "2026-02-07T23:59:13.378043",
      "links": []
    },
    {
      "id": "3a6717948d9527bdb6cc7ec9d498e532",
      "title": "Ambedkar University Delhi",
      "url": "https://allgovernmentjobs.in/ambedkar-university-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Ambedkar University University Delhi has declared the official notification for 2026. To fill up the various vacanc ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-02-07T23:59:13.378068",
      "links": []
    },
    {
      "id": "19e10a4892df852dc6a84935fc7b0f46",
      "title": "BSAMCH",
      "url": "https://allgovernmentjobs.in/bsamch-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Dr Baba Saheb Ambedkar Hospital and Medical College (BSAMCH) has officially released the notification to fill the vacanc .... The Dr Baba Saheb Ambedkar Hospital and Medical College (BSAMCH) has officially released the notification to fill the va .... Dr Baba Saheb Ambedkar Hospital and Medical College has declared the official notification for 2025. To fill up the vaca ....",
      "pdf_link": null,
      "important_dates": {},
      "category": "Teaching",
      "skills": [],
      "scraped_at": "2026-02-07T23:59:13.378142",
      "links": []
    },
    {
      "id": "ac8056695ac9c7f71e3d48ddbcd7bcc2",
      "title": "Bank Jobs",
      "url": "https://allgovernmentjobs.in/bank-jobs-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "Rajkot Nagarik Sahakari Bank (RNSB) has declared the latest job notification for 2026. To fill up the vacancies for&nbsp .... The Reserve Bank of India (RBI) has declared the official notification for 2026. To fill up the vacancies for 21 Ma .... The Punjab National Bank (PNB Bank) has officially released the notification to fill the vacancies of 5138 Apprentice Po .... The Bank of Baroda (BOB) has officially released the notification to fill the vacancies of 418 Senior Manager, Mana .... The...",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-07T23:59:13.378202",
      "links": []
    },
    {
      "id": "ba6115c98ce6f183246a0a44c86df329",
      "title": "HSSC Notification 2026 - Apply Online for 779 Forest Guard Posts",
      "url": "https://allgovernmentjobs.in/hssc-notification-2026-apply-online-for-779-forest-guard-posts/39044",
      "source": "allgovernmentjobs.in",
      "description": "The Haryana Staff Selection Commission (HSSC) has officially released a recruitment notification for 799 Forest Guard Positions. Those candidates who have qualified in the 10th Pass or 12th can grab this chance and apply for the HSSC Notification 202 6. Here we provided more about the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can apply before the last date of application. If you are ...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "23-02-2026"
      },
      "category": "Banking",
      "skills": [
        "Data Entry"
      ],
      "scraped_at": "2026-02-10T00:03:14.643878",
      "links": []
    },
    {
      "id": "f5f182918efea32505717509dcab984b",
      "title": "IIT Madras Notification 2026 - Apply Online for 02 Software Test Engineer. Automation Tester Posts",
      "url": "https://allgovernmentjobs.in/iit-madras-notification-2026-apply-online-for-02-software-test-engineer-automation-tester-posts/39038",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Technology Madras (IIT Madras) has officially released the notification to fill the vacancies of 02 Software Test Engineer/ Automation Tester Jobs. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech., MCA, M.Sc. can apply for the IIT Madras Notification 2026. The interested applicants can apply in online mode. Here we have mentioned the education det...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "23-02-2026",
        "found_date": "09-02-2026"
      },
      "category": "Banking",
      "skills": [
        "Data Entry",
        "Automation"
      ],
      "scraped_at": "2026-02-10T00:03:14.643904",
      "links": []
    },
    {
      "id": "38f3aee1ef03775139d10df8a01c008e",
      "title": "DHFWS Bangalore Recruitment 2026 - Walk-in-Interview for 06 Specialist Doctor Posts",
      "url": "https://allgovernmentjobs.in/dhfws-bangalore-recruitment-2026-walk-in-interview-for-06-specialist-doctor-posts/39047",
      "source": "allgovernmentjobs.in",
      "description": "District Health and Family Welfare Society (DHFWS Bangalore) has declared the official notification for 2026. To fill up the vacancies for 06 Specialist Doctor Jobs. Those candidates who have qualified in the MD and DNB can grab this chance and apply for the DHFWS Bangalore Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can attend the walk-in at the address bel...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "13-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-10T00:03:14.649564",
      "links": []
    },
    {
      "id": "2bfc0321b88dc01bdb9e2ca2d06b3351",
      "title": "PGIMER Recruitment 2026 - Apply Offline for Project Research Scientist II Posts",
      "url": "https://allgovernmentjobs.in/pgimer-recruitment-2026-apply-offline-for-project-research-scientist-ii-posts/39043",
      "source": "allgovernmentjobs.in",
      "description": "Postgraduate Institute of Medical Education and Research (PGIMER) has declared the official notification for various Project Research Scientist II Jobs. Those candidates who have qualified for the PGIMER Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can apply before the last date of application. If you are looking for more, here is a list of Government Jobs in...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "19-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-10T00:03:14.649588",
      "links": []
    },
    {
      "id": "1f9e6fb176a1976451c1154a6c7aae8b",
      "title": "SPA Vijayawada Recruitment 2026 - Walk-in-Interview for Faculty Posts",
      "url": "https://allgovernmentjobs.in/spa-vijayawada-recruitment-2026-walk-in-interview-for-faculty-posts/39040",
      "source": "allgovernmentjobs.in",
      "description": "School of Planning and Architecture Vijayawada (SPA Vijayawada) has announced the official notification for 2026. To fill upthe vacancies for Faculty Jobs. Those candidates who have qualified for any degree can grab this chance and apply for the SPA Vijayawada Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested candidates can attend the walk-in at the address below. If you are...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "10-02-2026"
      },
      "category": "Banking",
      "skills": [
        "Analyst"
      ],
      "scraped_at": "2026-02-10T00:03:14.649608",
      "links": []
    },
    {
      "id": "92ae2f95366560db4d80e65d6c47d697",
      "title": "TMC Recruitment 2026 - Walk-in-Interview for 03 Senior Resident Posts",
      "url": "https://allgovernmentjobs.in/tmc-recruitment-2026-walk-in-interview-for-03-senior-resident-posts/39039",
      "source": "allgovernmentjobs.in",
      "description": "The Tata Memorial Centre (TMC) has declared the official notification for 2026. To fill up the vacancies for 03 Senior Resident Jobs. Those candidates who have qualified in the MD/ MS, DNB, and MDS can grab this chance and apply for the TMC Recruitment 2026 . Here, we included the age limit, selection process, salary structure, education details, application fee, and how to apply for these posts. Interested and eligible candidates can attend the walk-in at the address below. If you are lookin...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "11-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-10T00:03:14.649626",
      "links": []
    },
    {
      "id": "020a63a046010dd609db47bf71d839e2",
      "title": "UPPSC",
      "url": "https://allgovernmentjobs.in/uppsc-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Uttar Pradesh Anganwadi (UP Anganwadi) has officially released the notification to fill the vacancies of 13 Anganwad .... Uttar Pradesh Police has declared the official notification for 2026. To fill up the vacancies for 32679 Constable .... The Uttar Pradesh Public Service Commission (UPPSC) has officially released the notification to fill the vacancies of 25 .... The Uttar Pradesh Public Service Commission (UPPSC) has officially released the notification to fill the vacancies of 51 .......",
      "pdf_link": null,
      "important_dates": {},
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-10T00:03:14.649649",
      "links": []
    },
    {
      "id": "caa9a545913bb60244bceae5c58a8ab3",
      "title": "NIT Raipur",
      "url": "https://allgovernmentjobs.in/nit-raipur-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The National Institute of Technology Raipur (NIT Raipur) has officially released the notification to fill the vacancies .... The National Institute of Technology Raipur (NIT Raipur) has officially released the notification to fill the vacancies .... The National Institute of Technology (NIT Raipur) has declared the official notification for 2026. To fill up the variou .... The National Institute of Technology, Raipur (NIT Raipur) has officially released the notification to fill the vacancies ...",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-02-10T00:03:14.649684",
      "links": []
    },
    {
      "id": "28af39f0be1c2307bff53b480370d366",
      "title": "IIM Lucknow",
      "url": "https://allgovernmentjobs.in/iim-lucknow-recruitment",
      "source": "allgovernmentjobs.in",
      "description": "The Indian Institute of Management Lucknow (IIM Lucknow) has officially released the notification to fill the vacancies .... The Indian Institute of Management Lucknow (IIM Lucknow) has officially released the notification to fill the vacancies .... The Indian Institute of Management Lucknow (IIM Lucknow) has officially released the notification to fill the vacancies .... The Indian Institute of Management Lucknow (IIM Lucknow) has officially released the notification to fill the vacancies .....",
      "pdf_link": null,
      "important_dates": {},
      "category": "IT",
      "skills": [],
      "scraped_at": "2026-02-10T00:03:14.649706",
      "links": []
    },
    {
      "id": "23a74982edaf7c98807b2fe0961f68fc",
      "title": "UP Anganwadi Jobs 2026 - Apply Online for 13 Anganwadi Worker Posts",
      "url": "https://allgovernmentjobs.in/up-anganwadi-jobs-2026-apply-online-for-13-anganwadi-worker-posts/39046",
      "source": "allgovernmentjobs.in",
      "description": "The Uttar Pradesh Anganwadi (UP Anganwadi) has officially released the notification to fill the vacancies of 13 Anganwadi Worker Posts. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their 10th, Any Degree, or post-graduation can apply for the UP Anganwadi Jobs 2026. The interested applicants can apply in online mode. Here we have mentioned the education details, age limit, selection proc...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "27-02-2026",
        "found_date": "07-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-10T00:03:14.655391",
      "links": []
    },
    {
      "id": "ac5cc4f7ea4aefc002691d710822c13a",
      "title": "AIIMS Bhopal Jobs 2026 - Apply Online for 02 Project Technician III, Data Entry Operator Posts",
      "url": "https://allgovernmentjobs.in/aiims-bhopal-jobs-2026-apply-online-for-02-project-technician-iii-data-entry-operator-posts/39042",
      "source": "allgovernmentjobs.in",
      "description": "The All India Institute of Medical Sciences, Bhopal ( AIIMS Bhopal) has officially released the notification to fill the vacancies of 02 Project Technician III, Data Entry Operator Jobs. Interested and eligibile candidates can use this opportunity to apply for these posts before the last date of application. Candidates who have completed their B.E./B. Tech in Electrical, Mechanical Engineering, 12th can apply for the AIIMS Bhopal Jobs 2026. The interested applicants can apply in online mode. ...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "20-02-2026",
        "found_date": "04-02-2026"
      },
      "category": "Banking",
      "skills": [
        "Data Entry",
        "Automation"
      ],
      "scraped_at": "2026-02-10T00:03:14.655424",
      "links": []
    },
    {
      "id": "2ff3862529d546751099416a2815656c",
      "title": "India Post GDS Online Form 2026",
      "url": "https://www.rojgarresult.com/india-post-gds-2026/",
      "source": "www.rojgarresult.com",
      "description": "India Post GDS Recruitment 2026: Apply for 28635 Post Post Update Date: 09-02-2026 Short Description: India Post GDS Recruitment 2026 Apply Online Form : India Post Gramin Dak Sevak Online Form 2026 for 28635 Post , Notification has been released on the website @https://indiapostgdsonline.gov.in/ & Application Form now started on 31 January 2026 to 14 February 2026. Department of Post Jobs 2026. Get the direct link to download notification link available on India Post GDS Vacancy 2026 Officia...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "09-02-2026"
      },
      "category": "Banking",
      "skills": [
        "Hindi",
        "English",
        "Mathematics"
      ],
      "scraped_at": "2026-02-10T00:03:38.976490",
      "links": [
        "https://indiapostgdsonline.gov.in/"
      ]
    },
    {
      "id": "2bbe28cf396a162f7926223a69bc6080",
      "title": "Bihar Police Constable GD Online Form",
      "url": "https://www.rojgarresult.com/csbc-bihar-police-constable-gd-2026/",
      "source": "www.rojgarresult.com",
      "description": "CSBC Bihar Police Constable General Duty Recruitment 2025 Apply Online for 83 Post Post Update Date: 06-02-2026 Short Description: Central Selection Board of Constable Recruitment 2026 for 83 Post: Official Notification is released and Online Form Now Started on 06 February to 05 March 2026 is Last Date for Upcoming CSBC Bihar Police Constable General Duty. (Advt. No. 01/2026) Exam, Vacancy 2026 Full Notification available at the official website. All the candidates can now check the detailed...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "06-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-10T00:03:38.976536",
      "links": []
    },
    {
      "id": "494ba05366a0fd4dd464b6ee89742a9b",
      "title": "UP Police Constable Correction Form",
      "url": "https://www.rojgarresult.com/up-police-constable-32679/",
      "source": "www.rojgarresult.com",
      "description": "Uttar Pradesh Police Recruitment & Promotion Board UPPRPB Constable Recruitment 2025 Exam Date/Sample OMR Sheet for 32679 Post Post Update Date: 03-02-2026 Short Description: Uttar Pradesh Police Recruitment & Promotion Board Constable Online Form 2026 : Uttar Pradesh Police Recruitment & Promotion Board UPPRPB Applications for Constable 2025 Recruitment in Uttar Pradesh Police candidates can apply till 30 January 2026, candidates must read the notification for complete information related to...",
      "pdf_link": null,
      "important_dates": {
        "exam_date": "08/06/2026",
        "found_date": "03-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-10T00:03:38.976581",
      "links": []
    },
    {
      "id": "247d70764b328ce1a130c386faf300c8",
      "title": "UPSC Civil Services IAS IFS Online Form",
      "url": "https://www.rojgarresult.com/upsc-civil-services-ias-ifs-2026/",
      "source": "www.rojgarresult.com",
      "description": "UPSC Civil Services IAS IFS Recruitment 2026: Apply for 1013 Post Post Update Date: 09-02-2026 Short Description: UPSC Civil Services IAS IFS Recruitment 2026 Apply Online Form : UPSC Civil Services Online Form 2026, Notification has been released on the website @https://upsc.gov.in/ & Application Form now started on 04 February 2026 to 24 February 2026. Union Public Service Commission Jobs 2026. Get the direct link to download notification link available on UPSC Civil Services IAS Vacancy 20...",
      "pdf_link": null,
      "important_dates": {
        "found_date": "09-02-2026"
      },
      "category": "Banking",
      "skills": [
        "Hindi",
        "English",
        "Mathematics"
      ],
      "scraped_at": "2026-02-10T00:03:38.976604",
      "links": [
        "https://upsc.gov.in/"
      ]
    },
    {
      "id": "dc8e96f9b740a1df79a3c258ed0c8f73",
      "title": "Punjab Teacher Eligibility Test PSTET Online Form 2026",
      "url": "https://www.rojgarresult.com/punjab-teacher-eligibility-test-pstet-2026/",
      "source": "www.rojgarresult.com",
      "description": "Punjab Teacher Eligibility Test PSTET 2026 Online Form 2026 Post Update Date: 09-02-2026 Short Description: Punjab School Education Board (PSEB) has released the Punjab Teacher Eligibility Test PSTET 2026 Exam Date Notice. Those Candidates are Interested to the Following Exam Can Apply Online From As per Schedule Date.candidates should read the PSTET 2026 information brochure for all the information related to the PSTET exam like syllabus, eligibility, age limit, fees, Primary and Junior Leve...",
      "pdf_link": null,
      "important_dates": {
        "last_date": "20-02-2026",
        "exam_date": "15-03-2026",
        "found_date": "09-02-2026"
      },
      "category": "Banking",
      "skills": [],
      "scraped_at": "2026-02-10T00:03:38.976797",
      "links": []
    }
  ]
}